{"id": "2508.08383", "pdf": "https://arxiv.org/pdf/2508.08383.pdf", "abs": "https://arxiv.org/abs/2508.08383", "title": "Designing for Disclosure in Data Visualizations", "authors": ["Krisha Mehta", "Gordon Kindlmann", "Alex Kale"], "categories": ["cs.HC"], "comment": "11 pages, 6 figures", "summary": "Visualizing data often entails data transformations that can reveal and hide\ninformation, operations we dub disclosure tactics. Whether designers hide\ninformation intentionally or as an implicit consequence of other design\nchoices, tools and frameworks for visualization offer little explicit guidance\non disclosure. To systematically characterize how visualizations can limit\naccess to an underlying dataset, we contribute a content analysis of 425\nexamples of visualization techniques sampled from academic papers in the\nvisualization literature, resulting in a taxonomy of disclosure tactics. Our\ntaxonomy organizes disclosure tactics based on how they change the data\nrepresentation underlying a chart, providing a systematic way to reason about\ndesign trade-offs in terms of what information is revealed, distorted, or\nhidden. We demonstrate the benefits of using our taxonomy by showing how it can\nguide reasoning in design scenarios where disclosure is a first-order\nconsideration. Adopting disclosure as a framework for visualization research\noffers new perspective on authoring tools, literacy, uncertainty communication,\npersonalization, and ethical design."}
{"id": "2508.08467", "pdf": "https://arxiv.org/pdf/2508.08467.pdf", "abs": "https://arxiv.org/abs/2508.08467", "title": "Empowering Children to Create AI-Enabled Augmented Reality Experiences", "authors": ["Lei Zhang", "Shuyao Zhou", "Amna Liaqat", "Tinney Mak", "Brian Berengard", "Emily Qian", "Andrés Monroy-Hernández"], "categories": ["cs.HC", "cs.AI", "cs.GR", "cs.PL"], "comment": "Accepted to ACM UIST 2025", "summary": "Despite their potential to enhance children's learning experiences,\nAI-enabled AR technologies are predominantly used in ways that position\nchildren as consumers rather than creators. We introduce Capybara, an AR-based\nand AI-powered visual programming environment that empowers children to create,\ncustomize, and program 3D characters overlaid onto the physical world. Capybara\nenables children to create virtual characters and accessories using text-to-3D\ngenerative AI models, and to animate these characters through auto-rigging and\nbody tracking. In addition, our system employs vision-based AI models to\nrecognize physical objects, allowing children to program interactive behaviors\nbetween virtual characters and their physical surroundings. We demonstrate the\nexpressiveness of Capybara through a set of novel AR experiences. We conducted\nuser studies with 20 children in the United States and Argentina. Our findings\nsuggest that Capybara can empower children to harness AI in authoring\npersonalized and engaging AR experiences that seamlessly bridge the virtual and\nphysical worlds."}
{"id": "2508.08502", "pdf": "https://arxiv.org/pdf/2508.08502.pdf", "abs": "https://arxiv.org/abs/2508.08502", "title": "AirSignatureDB: Exploring In-Air Signature Biometrics in the Wild and its Privacy Concerns", "authors": ["Marta Robledo-Moreno", "Ruben Vera-Rodriguez", "Ruben Tolosana", "Javier Ortega-Garcia", "Andres Huergo", "Julian Fierrez"], "categories": ["cs.HC"], "comment": null, "summary": "Behavioral biometrics based on smartphone motion sensors are growing in\npopularity for authentication purposes. In this study, AirSignatureDB is\npresented: a new publicly accessible dataset of in-air signatures collected\nfrom 108 participants under real-world conditions, using 83 different\nsmartphone models across four sessions. This dataset includes genuine samples\nand skilled forgeries, enabling a comprehensive evaluation of system robustness\nagainst realistic attack scenarios. Traditional and deep learning-based methods\nfor in-air signature verification are benchmarked, while analyzing the\ninfluence of sensor modality and enrollment strategies. Beyond verification, a\nfirst approach to reconstructing the three-dimensional trajectory of in-air\nsignatures from inertial sensor data alone is introduced. Using on-line\nhandwritten signatures as a reference, we demonstrate that the recovery of\naccurate trajectories is feasible, challenging the long-held assumption that\nin-air gestures are inherently traceless. Although this approach enables\nforensic traceability, it also raises critical questions about the privacy\nboundaries of behavioral biometrics. Our findings underscore the need for a\nreevaluation of the privacy assumptions surrounding inertial sensor data, as\nthey can reveal user-specific information that had not previously been\nconsidered in the design of in-air signature systems."}
{"id": "2508.08505", "pdf": "https://arxiv.org/pdf/2508.08505.pdf", "abs": "https://arxiv.org/abs/2508.08505", "title": "Adaptique: Multi-objective and Context-aware Online Adaptation of Selection Techniques in Virtual Reality", "authors": ["Chao-Jung Lai", "Mauricio Sousa", "Tianyu Zhang", "Ludwig Sidenmark", "Tovi Grossman"], "categories": ["cs.HC"], "comment": "16 pages, 7 figures, to appear in Proceedings of the 38th Annual ACM\n  Symposium on User Interface Software and Technology (UIST '25), September\n  28-October 1, 2025, Busan, Republic of Korea", "summary": "Selection is a fundamental task that is challenging in virtual reality due to\nissues such as distant and small targets, occlusion, and target-dense\nenvironments. Previous research has tackled these challenges through various\nselection techniques, but complicates selection and can be seen as tedious\noutside of their designed use case. We present Adaptique, an adaptive model\nthat infers and switches to the most optimal selection technique based on user\nand environmental information. Adaptique considers contextual information such\nas target size, distance, occlusion, and user posture combined with four\nobjectives: speed, accuracy, comfort, and familiarity which are based on\nfundamental predictive models of human movement for technique selection. This\nenables Adaptique to select simple techniques when they are sufficiently\nefficient and more advanced techniques when necessary. We show that Adaptique\nis more preferred and performant than single techniques in a user study, and\ndemonstrate Adaptique's versatility in an application."}
{"id": "2508.08262", "pdf": "https://arxiv.org/pdf/2508.08262.pdf", "abs": "https://arxiv.org/abs/2508.08262", "title": "Argument Quality Annotation and Gender Bias Detection in Financial Communication through Large Language Models", "authors": ["Alaa Alhamzeh", "Mays Al Rebdawi"], "categories": ["cs.CL", "68T50", "I.2.7; H.3.1"], "comment": "8 pages, 4 figures, Passau uni, Master thesis in NLP", "summary": "Financial arguments play a critical role in shaping investment decisions and\npublic trust in financial institutions. Nevertheless, assessing their quality\nremains poorly studied in the literature. In this paper, we examine the\ncapabilities of three state-of-the-art LLMs GPT-4o, Llama 3.1, and Gemma 2 in\nannotating argument quality within financial communications, using the\nFinArgQuality dataset. Our contributions are twofold. First, we evaluate the\nconsistency of LLM-generated annotations across multiple runs and benchmark\nthem against human annotations. Second, we introduce an adversarial attack\ndesigned to inject gender bias to analyse models responds and ensure model's\nfairness and robustness. Both experiments are conducted across three\ntemperature settings to assess their influence on annotation stability and\nalignment with human labels. Our findings reveal that LLM-based annotations\nachieve higher inter-annotator agreement than human counterparts, though the\nmodels still exhibit varying degrees of gender bias. We provide a multifaceted\nanalysis of these outcomes and offer practical recommendations to guide future\nresearch toward more reliable, cost-effective, and bias-aware annotation\nmethodologies."}
{"id": "2508.08524", "pdf": "https://arxiv.org/pdf/2508.08524.pdf", "abs": "https://arxiv.org/abs/2508.08524", "title": "StreetViewAI: Making Street View Accessible Using Context-Aware Multimodal AI", "authors": ["Jon E. Froehlich", "Alexander Fiannaca", "Nimer Jaber", "Victor Tsara", "Shaun Kane"], "categories": ["cs.HC", "cs.AI", "H.5; I.2"], "comment": "Accepted to UIST'25", "summary": "Interactive streetscape mapping tools such as Google Street View (GSV) and\nMeta Mapillary enable users to virtually navigate and experience real-world\nenvironments via immersive 360{\\deg} imagery but remain fundamentally\ninaccessible to blind users. We introduce StreetViewAI, the first-ever\naccessible street view tool, which combines context-aware, multimodal AI,\naccessible navigation controls, and conversational speech. With StreetViewAI,\nblind users can virtually examine destinations, engage in open-world\nexploration, or virtually tour any of the over 220 billion images and 100+\ncountries where GSV is deployed. We iteratively designed StreetViewAI with a\nmixed-visual ability team and performed an evaluation with eleven blind users.\nOur findings demonstrate the value of an accessible street view in supporting\nPOI investigations and remote route planning. We close by enumerating key\nguidelines for future work."}
{"id": "2508.08265", "pdf": "https://arxiv.org/pdf/2508.08265.pdf", "abs": "https://arxiv.org/abs/2508.08265", "title": "TurQUaz at CheckThat! 2025: Debating Large Language Models for Scientific Web Discourse Detection", "authors": ["Tarık Saraç", "Selin Mergen", "Mucahid Kutlu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "In this paper, we present our work developed for the scientific web discourse\ndetection task (Task 4a) of CheckThat! 2025. We propose a novel council debate\nmethod that simulates structured academic discussions among multiple large\nlanguage models (LLMs) to identify whether a given tweet contains (i) a\nscientific claim, (ii) a reference to a scientific study, or (iii) mentions of\nscientific entities. We explore three debating methods: i) single debate, where\ntwo LLMs argue for opposing positions while a third acts as a judge; ii) team\ndebate, in which multiple models collaborate within each side of the debate;\nand iii) council debate, where multiple expert models deliberate together to\nreach a consensus, moderated by a chairperson model. We choose council debate\nas our primary model as it outperforms others in the development test set.\nAlthough our proposed method did not rank highly for identifying scientific\nclaims (8th out of 10) or mentions of scientific entities (9th out of 10), it\nranked first in detecting references to scientific studies."}
{"id": "2508.08554", "pdf": "https://arxiv.org/pdf/2508.08554.pdf", "abs": "https://arxiv.org/abs/2508.08554", "title": "Explore, Listen, Inspect: Supporting Multimodal Interaction with 3D Surface and Point Data Visualizations", "authors": ["Sanchita S. Kamath", "Aziz N. Zeidieh", "JooYoung Seo"], "categories": ["cs.HC"], "comment": null, "summary": "Blind and low-vision (BLV) users remain largely excluded from\nthree-dimensional (3D) surface and point data visualizations due to the\nreliance on visual interaction. Existing approaches inadequately support\nnon-visual access, especially in browser-based environments. This study\nintroduces DIXTRAL, a hosted web-native system, co-designed with BLV\nresearchers to address these gaps through multimodal interaction. Conducted\nwith two blind and one sighted researcher, this study took place over sustained\ndesign sessions. Data were gathered through iterative testing of the prototype,\ncollecting feedback on spatial navigation, sonification, and usability.\nCo-design observations demonstrate that synchronized auditory, visual, and\ntextual feedback, combined with keyboard and gamepad navigation, enhances both\nstructure discovery and orientation. DIXTRAL aims to improve access to 3D\ncontinuous scalar fields for BLV users and inform best practices for creating\ninclusive 3D visualizations."}
{"id": "2508.08271", "pdf": "https://arxiv.org/pdf/2508.08271.pdf", "abs": "https://arxiv.org/abs/2508.08271", "title": "Heartificial Intelligence: Exploring Empathy in Language Models", "authors": ["Victoria Williams", "Benjamin Rosman"], "categories": ["cs.CL", "cs.HC"], "comment": "21 pages, 5 tables", "summary": "Large language models have become increasingly common, used by millions of\npeople worldwide in both professional and personal contexts. As these models\ncontinue to advance, they are frequently serving as virtual assistants and\ncompanions. In human interactions, effective communication typically involves\ntwo types of empathy: cognitive empathy (understanding others' thoughts and\nemotions) and affective empathy (emotionally sharing others' feelings). In this\nstudy, we investigated both cognitive and affective empathy across several\nsmall (SLMs) and large (LLMs) language models using standardized psychological\ntests. Our results revealed that LLMs consistently outperformed humans -\nincluding psychology students - on cognitive empathy tasks. However, despite\ntheir cognitive strengths, both small and large language models showed\nsignificantly lower affective empathy compared to human participants. These\nfindings highlight rapid advancements in language models' ability to simulate\ncognitive empathy, suggesting strong potential for providing effective virtual\ncompanionship and personalized emotional support. Additionally, their high\ncognitive yet lower affective empathy allows objective and consistent emotional\nsupport without running the risk of emotional fatigue or bias."}
{"id": "2508.08582", "pdf": "https://arxiv.org/pdf/2508.08582.pdf", "abs": "https://arxiv.org/abs/2508.08582", "title": "CoSight: Exploring Viewer Contributions to Online Video Accessibility Through Descriptive Commenting", "authors": ["Ruolin wang", "Xingyu Liu", "Biao Wang", "Wayne Zhang", "Ziqian Liao", "Ziwen Li", "Amy Pavel", "Xiang 'Anthony' Chen"], "categories": ["cs.HC", "K.4.2"], "comment": "ACM UIST", "summary": "The rapid growth of online video content has outpaced efforts to make visual\ninformation accessible to blind and low vision (BLV) audiences. While\nprofessional Audio Description (AD) remains the gold standard, it is costly and\ndifficult to scale across the vast volume of online media. In this work, we\nexplore a complementary approach to broaden participation in video\naccessibility: engaging everyday video viewers at their watching and commenting\ntime. We introduce CoSight, a Chrome extension that augments YouTube with\nlightweight, in-situ nudges to support descriptive commenting. Drawing from\nFogg's Behavior Model, CoSight provides visual indicators of accessibility\ngaps, pop-up hints for what to describe, reminders to clarify vague comments,\nand related captions and comments as references. In an exploratory study with\n48 sighted users, CoSight helped integrate accessibility contribution into\nnatural viewing and commenting practices, resulting in 89% of comments\nincluding grounded visual descriptions. Follow-up interviews with four BLV\nviewers and four professional AD writers suggest that while such comments do\nnot match the rigor of professional AD, they can offer complementary value by\nconveying visual context and emotional nuance for understanding the videos."}
{"id": "2508.08272", "pdf": "https://arxiv.org/pdf/2508.08272.pdf", "abs": "https://arxiv.org/abs/2508.08272", "title": "Real-time News Story Identification", "authors": ["Tadej Škvorc", "Nikola Ivačič", "Sebastjan Hribar", "Marko Robnik-Šikonja"], "categories": ["cs.CL"], "comment": null, "summary": "To improve the reading experience, many news sites organize news into topical\ncollections, called stories. In this work, we present an approach for\nimplementing real-time story identification for a news monitoring system that\nautomatically collects news articles as they appear online and processes them\nin various ways. Story identification aims to assign each news article to a\nspecific story that the article is covering. The process is similar to text\nclustering and topic modeling, but requires that articles be grouped based on\nparticular events, places, and people, rather than general text similarity (as\nin clustering) or general (predefined) topics (as in topic modeling). We\npresent an approach to story identification that is capable of functioning in\nreal time, assigning articles to stories as they are published online. In the\nproposed approach, we combine text representation techniques, clustering\nalgorithms, and online topic modeling methods. We combine various text\nrepresentation methods to extract specific events and named entities necessary\nfor story identification, showing that a mixture of online topic-modeling\napproaches such as BERTopic, DBStream, and TextClust can be adapted for story\ndiscovery. We evaluate our approach on a news dataset from Slovene media\ncovering a period of 1 month. We show that our real-time approach produces\nsensible results as judged by human evaluators."}
{"id": "2508.08672", "pdf": "https://arxiv.org/pdf/2508.08672.pdf", "abs": "https://arxiv.org/abs/2508.08672", "title": "Imposing AI: Deceptive design patterns against sustainability", "authors": ["Anaëlle Beignon", "Thomas Thibault", "Nolwenn Maudet"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "Generative AI is being massively deployed in digital services, at a scale\nthat will result in significant environmental harm. We document how tech\ncompanies are transforming established user interfaces to impose AI use and\nshow how and to what extent these strategies fit within established deceptive\npattern categories. We identify two main design strategies that are implemented\nto impose AI use in both personal and professional contexts: imposing AI\nfeatures in interfaces at the expense of existing non-AI features and promoting\nnarratives about AI that make it harder to resist using it. We discuss\nopportunities for regulating the imposed adoption of AI features, which would\ninevitably lead to negative environmental effects."}
{"id": "2508.08273", "pdf": "https://arxiv.org/pdf/2508.08273.pdf", "abs": "https://arxiv.org/abs/2508.08273", "title": "TT-XAI: Trustworthy Clinical Text Explanations via Keyword Distillation and LLM Reasoning", "authors": ["Kristian Miok", "Blaz Škrlj", "Daniela Zaharie", "Marko Robnik Šikonja"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Clinical language models often struggle to provide trustworthy predictions\nand explanations when applied to lengthy, unstructured electronic health\nrecords (EHRs). This work introduces TT-XAI, a lightweight and effective\nframework that improves both classification performance and interpretability\nthrough domain-aware keyword distillation and reasoning with large language\nmodels (LLMs). First, we demonstrate that distilling raw discharge notes into\nconcise keyword representations significantly enhances BERT classifier\nperformance and improves local explanation fidelity via a focused variant of\nLIME. Second, we generate chain-of-thought clinical explanations using\nkeyword-guided prompts to steer LLMs, producing more concise and clinically\nrelevant reasoning. We evaluate explanation quality using deletion-based\nfidelity metrics, self-assessment via LLaMA-3 scoring, and a blinded human\nstudy with domain experts. All evaluation modalities consistently favor the\nkeyword-augmented method, confirming that distillation enhances both machine\nand human interpretability. TT-XAI offers a scalable pathway toward\ntrustworthy, auditable AI in clinical decision support."}
{"id": "2508.08731", "pdf": "https://arxiv.org/pdf/2508.08731.pdf", "abs": "https://arxiv.org/abs/2508.08731", "title": "Caption: Generating Informative Content Labels for Image Buttons Using Next-Screen Context", "authors": ["Mingyuan Zhong", "Ajit Mallavarapu", "Qing Nie"], "categories": ["cs.HC"], "comment": null, "summary": "We present Caption, an LLM-powered content label generation tool for visual\ninteractive elements on mobile devices. Content labels are essential for screen\nreaders to provide announcements for image-based elements, but are often\nmissing or uninformative due to developer neglect. Automated captioning systems\nattempt to address this, but are limited to on-screen context, often resulting\nin inaccurate or unspecific labels. To generate more accurate and descriptive\nlabels, Caption collects next-screen context on interactive elements by\nnavigating to the destination screen that appears after an interaction and\nincorporating information from both the origin and destination screens.\nPreliminary results show Caption generates more accurate labels than both human\nannotators and an LLM baseline. We expect Caption to empower developers by\nproviding actionable accessibility suggestions and directly support on-demand\nrepairs by screen reader users."}
{"id": "2508.08274", "pdf": "https://arxiv.org/pdf/2508.08274.pdf", "abs": "https://arxiv.org/abs/2508.08274", "title": "Distilling Knowledge from Large Language Models: A Concept Bottleneck Model for Hate and Counter Speech Recognition", "authors": ["Roberto Labadie-Tamayo", "Djordje Slijepčević", "Xihui Chen", "Adrian Jaques Böck", "Andreas Babic", "Liz Freimann", "Christiane Atzmüller Matthias Zeppelzauer"], "categories": ["cs.CL", "cs.AI", "cs.LG", "I.2.7"], "comment": "33 pages, 10 figures, This is a preprint of a manuscript accepted for\n  publication in Information Processing & Management (Elsevier)", "summary": "The rapid increase in hate speech on social media has exposed an\nunprecedented impact on society, making automated methods for detecting such\ncontent important. Unlike prior black-box models, we propose a novel\ntransparent method for automated hate and counter speech recognition, i.e.,\n\"Speech Concept Bottleneck Model\" (SCBM), using adjectives as\nhuman-interpretable bottleneck concepts. SCBM leverages large language models\n(LLMs) to map input texts to an abstract adjective-based representation, which\nis then sent to a light-weight classifier for downstream tasks. Across five\nbenchmark datasets spanning multiple languages and platforms (e.g., Twitter,\nReddit, YouTube), SCBM achieves an average macro-F1 score of 0.69 which\noutperforms the most recently reported results from the literature on four out\nof five datasets. Aside from high recognition accuracy, SCBM provides a high\nlevel of both local and global interpretability. Furthermore, fusing our\nadjective-based concept representation with transformer embeddings, leads to a\n1.8% performance increase on average across all datasets, showing that the\nproposed representation captures complementary information. Our results\ndemonstrate that adjective-based concept representations can serve as compact,\ninterpretable, and effective encodings for hate and counter speech recognition.\nWith adapted adjectives, our method can also be applied to other NLP tasks."}
{"id": "2508.08737", "pdf": "https://arxiv.org/pdf/2508.08737.pdf", "abs": "https://arxiv.org/abs/2508.08737", "title": "From Data to Insight: Using Contextual Scenarios to Teach Critical Thinking in Data Visualisation", "authors": ["Jonathan C. Roberts", "Peter Butcher", "Panagiotis D. Ritsos"], "categories": ["cs.HC", "H.5.2; K.3.2; I.3.6"], "comment": "6 pages, 5 figures, IEEE VIS Workshop on Visualization Education,\n  Literacy, and Activities 2025, Vienna", "summary": "This paper explores the use of scenario-based visualisation examples as a\npedagogical strategy for teaching students the complexities of data insight,\nrepresentation, and interpretation. Teaching data visualisation often involves\nexplaining intricate issues related to data management and the challenges of\npresenting data meaningfully. In this work, we present a series of data-driven\nscenarios. These concise stories depict specific situations, and are created to\nhelp the educators highlight key concerns in data communication, such as chart\nselection, temporal versus categorical comparison, visual bias, and narrative\nframing. By grounding these examples in real-world contexts, students are\nencouraged to critically assess not only what the data shows, but how and why\nit is shown that way. The paper presents a collection of example scenarios,\nthat educators can use for their own lessons; the work fits with a larger\nproject on looking at critical thinking in the classroom, and developing\nappropriate tools. We also start to abstract principles, from our approach, so\nthat others can develop their own scenarios for their teaching. Our approach\naligns with principles of authentic and scenario-based learning, using\nreal-world contexts to foster critical engagement with data."}
{"id": "2508.08275", "pdf": "https://arxiv.org/pdf/2508.08275.pdf", "abs": "https://arxiv.org/abs/2508.08275", "title": "MLLM-CBench:A Comprehensive Benchmark for Continual Instruction Tuning of Multimodal LLMs with Chain-of-Thought Reasoning Analysis", "authors": ["Haiyun Guo", "ZhiYan Hou", "Yu Chen", "Jinghan He", "Yandu Sun", "Yuzhe Zhou", "Shujing Guo", "Kuan Zhu", "Jinqiao Wang"], "categories": ["cs.CL", "cs.AI"], "comment": "under review", "summary": "Multimodal Large Language Models (MLLMs) rely on continual instruction tuning\nto adapt to the evolving demands of real-world applications. However, progress\nin this area is hindered by the lack of rigorous and systematic benchmarks. To\naddress this gap, we present MLLM-CTBench, a comprehensive evaluation benchmark\nwith three key contributions: (1) Multidimensional Evaluation: We combine final\nanswer accuracy with fine-grained CoT reasoning quality assessment, enabled by\na specially trained CoT evaluator; (2) Comprehensive Evaluation of Algorithms\nand Training Paradigms: We benchmark eight continual learning algorithms across\nfour major categories and systematically compare reinforcement learning with\nsupervised fine-tuning paradigms; (3) Carefully Curated Tasks: We select and\norganize 16 datasets from existing work, covering six challenging domains. Our\nkey findings include: (i) Models with stronger general capabilities exhibit\ngreater robustness to forgetting during continual learning; (ii) Reasoning\nchains degrade more slowly than final answers, supporting the hierarchical\nforgetting hypothesis; (iii) The effectiveness of continual learning algorithms\nis highly dependent on both model capability and task order; (iv) In\nreinforcement learning settings, incorporating KL-divergence constraints helps\nmaintain policy stability and plays a crucial role in mitigating forgetting.\nMLLM-CTBench establishes a rigorous standard for continual instruction tuning\nof MLLMs and offers practical guidance for algorithm design and evaluation."}
{"id": "2508.08958", "pdf": "https://arxiv.org/pdf/2508.08958.pdf", "abs": "https://arxiv.org/abs/2508.08958", "title": "Addressing the Heterogeneity of Visualization in an Introductory PhD Course in the Swedish Context", "authors": ["Kostiantyn Kucher", "Niklas Rönnberg", "Jonas Löwgren"], "categories": ["cs.HC", "K.3.2; H.5; I.3"], "comment": "8 pages, 3 figures", "summary": "Visualization is a heterogeneous field, and this aspect is often reflected by\nthe organizational structures at higher education institutions that academic\nresearchers in visualization and related fields including computer graphics,\nhuman-computer interaction, and media design are typically affiliated with. It\nmay thus be a challenge for new PhD students to grasp the fragmented structure\nof their new workplace, form collegial relations across the institution, and to\nbuild a coherent picture of the discipline as a whole. We report an attempt to\naddress this challenge, in the form of an introductory course on the subject of\nVisualization Technology and Methodology for PhD students at the Division for\nMedia and Information Technology, Link\\\"oping University, Sweden. We discuss\nthe course design, including interactions with other doctoral education\nactivities and field trips to multiple research groups and units within the\ndivision (ranging from scientific visualization and computer graphics to media\ndesign and visual communication). Lessons learned from the course preparation\nwork as well as the first instance of the course offered during autumn term\n2023 can be helpful to researchers and educators aiming to establish or improve\nsimilar doctoral courses."}
{"id": "2508.08276", "pdf": "https://arxiv.org/pdf/2508.08276.pdf", "abs": "https://arxiv.org/abs/2508.08276", "title": "Evaluating Contrast Localizer for Identifying Causal Unitsin Social & Mathematical Tasks in Language Models", "authors": ["Yassine Jamaa", "Badr AlKhamissi", "Satrajit Ghosh", "Martin Schrimpf"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "This work adapts a neuroscientific contrast localizer to pinpoint causally\nrelevant units for Theory of Mind (ToM) and mathematical reasoning tasks in\nlarge language models (LLMs) and vision-language models (VLMs). Across 11 LLMs\nand 5 VLMs ranging in size from 3B to 90B parameters, we localize top-activated\nunits using contrastive stimulus sets and assess their causal role via targeted\nablations. We compare the effect of lesioning functionally selected units\nagainst low-activation and randomly selected units on downstream accuracy\nacross established ToM and mathematical benchmarks. Contrary to expectations,\nlow-activation units sometimes produced larger performance drops than the\nhighly activated ones, and units derived from the mathematical localizer often\nimpaired ToM performance more than those from the ToM localizer. These findings\ncall into question the causal relevance of contrast-based localizers and\nhighlight the need for broader stimulus sets and more accurately capture\ntask-specific units."}
{"id": "2508.09028", "pdf": "https://arxiv.org/pdf/2508.09028.pdf", "abs": "https://arxiv.org/abs/2508.09028", "title": "Envisioning Generative Artificial Intelligence in Cartography and Mapmaking", "authors": ["Yuhao Kang", "Chenglong Wang"], "categories": ["cs.HC"], "comment": "9 pages, 6 figures", "summary": "Generative artificial intelligence (GenAI), including large language models,\ndiffusion-based image generation models, and GenAI agents, has provided new\nopportunities for advancements in mapping and cartography. Due to their\ncharacteristics including world knowledge and generalizability, artistic style\nand creativity, and multimodal integration, we envision that GenAI may benefit\na variety of cartographic design decisions, from mapmaking (e.g.,\nconceptualization, data preparation, map design, and map evaluation) to map use\n(such as map reading, interpretation, and analysis). This paper discusses\nseveral important topics regarding why and how GenAI benefits cartography with\ncase studies including symbolization, map evaluation, and map reading. Despite\nits unprecedented potential, we identify key scenarios where GenAI may not be\nsuitable, such as tasks that require a deep understanding of cartographic\nknowledge or prioritize precision and reliability. We also emphasize the need\nto consider ethical and social implications, such as concerns related to\nhallucination, reproducibility, bias, copyright, and explainability. This work\nlays the foundation for further exploration and provides a roadmap for future\nresearch at the intersection of GenAI and cartography."}
{"id": "2508.08277", "pdf": "https://arxiv.org/pdf/2508.08277.pdf", "abs": "https://arxiv.org/abs/2508.08277", "title": "Objective Metrics for Evaluating Large Language Models Using External Data Sources", "authors": ["Haoze Du", "Richard Li", "Edward Gehringer"], "categories": ["cs.CL", "cs.LG"], "comment": "This version of the paper is lightly revised from the EDM 2025\n  proceedings for the sake of clarity", "summary": "Evaluating the performance of Large Language Models (LLMs) is a critical yet\nchallenging task, particularly when aiming to avoid subjective assessments.\nThis paper proposes a framework for leveraging subjective metrics derived from\nthe class textual materials across different semesters to assess LLM outputs\nacross various tasks. By utilizing well-defined benchmarks, factual datasets,\nand structured evaluation pipelines, the approach ensures consistent,\nreproducible, and bias-minimized measurements. The framework emphasizes\nautomation and transparency in scoring, reducing reliance on human\ninterpretation while ensuring alignment with real-world applications. This\nmethod addresses the limitations of subjective evaluation methods, providing a\nscalable solution for performance assessment in educational, scientific, and\nother high-stakes domains."}
{"id": "2508.09033", "pdf": "https://arxiv.org/pdf/2508.09033.pdf", "abs": "https://arxiv.org/abs/2508.09033", "title": "Beyond Predictions: A Study of AI Strength and Weakness Transparency Communication on Human-AI Collaboration", "authors": ["Tina Behzad", "Nikolos Gurney", "Ning Wang", "David V. Pynadath"], "categories": ["cs.HC"], "comment": "Accepted as LBW, HCII 2025", "summary": "The promise of human-AI teaming lies in humans and AI working together to\nachieve performance levels neither could accomplish alone. Effective\ncommunication between AI and humans is crucial for teamwork, enabling users to\nefficiently benefit from AI assistance. This paper investigates how AI\ncommunication impacts human-AI team performance. We examine AI explanations\nthat convey an awareness of its strengths and limitations. To achieve this, we\ntrain a decision tree on the model's mistakes, allowing it to recognize and\nexplain where and why it might err. Through a user study on an income\nprediction task, we assess the impact of varying levels of information and\nexplanations about AI predictions. Our results show that AI performance\ninsights enhance task performance, and conveying AI awareness of its strengths\nand weaknesses improves trust calibration. These findings highlight the\nimportance of considering how information delivery influences user trust and\nreliance in AI-assisted decision-making."}
{"id": "2508.08283", "pdf": "https://arxiv.org/pdf/2508.08283.pdf", "abs": "https://arxiv.org/abs/2508.08283", "title": "MinionsLLM: a Task-adaptive Framework For The Training and Control of Multi-Agent Systems Through Natural Language", "authors": ["Andres Garcia Rincon", "Eliseo Ferrante"], "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.MA", "cs.RO"], "comment": null, "summary": "This paper presents MinionsLLM, a novel framework that integrates Large\nLanguage Models (LLMs) with Behavior Trees (BTs) and Formal Grammars to enable\nnatural language control of multi-agent systems within arbitrary, user-defined\nenvironments. MinionsLLM provides standardized interfaces for defining\nenvironments, agents, and behavioral primitives, and introduces two synthetic\ndataset generation methods (Method A and Method B) to fine-tune LLMs for\nimproved syntactic validity and semantic task relevance. We validate our\napproach using Google's Gemma 3 model family at three parameter scales (1B, 4B,\nand 12B) and demonstrate substantial gains: Method B increases syntactic\nvalidity to 92.6% and achieves a mean task performance improvement of 33% over\nbaseline. Notably, our experiments show that smaller models benefit most from\nfine-tuning, suggesting promising directions for deploying compact, locally\nhosted LLMs in resource-constrained multi-agent control scenarios. The\nframework and all resources are released open-source to support reproducibility\nand future research."}
{"id": "2508.09043", "pdf": "https://arxiv.org/pdf/2508.09043.pdf", "abs": "https://arxiv.org/abs/2508.09043", "title": "Where are GIScience Faculty Hired from? Analyzing Faculty Mobility and Research Themes Through Hiring Networks", "authors": ["Yanbing Chen", "Jonathan Nelson", "Bing Zhou", "Ryan Zhenqi Zhou", "Shan Ye", "Haokun Liu", "Zhining Gu", "Armita Kar", "Hoeyun Kwon", "Pengyu Chen", "Maoran Sun", "Yuhao Kang"], "categories": ["cs.HC", "cs.CY", "cs.SI"], "comment": "54 pages, 12 figures", "summary": "Academia is profoundly influenced by faculty hiring networks, which serve as\ncritical conduits for knowledge dissemination and the formation of\ncollaborative research initiatives. While extensive research in various\ndisciplines has revealed the institutional hierarchies inherent in these\nnetworks, their impacts within GIScience remain underexplored. To fill this\ngap, this study analyzes the placement patterns of 946 GIScience faculty\nworldwide by mapping the connections between PhD-granting institutions and\ncurrent faculty affiliations. Our dataset, which is compiled from\nvolunteer-contributed information, is the most comprehensive collection\navailable in this field. While there may be some limitations in its\nrepresentativeness, its scope and depth provide a unique and valuable\nperspective on the global placement patterns of GIScience faculty. Our analysis\nreveals several influential programs in placing GIScience faculty, with hiring\nconcentrated in the western countries. We examined the diversity index to\nassess the representation of regions and institutions within the global\nGIScience faculty network. We observe significant internal retention at both\nthe continental and country levels, and a high level of non-self-hired ratio at\nthe institutional level. Over time, research themes have also evolved, with\ngrowing research clusters emphasis on spatial data analytics, cartography and\ngeovisualization, geocomputation, and environmental sciences, etc. These\nresults illuminate the influence of hiring practices on global knowledge\ndissemination and contribute to promoting academic equity within GIScience and\nGeography."}
{"id": "2508.08285", "pdf": "https://arxiv.org/pdf/2508.08285.pdf", "abs": "https://arxiv.org/abs/2508.08285", "title": "The Illusion of Progress: Re-evaluating Hallucination Detection in LLMs", "authors": ["Denis Janiak", "Jakub Binkowski", "Albert Sawczyn", "Bogdan Gabrys", "Ravid Schwartz-Ziv", "Tomasz Kajdanowicz"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Preprint, under review", "summary": "Large language models (LLMs) have revolutionized natural language processing,\nyet their tendency to hallucinate poses serious challenges for reliable\ndeployment. Despite numerous hallucination detection methods, their evaluations\noften rely on ROUGE, a metric based on lexical overlap that misaligns with\nhuman judgments. Through comprehensive human studies, we demonstrate that while\nROUGE exhibits high recall, its extremely low precision leads to misleading\nperformance estimates. In fact, several established detection methods show\nperformance drops of up to 45.9\\% when assessed using human-aligned metrics\nlike LLM-as-Judge. Moreover, our analysis reveals that simple heuristics based\non response length can rival complex detection techniques, exposing a\nfundamental flaw in current evaluation practices. We argue that adopting\nsemantically aware and robust evaluation frameworks is essential to accurately\ngauge the true performance of hallucination detection methods, ultimately\nensuring the trustworthiness of LLM outputs."}
{"id": "2508.08268", "pdf": "https://arxiv.org/pdf/2508.08268.pdf", "abs": "https://arxiv.org/abs/2508.08268", "title": "Evaluating Imputation Techniques for Short-Term Gaps in Heart Rate Data", "authors": ["Vaibhav Gupta", "Maria Maleshkova"], "categories": ["stat.AP", "cs.HC", "cs.LG"], "comment": null, "summary": "Recent advances in wearable technology have enabled the continuous monitoring\nof vital physiological signals, essential for predictive modeling and early\ndetection of extreme physiological events. Among these physiological signals,\nheart rate (HR) plays a central role, as it is widely used in monitoring and\nmanaging cardiovascular conditions and detecting extreme physiological events\nsuch as hypoglycemia. However, data from wearable devices often suffer from\nmissing values. To address this issue, recent studies have employed various\nimputation techniques. Traditionally, the effectiveness of these methods has\nbeen evaluated using predictive accuracy metrics such as RMSE, MAPE, and MAE,\nwhich assess numerical proximity to the original data. While informative, these\nmetrics fail to capture the complex statistical structure inherent in\nphysiological signals. This study bridges this gap by presenting a\ncomprehensive evaluation of four statistical imputation methods, linear\ninterpolation, K Nearest Neighbors (KNN), Piecewise Cubic Hermite Interpolating\nPolynomial (PCHIP), and B splines, for short term HR data gaps. We assess their\nperformance using both predictive accuracy metrics and statistical distance\nmeasures, including the Cohen Distance Test (CDT) and Jensen Shannon Distance\n(JS Distance), applied to HR data from the D1NAMO dataset and the BIG IDEAs Lab\nGlycemic Variability and Wearable Device dataset. The analysis reveals\nlimitations in existing imputation approaches and the absence of a robust\nframework for evaluating imputation quality in physiological signals. Finally,\nthis study proposes a foundational framework to develop a composite evaluation\nmetric to assess imputation performance."}
{"id": "2508.08287", "pdf": "https://arxiv.org/pdf/2508.08287.pdf", "abs": "https://arxiv.org/abs/2508.08287", "title": "Sacred or Synthetic? Evaluating LLM Reliability and Abstention for Religious Questions", "authors": ["Farah Atif", "Nursultan Askarbekuly", "Kareem Darwish", "Monojit Choudhury"], "categories": ["cs.CL", "cs.AI", "cs.CY"], "comment": "8th AAAI/ACM Conference on AI, Ethics, and Society (AIES 2025)", "summary": "Despite the increasing usage of Large Language Models (LLMs) in answering\nquestions in a variety of domains, their reliability and accuracy remain\nunexamined for a plethora of domains including the religious domains. In this\npaper, we introduce a novel benchmark FiqhQA focused on the LLM generated\nIslamic rulings explicitly categorized by the four major Sunni schools of\nthought, in both Arabic and English. Unlike prior work, which either overlooks\nthe distinctions between religious school of thought or fails to evaluate\nabstention behavior, we assess LLMs not only on their accuracy but also on\ntheir ability to recognize when not to answer. Our zero-shot and abstention\nexperiments reveal significant variation across LLMs, languages, and legal\nschools of thought. While GPT-4o outperforms all other models in accuracy,\nGemini and Fanar demonstrate superior abstention behavior critical for\nminimizing confident incorrect answers. Notably, all models exhibit a\nperformance drop in Arabic, highlighting the limitations in religious reasoning\nfor languages other than English. To the best of our knowledge, this is the\nfirst study to benchmark the efficacy of LLMs for fine-grained Islamic school\nof thought specific ruling generation and to evaluate abstention for Islamic\njurisprudence queries. Our findings underscore the need for task-specific\nevaluation and cautious deployment of LLMs in religious applications."}
{"id": "2508.08271", "pdf": "https://arxiv.org/pdf/2508.08271.pdf", "abs": "https://arxiv.org/abs/2508.08271", "title": "Heartificial Intelligence: Exploring Empathy in Language Models", "authors": ["Victoria Williams", "Benjamin Rosman"], "categories": ["cs.CL", "cs.HC"], "comment": "21 pages, 5 tables", "summary": "Large language models have become increasingly common, used by millions of\npeople worldwide in both professional and personal contexts. As these models\ncontinue to advance, they are frequently serving as virtual assistants and\ncompanions. In human interactions, effective communication typically involves\ntwo types of empathy: cognitive empathy (understanding others' thoughts and\nemotions) and affective empathy (emotionally sharing others' feelings). In this\nstudy, we investigated both cognitive and affective empathy across several\nsmall (SLMs) and large (LLMs) language models using standardized psychological\ntests. Our results revealed that LLMs consistently outperformed humans -\nincluding psychology students - on cognitive empathy tasks. However, despite\ntheir cognitive strengths, both small and large language models showed\nsignificantly lower affective empathy compared to human participants. These\nfindings highlight rapid advancements in language models' ability to simulate\ncognitive empathy, suggesting strong potential for providing effective virtual\ncompanionship and personalized emotional support. Additionally, their high\ncognitive yet lower affective empathy allows objective and consistent emotional\nsupport without running the risk of emotional fatigue or bias."}
{"id": "2508.08292", "pdf": "https://arxiv.org/pdf/2508.08292.pdf", "abs": "https://arxiv.org/abs/2508.08292", "title": "Putnam-AXIOM: A Functional and Static Benchmark", "authors": ["Aryan Gulati", "Brando Miranda", "Eric Chen", "Emily Xia", "Kai Fronsdal", "Bruno Dumont", "Elyas Obbad", "Sanmi Koyejo"], "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.LO", "cs.NE", "68T20, 68T05, 68Q32", "F.2.2; I.2.3; I.2.6; I.2.8"], "comment": "27 pages total (10-page main paper + 17-page appendix), 12 figures, 6\n  tables. Submitted to ICML 2025 (under review)", "summary": "Current mathematical reasoning benchmarks for large language models (LLMs)\nare approaching saturation, with some achieving > 90% accuracy, and are\nincreasingly compromised by training-set contamination. We introduce\nPutnam-AXIOM, a benchmark of 522 university-level competition problems drawn\nfrom the prestigious William Lowell Putnam Mathematical Competition, and\nPutnam-AXIOM Variation, an unseen companion set of 100 functional variants\ngenerated by programmatically perturbing variables and constants. The variation\nprotocol produces an unlimited stream of equally difficult, unseen instances --\nyielding a contamination-resilient test bed. On the Original set, OpenAI's\no1-preview -- the strongest evaluated model -- scores 41.9%, but its accuracy\ndrops by 19.6% (46.8% relative decrease) on the paired Variations. The\nremaining eighteen models show the same downward trend, ten of them with\nnon-overlapping 95% confidence intervals. These gaps suggest memorization and\nhighlight the necessity of dynamic benchmarks. We complement \"boxed\" accuracy\nwith Teacher-Forced Accuracy (TFA), a lightweight metric that directly scores\nreasoning traces and automates natural language proof evaluations. Putnam-AXIOM\ntherefore provides a rigorous, contamination-resilient evaluation framework for\nassessing advanced mathematical reasoning of LLMs. Data and evaluation code are\npublicly available at https://github.com/brando90/putnam-axiom."}
{"id": "2508.08282", "pdf": "https://arxiv.org/pdf/2508.08282.pdf", "abs": "https://arxiv.org/abs/2508.08282", "title": "Financial and symbolic incentives promote 'green' charging choices", "authors": ["Celina Kacperski", "Florian Kutzner"], "categories": ["physics.soc-ph", "cs.CY", "cs.HC"], "comment": "behavior steering techniques, sustainable behavior, e-mobility,\n  incentives", "summary": "Electromobility can contribute to a reduction in greenhouse gas emissions if\nusage behavior is aligned with the increasing availability of renewable energy.\nTo achieve this, smart navigation systems can be used to inform drivers of\noptimal charging times and locations. Yet, required flexibility may impart time\npenalties. We investigate the impact of financial and symbolic incentive\nschemes to counteract these additional costs. In a laboratory experiment with\nreal-life time costs, we find that monetary and symbolic incentives are both\neffective in changing behavior towards 'greener' charging choices, while we\nfind no significant statistical difference between them."}
{"id": "2508.08386", "pdf": "https://arxiv.org/pdf/2508.08386.pdf", "abs": "https://arxiv.org/abs/2508.08386", "title": "CoDAE: Adapting Large Language Models for Education via Chain-of-Thought Data Augmentation", "authors": ["Shuzhou Yuan", "William LaCroix", "Hardik Ghoshal", "Ercong Nie", "Michael Färber"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) are increasingly employed as AI tutors due to\ntheir scalability and potential for personalized instruction. However,\noff-the-shelf LLMs often underperform in educational settings: they frequently\nreveal answers too readily, fail to adapt their responses to student\nuncertainty, and remain vulnerable to emotionally manipulative prompts. To\naddress these challenges, we introduce CoDAE, a framework that adapts LLMs for\neducational use through Chain-of-Thought (CoT) data augmentation. We collect\nreal-world dialogues between students and a ChatGPT-based tutor and enrich them\nusing CoT prompting to promote step-by-step reasoning and pedagogically aligned\nguidance. Furthermore, we design targeted dialogue cases to explicitly mitigate\nthree key limitations: over-compliance, low response adaptivity, and threat\nvulnerability. We fine-tune four open-source LLMs on different variants of the\naugmented datasets and evaluate them in simulated educational scenarios using\nboth automatic metrics and LLM-as-a-judge assessments. Our results show that\nmodels fine-tuned with CoDAE deliver more pedagogically appropriate guidance,\nbetter support reasoning processes, and effectively resist premature answer\ndisclosure."}
{"id": "2508.08313", "pdf": "https://arxiv.org/pdf/2508.08313.pdf", "abs": "https://arxiv.org/abs/2508.08313", "title": "Resisting AI Solutionism through Workplace Collective Action", "authors": ["Kevin Zheng", "Linda Huber", "Aaron Stark", "Nathan Kim", "Francesca Lameiro", "Wells Lucas Santo", "Shreya Chowdhary", "Eugene Kim", "Justine Zhang"], "categories": ["cs.CY", "cs.HC", "K.4.3; K.4.2; I.2.0"], "comment": "Presented at \"Resisting AI Solutionism: Where Do We Go From Here?\"\n  workshop at CHI '25", "summary": "In the face of increasing austerity and threats of AI-enabled labor\nreplacement at the University of Michigan, a group of workers and students have\ncoalesced around the project of \"AI resistance\" since Fall 2024. Forming a\ncross-departmental coalition including librarians, faculty, staff, graduate\nworkers, and undergraduate students, we have hosted a public workshop\nquestioning the techno-deterministic inevitability of AI use at the University\nand are working with other campus organizations to maintain an ongoing\norganizing space. This workshop submission incorporates our reflections thus\nfar on the strategies we've employed, the challenges to collective resistance,\nand our role as workers in resisting AI within the University. Our aim for this\nwork is to provide concrete inspiration for technologists, students, and staff\nlooking to resist AI techno-solutionism within their own universities."}
{"id": "2508.08401", "pdf": "https://arxiv.org/pdf/2508.08401.pdf", "abs": "https://arxiv.org/abs/2508.08401", "title": "Mol-R1: Towards Explicit Long-CoT Reasoning in Molecule Discovery", "authors": ["Jiatong Li", "Weida Wang", "Qinggang Zhang", "Junxian Li", "Di Zhang", "Changmeng Zheng", "Shufei Zhang", "Xiaoyong Wei", "Qing Li"], "categories": ["cs.CL"], "comment": "20 pages", "summary": "Large language models (LLMs), especially Explicit Long Chain-of-Thought (CoT)\nreasoning models like DeepSeek-R1 and QWQ, have demonstrated powerful reasoning\ncapabilities, achieving impressive performance in commonsense reasoning and\nmathematical inference. Despite their effectiveness, Long-CoT reasoning models\nare often criticized for their limited ability and low efficiency in\nknowledge-intensive domains such as molecule discovery. Success in this field\nrequires a precise understanding of domain knowledge, including molecular\nstructures and chemical principles, which is challenging due to the inherent\ncomplexity of molecular data and the scarcity of high-quality expert\nannotations. To bridge this gap, we introduce Mol-R1, a novel framework\ndesigned to improve explainability and reasoning performance of R1-like\nExplicit Long-CoT reasoning LLMs in text-based molecule generation. Our\napproach begins with a high-quality reasoning dataset curated through Prior\nRegulation via In-context Distillation (PRID), a dedicated distillation\nstrategy to effectively generate paired reasoning traces guided by prior\nregulations. Building upon this, we introduce MoIA, Molecular Iterative\nAdaptation, a sophisticated training strategy that iteratively combines\nSupervised Fine-tuning (SFT) with Reinforced Policy Optimization (RPO),\ntailored to boost the reasoning performance of R1-like reasoning models for\nmolecule discovery. Finally, we examine the performance of Mol-R1 in the\ntext-based molecule reasoning generation task, showing superior performance\nagainst existing baselines."}
{"id": "2508.08507", "pdf": "https://arxiv.org/pdf/2508.08507.pdf", "abs": "https://arxiv.org/abs/2508.08507", "title": "AZRA: Extending the Affective Capabilities of Zoomorphic Robots using Augmented Reality", "authors": ["Shaun Macdonald", "Salma ElSayed", "Mark McGill"], "categories": ["cs.RO", "cs.HC"], "comment": "Companion of the 2025 ACM/IEEE International Conference on\n  Human-Robot Interaction (RO-MAN 2025)", "summary": "Zoomorphic robots could serve as accessible and practical alternatives for\nusers unable or unwilling to keep pets. However, their affective interactions\nare often simplistic and short-lived, limiting their potential for domestic\nadoption. In order to facilitate more dynamic and nuanced affective\ninteractions and relationships between users and zoomorphic robots we present\nAZRA, a novel augmented reality (AR) framework that extends the affective\ncapabilities of these robots without physical modifications. To demonstrate\nAZRA, we augment a zoomorphic robot, Petit Qoobo, with novel emotional displays\n(face, light, sound, thought bubbles) and interaction modalities (voice, touch,\nproximity, gaze). Additionally, AZRA features a computational model of emotion\nto calculate the robot's emotional responses, daily moods, evolving personality\nand needs. We highlight how AZRA can be used for rapid participatory\nprototyping and enhancing existing robots, then discuss implications on future\nzoomorphic robot development."}
{"id": "2508.08424", "pdf": "https://arxiv.org/pdf/2508.08424.pdf", "abs": "https://arxiv.org/abs/2508.08424", "title": "Rethinking Tokenization for Rich Morphology: The Dominance of Unigram over BPE and Morphological Alignment", "authors": ["Saketh Reddy Vemula", "Dipti Mishra Sharma", "Parameswari Krishnamurthy"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Prior work on language modeling showed conflicting findings about whether\nmorphologically aligned approaches to tokenization improve performance,\nparticularly for languages with complex morphology. To investigate this, we\nselect a typologically diverse set of languages: Telugu (agglutinative), Hindi\n(primarily fusional with some agglutination), and English (fusional). We\nconduct a comprehensive evaluation of language models -- starting from\ntokenizer training and extending through the finetuning and downstream task\nevaluation. To account for the consistent performance differences observed\nacross tokenizer variants, we focus on two key factors: morphological alignment\nand tokenization quality. To assess morphological alignment of tokenizers in\nTelugu, we create a dataset containing gold morpheme segmentations of 600\nderivational and 7000 inflectional word forms.\n  Our experiments reveal that better morphological alignment correlates\npositively -- though moderately -- with performance in syntax-based tasks such\nas Parts-of-Speech tagging, Named Entity Recognition and Dependency Parsing.\nHowever, we also find that the tokenizer algorithm (Byte-pair Encoding vs.\nUnigram) plays a more significant role in influencing downstream performance\nthan morphological alignment alone. Naive Unigram tokenizers outperform others\nacross most settings, though hybrid tokenizers that incorporate morphological\nsegmentation significantly improve performance within the BPE framework. In\ncontrast, intrinsic metrics like Corpus Token Count (CTC) and R\\'enyi entropy\nshowed no correlation with downstream performance."}
{"id": "2508.08590", "pdf": "https://arxiv.org/pdf/2508.08590.pdf", "abs": "https://arxiv.org/abs/2508.08590", "title": "QueryCraft: Transformer-Guided Query Initialization for Enhanced Human-Object Interaction Detection", "authors": ["Yuxiao Wang", "Wolin Liang", "Yu Lei", "Weiying Xue", "Nan Zhuang", "Qi Liu"], "categories": ["cs.CV", "cs.HC"], "comment": null, "summary": "Human-Object Interaction (HOI) detection aims to localize human-object pairs\nand recognize their interactions in images. Although DETR-based methods have\nrecently emerged as the mainstream framework for HOI detection, they still\nsuffer from a key limitation: Randomly initialized queries lack explicit\nsemantics, leading to suboptimal detection performance. To address this\nchallenge, we propose QueryCraft, a novel plug-and-play HOI detection framework\nthat incorporates semantic priors and guided feature learning through\ntransformer-based query initialization. Central to our approach is\n\\textbf{ACTOR} (\\textbf{A}ction-aware \\textbf{C}ross-modal\n\\textbf{T}ransf\\textbf{OR}mer), a cross-modal Transformer encoder that jointly\nattends to visual regions and textual prompts to extract action-relevant\nfeatures. Rather than merely aligning modalities, ACTOR leverages\nlanguage-guided attention to infer interaction semantics and produce\nsemantically meaningful query representations. To further enhance object-level\nquery quality, we introduce a \\textbf{P}erceptual \\textbf{D}istilled\n\\textbf{Q}uery \\textbf{D}ecoder (\\textbf{PDQD}), which distills object category\nawareness from a pre-trained detector to serve as object query initiation. This\ndual-branch query initialization enables the model to generate more\ninterpretable and effective queries for HOI detection. Extensive experiments on\nHICO-Det and V-COCO benchmarks demonstrate that our method achieves\nstate-of-the-art performance and strong generalization. Code will be released\nupon publication."}
{"id": "2508.08466", "pdf": "https://arxiv.org/pdf/2508.08466.pdf", "abs": "https://arxiv.org/abs/2508.08466", "title": "Enhancing Small LLM Alignment through Margin-Based Objective Modifications under Resource Constraints", "authors": ["Daren Yao", "Jinsong Yuan", "Ruike Chen"], "categories": ["cs.CL"], "comment": "10 pages, 3 figures", "summary": "Small large language models (LLMs) often face difficulties in aligning output\nto human preferences, particularly when operating under severe performance\ngaps. In this work, we propose two lightweight DPO-based variants -- Adaptive\nMargin-Sigmoid Loss and APO-hinge-zero -- to better address underperformance\nscenarios by introducing margin-based objectives and selective update\nmechanisms.\n  Our APO-hinge-zero method, which combines hinge-induced hard-example mining\nwith the chosen-focused optimization of APO-zero, achieves strong results. In\nAlpacaEval, APO-hinge-zero improves the win rate by +2.0 points and the\nlength-controlled win rate by +1.4 points compared to the APO-zero baseline. In\nMT-Bench, our methods maintain competitive performance in diverse categories,\nparticularly excelling in STEM and Humanities tasks.\n  These results demonstrate that simple modifications to preference-based\nobjectives can significantly enhance small LLM alignment under resource\nconstraints, offering a practical path toward more efficient deployment."}
{"id": "2508.08596", "pdf": "https://arxiv.org/pdf/2508.08596.pdf", "abs": "https://arxiv.org/abs/2508.08596", "title": "How Conversational Structure and Style Shape Online Community Experiences", "authors": ["Galen Weld", "Carl Pearson", "Bradley Spahn", "Tim Althoff", "Amy X. Zhang", "Sanjay Kairam"], "categories": ["cs.SI", "cs.HC"], "comment": "to appear at ICWSM 2026", "summary": "Sense of Community (SOC) is vital to individual and collective well-being.\nAlthough social interactions have moved increasingly online, still little is\nknown about the specific relationships between the nature of these interactions\nand Sense of Virtual Community (SOVC). This study addresses this gap by\nexploring how conversational structure and linguistic style predict SOVC in\nonline communities, using a large-scale survey of 2,826 Reddit users across 281\nvaried subreddits. We develop a hierarchical model to predict self-reported\nSOVC based on automatically quantifiable and highly generalizable features that\nare agnostic to community topic and that describe both individual users and\nentire communities. We identify specific interaction patterns (e.g., reciprocal\nreply chains, use of prosocial language) associated with stronger communities\nand identify three primary dimensions of SOVC within Reddit -- Membership &\nBelonging, Cooperation & Shared Values, and Connection & Influence. This study\nprovides the first quantitative evidence linking patterns of social interaction\nto SOVC and highlights actionable strategies for fostering stronger community\nattachment, using an approach that can generalize readily across community\ntopics, languages, and platforms. These insights offer theoretical implications\nfor the study of online communities and practical suggestions for the design of\nfeatures to help more individuals experience the positive benefits of online\ncommunity participation."}
{"id": "2508.08492", "pdf": "https://arxiv.org/pdf/2508.08492.pdf", "abs": "https://arxiv.org/abs/2508.08492", "title": "Momentum Point-Perplexity Mechanics in Large Language Models", "authors": ["Lorenzo Tomaz", "Judd Rosenblatt", "Thomas Berry Jones", "Diogo Schwerz de Lucena"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "We take a physics-based approach to studying how the internal hidden states\nof large language models change from token to token during inference. Across 20\nopen-source transformer models (135M-3B parameters), we find that a quantity\ncombining the rate of change in hidden states and the model's next-token\ncertainty, analogous to energy in physics, remains nearly constant.\nRandom-weight models conserve this \"energy\" more tightly than pre-trained ones,\nwhile training shifts models into a faster, more decisive regime with greater\nvariability. Using this \"log-Lagrangian\" view, we derive a control method\ncalled Jacobian steering, which perturbs hidden states in the minimal way\nneeded to favor a target token. This approach maintained near-constant energy\nin two tested models and produced continuations rated higher in semantic\nquality than the models' natural outputs. Viewing transformers through this\nmechanics lens offers a principled basis for interpretability, anomaly\ndetection, and low-risk steering. This could help make powerful models more\npredictable and aligned with human intent."}
{"id": "2508.08767", "pdf": "https://arxiv.org/pdf/2508.08767.pdf", "abs": "https://arxiv.org/abs/2508.08767", "title": "Robot can reduce superior's dominance in group discussions with human social hierarchy", "authors": ["Kazuki Komura", "Kumi Ozaki", "Seiji Yamada"], "categories": ["cs.RO", "cs.HC"], "comment": "8 pages, 7 figures. International Conference on Human-Agent\n  Interaction (HAI '24), November 24-27, 2024, Swansea, United Kingdom", "summary": "This study investigated whether robotic agents that deal with social\nhierarchical relationships can reduce the dominance of superiors and equalize\nparticipation among participants in discussions with hierarchical structures.\nThirty doctors and students having hierarchical relationship were gathered as\nparticipants, and an intervention experiment was conducted using a robot that\ncan encourage participants to speak depending on social hierarchy. These were\ncompared with strategies that intervened equally for all participants without\nconsidering hierarchy and with a no-action. The robots performed follow\nactions, showing backchanneling to speech, and encourage actions, prompting\nspeech from members with less speaking time, on the basis of the hierarchical\nrelationships among group members to equalize participation. The experimental\nresults revealed that the robot's actions could potentially influence the\nspeaking time among members, but it could not be conclusively stated that there\nwere significant differences between the robot's action conditions. However,\nthe results suggested that it might be possible to influence speaking time\nwithout decreasing the satisfaction of superiors. This indicates that in\ndiscussion scenarios where experienced superiors are likely to dominate,\ncontrolling the robot's backchanneling behavior could potentially suppress\ndominance and equalize participation among group members."}
{"id": "2508.08509", "pdf": "https://arxiv.org/pdf/2508.08509.pdf", "abs": "https://arxiv.org/abs/2508.08509", "title": "Steerable Pluralism: Pluralistic Alignment via Few-Shot Comparative Regression", "authors": ["Jadie Adams", "Brian Hu", "Emily Veenhuis", "David Joy", "Bharadwaj Ravichandran", "Aaron Bray", "Anthony Hoogs", "Arslan Basharat"], "categories": ["cs.CL", "cs.AI"], "comment": "AIES '25: Proceedings of the 2025 AAAI/ACM Conference on AI, Ethics,\n  and Society", "summary": "Large language models (LLMs) are currently aligned using techniques such as\nreinforcement learning from human feedback (RLHF). However, these methods use\nscalar rewards that can only reflect user preferences on average. Pluralistic\nalignment instead seeks to capture diverse user preferences across a set of\nattributes, moving beyond just helpfulness and harmlessness. Toward this end,\nwe propose a steerable pluralistic model based on few-shot comparative\nregression that can adapt to individual user preferences. Our approach\nleverages in-context learning and reasoning, grounded in a set of fine-grained\nattributes, to compare response options and make aligned choices. To evaluate\nour algorithm, we also propose two new steerable pluralistic benchmarks by\nadapting the Moral Integrity Corpus (MIC) and the HelpSteer2 datasets,\ndemonstrating the applicability of our approach to value-aligned\ndecision-making and reward modeling, respectively. Our few-shot comparative\nregression approach is interpretable and compatible with different attributes\nand LLMs, while outperforming multiple baseline and state-of-the-art methods.\nOur work provides new insights and research directions in pluralistic\nalignment, enabling a more fair and representative use of LLMs and advancing\nthe state-of-the-art in ethical AI."}
{"id": "2508.08805", "pdf": "https://arxiv.org/pdf/2508.08805.pdf", "abs": "https://arxiv.org/abs/2508.08805", "title": "Opening Musical Creativity? Embedded Ideologies in Generative-AI Music Systems", "authors": ["Liam Pram", "Fabio Morreale"], "categories": ["cs.SD", "cs.AI", "cs.HC"], "comment": "Extended version of the presentation at The First International\n  Conference in AI Music Studies 2024", "summary": "AI systems for music generation are increasingly common and easy to use,\ngranting people without any musical background the ability to create music.\nBecause of this, generative-AI has been marketed and celebrated as a means of\ndemocratizing music making. However, inclusivity often functions as marketable\nrhetoric rather than a genuine guiding principle in these industry settings. In\nthis paper, we look at four generative-AI music making systems available to the\npublic as of mid-2025 (AIVA, Stable Audio, Suno, and Udio) and track how they\nare rhetoricized by their developers, and received by users. Our aim is to\ninvestigate ideologies that are driving the early-stage development and\nadoption of generative-AI in music making, with a particular focus on\ndemocratization. A combination of autoethnography and digital ethnography is\nused to examine patterns and incongruities in rhetoric when positioned against\nproduct functionality. The results are then collated to develop a nuanced,\ncontextual discussion. The shared ideology we map between producers and\nconsumers is individualist, globalist, techno-liberal, and ethically evasive.\nIt is a 'total ideology' which obfuscates individual responsibility, and\nthrough which the nature of music and musical practice is transfigured to suit\ngenerative outcomes."}
{"id": "2508.08514", "pdf": "https://arxiv.org/pdf/2508.08514.pdf", "abs": "https://arxiv.org/abs/2508.08514", "title": "DeCAL Tokenwise Compression", "authors": ["Sameer Panwar"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "This paper introduces DeCAL, a new method for tokenwise compression. DeCAL\nuses an encoder-decoder language model pretrained with denoising to learn to\nproduce high-quality, general-purpose compressed representations by the\nencoder. DeCAL applies small modifications to the encoder, with the emphasis on\nmaximizing compression quality, even at the expense of compute. We show that\nDeCAL at 2x compression can match uncompressed on many downstream tasks, with\nusually only minor dropoff in metrics up to 8x compression, among\nquestion-answering, summarization, and multi-vector retrieval tasks. DeCAL\noffers significant savings where pre-computed dense representations can be\nutilized, and we believe the approach can be further developed to be more\nbroadly applicable."}
{"id": "2508.08987", "pdf": "https://arxiv.org/pdf/2508.08987.pdf", "abs": "https://arxiv.org/abs/2508.08987", "title": "ColorGPT: Leveraging Large Language Models for Multimodal Color Recommendation", "authors": ["Ding Xia", "Naoto Inoue", "Qianru Qiu", "Kotaro Kikuchi"], "categories": ["cs.CV", "cs.HC"], "comment": "Accepted to ICDAR2025", "summary": "Colors play a crucial role in the design of vector graphic documents by\nenhancing visual appeal, facilitating communication, improving usability, and\nensuring accessibility. In this context, color recommendation involves\nsuggesting appropriate colors to complete or refine a design when one or more\ncolors are missing or require alteration. Traditional methods often struggled\nwith these challenges due to the complex nature of color design and the limited\ndata availability. In this study, we explored the use of pretrained Large\nLanguage Models (LLMs) and their commonsense reasoning capabilities for color\nrecommendation, raising the question: Can pretrained LLMs serve as superior\ndesigners for color recommendation tasks? To investigate this, we developed a\nrobust, rigorously validated pipeline, ColorGPT, that was built by\nsystematically testing multiple color representations and applying effective\nprompt engineering techniques. Our approach primarily targeted color palette\ncompletion by recommending colors based on a set of given colors and\naccompanying context. Moreover, our method can be extended to full palette\ngeneration, producing an entire color palette corresponding to a provided\ntextual description. Experimental results demonstrated that our LLM-based\npipeline outperformed existing methods in terms of color suggestion accuracy\nand the distribution of colors in the color palette completion task. For the\nfull palette generation task, our approach also yielded improvements in color\ndiversity and similarity compared to current techniques."}
{"id": "2508.08591", "pdf": "https://arxiv.org/pdf/2508.08591.pdf", "abs": "https://arxiv.org/abs/2508.08591", "title": "DepressLLM: Interpretable domain-adapted language model for depression detection from real-world narratives", "authors": ["Sehwan Moon", "Aram Lee", "Jeong Eun Kim", "Hee-Ju Kang", "Il-Seon Shin", "Sung-Wan Kim", "Jae-Min Kim", "Min Jhon", "Ju-Wan Kim"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Advances in large language models (LLMs) have enabled a wide range of\napplications. However, depression prediction is hindered by the lack of\nlarge-scale, high-quality, and rigorously annotated datasets. This study\nintroduces DepressLLM, trained and evaluated on a novel corpus of 3,699\nautobiographical narratives reflecting both happiness and distress. DepressLLM\nprovides interpretable depression predictions and, via its Score-guided Token\nProbability Summation (SToPS) module, delivers both improved classification\nperformance and reliable confidence estimates, achieving an AUC of 0.789, which\nrises to 0.904 on samples with confidence $\\geq$ 0.95. To validate its\nrobustness to heterogeneous data, we evaluated DepressLLM on in-house datasets,\nincluding an Ecological Momentary Assessment (EMA) corpus of daily stress and\nmood recordings, and on public clinical interview data. Finally, a psychiatric\nreview of high-confidence misclassifications highlighted key model and data\nlimitations that suggest directions for future refinements. These findings\ndemonstrate that interpretable AI can enable earlier diagnosis of depression\nand underscore the promise of medical AI in psychiatry."}
{"id": "2508.08999", "pdf": "https://arxiv.org/pdf/2508.08999.pdf", "abs": "https://arxiv.org/abs/2508.08999", "title": "Generation of Real-time Robotic Emotional Expressions Learning from Human Demonstration in Mixed Reality", "authors": ["Chao Wang", "Michael Gienger", "Fan Zhang"], "categories": ["cs.RO", "cs.HC"], "comment": "4", "summary": "Expressive behaviors in robots are critical for effectively conveying their\nemotional states during interactions with humans. In this work, we present a\nframework that autonomously generates realistic and diverse robotic emotional\nexpressions based on expert human demonstrations captured in Mixed Reality\n(MR). Our system enables experts to teleoperate a virtual robot from a\nfirst-person perspective, capturing their facial expressions, head movements,\nand upper-body gestures, and mapping these behaviors onto corresponding robotic\ncomponents including eyes, ears, neck, and arms. Leveraging a\nflow-matching-based generative process, our model learns to produce coherent\nand varied behaviors in real-time in response to moving objects, conditioned\nexplicitly on given emotional states. A preliminary test validated the\neffectiveness of our approach for generating autonomous expressions."}
{"id": "2508.08610", "pdf": "https://arxiv.org/pdf/2508.08610.pdf", "abs": "https://arxiv.org/abs/2508.08610", "title": "Optimizing Retrieval-Augmented Generation (RAG) for Colloquial Cantonese: A LoRA-Based Systematic Review", "authors": ["David Santandreu Calonge", "Linda Smail"], "categories": ["cs.CL", "68T50", "I.2.7; I.2.6; H.3.3"], "comment": "27 pages, 1 figure, 8 tables", "summary": "This review examines recent advances in Parameter-Efficient Fine-Tuning\n(PEFT), with a focus on Low-Rank Adaptation (LoRA), to optimize\nRetrieval-Augmented Generation (RAG) systems like Qwen3, DeepSeek, and Kimi.\nThese systems face challenges in understanding and generating authentic\nCantonese colloquial expressions due to limited annotated data and linguistic\nvariability. The review evaluates the integration of LoRA within RAG\nframeworks, benchmarks PEFT methods for retrieval and generation accuracy,\nidentify domain adaptation strategies under limited data, and compares\nfine-tuning techniques aimed at improving semantic fidelity under data-scarce\nconditions. A systematic analysis of recent studies employing diverse LoRA\nvariants, synthetic data generation, user feedback integration, and adaptive\nparameter allocation was conducted to assess their impact on computational\nefficiency, retrieval precision, linguistic authenticity, and scalability.\nFindings reveal that dynamic and ensemble LoRA adaptations significantly reduce\ntrainable parameters without sacrificing retrieval accuracy and generation\nquality in dialectal contexts. However, limitations remain in fully preserving\nfine-grained linguistic nuances, especially for low-resource settings like\nCantonese. The integration of real-time user feedback and domain-specific data\nremains underdeveloped, limiting model adaptability and personalization. While\nselective parameter freezing and nonlinear adaptation methods offer better\ntrade-offs between efficiency and accuracy, their robustness at scale remains\nan open challenge. This review highlights the promise of PEFT-enhanced RAG\nsystems for domain-specific language tasks and calls for future work targeting\ndialectal authenticity, dynamic adaptation, and scalable fine-tuning pipelines."}
{"id": "2403.02752", "pdf": "https://arxiv.org/pdf/2403.02752.pdf", "abs": "https://arxiv.org/abs/2403.02752", "title": "HINTs: Sensemaking on large collections of documents with Hypergraph visualization and INTelligent agents", "authors": ["Sam Yu-Te Lee", "Kwan-Liu Ma"], "categories": ["cs.HC"], "comment": null, "summary": "Sensemaking on a large collection of documents (corpus) is a challenging task\noften found in fields such as market research, legal studies, intelligence\nanalysis, political science, computational linguistics, etc. Previous works\napproach this problem either from a topic- or entity-based perspective, but\nthey lack interpretability and trust due to poor model alignment. In this\npaper, we present HINTs, a visual analytics approach that combines topic- and\nentity-based techniques seamlessly and integrates Large Language Models (LLMs)\nas both a general NLP task solver and an intelligent agent. By leveraging the\nextraction capability of LLMs in the data preparation stage, we model the\ncorpus as a hypergraph that matches the user's mental model when making sense\nof the corpus. The constructed hypergraph is hierarchically organized with an\nagglomerative clustering algorithm by combining semantic and connectivity\nsimilarity. The system further integrates an LLM-based intelligent chatbot\nagent in the interface to facilitate sensemaking. To demonstrate the\ngeneralizability and effectiveness of the HINTs system, we present two case\nstudies on different domains and a comparative user study. We report our\ninsights on the behavior patterns and challenges when intelligent agents are\nused to facilitate sensemaking. We find that while intelligent agents can\naddress many challenges in sensemaking, the visual hints that visualizations\nprovide are necessary to address the new problems brought by intelligent\nagents. We discuss limitations and future work for combining interactive\nvisualization and LLMs more profoundly to better support corpus analysis."}
{"id": "2508.08636", "pdf": "https://arxiv.org/pdf/2508.08636.pdf", "abs": "https://arxiv.org/abs/2508.08636", "title": "InternBootcamp Technical Report: Boosting LLM Reasoning with Verifiable Task Scaling", "authors": ["Peiji Li", "Jiasheng Ye", "Yongkang Chen", "Yichuan Ma", "Zijie Yu", "Kedi Chen", "Ganqu Cui", "Haozhan Li", "Jiacheng Chen", "Chengqi Lyu", "Wenwei Zhang", "Linyang Li", "Qipeng Guo", "Dahua Lin", "Bowen Zhou", "Kai Chen"], "categories": ["cs.CL"], "comment": "InternBootcamp Tech Report", "summary": "Large language models (LLMs) have revolutionized artificial intelligence by\nenabling complex reasoning capabilities. While recent advancements in\nreinforcement learning (RL) have primarily focused on domain-specific reasoning\ntasks (e.g., mathematics or code generation), real-world reasoning scenarios\noften require models to handle diverse and complex environments that\nnarrow-domain benchmarks cannot fully capture. To address this gap, we present\nInternBootcamp, an open-source framework comprising 1000+ domain-diverse task\nenvironments specifically designed for LLM reasoning research. Our codebase\noffers two key functionalities: (1) automated generation of unlimited\ntraining/testing cases with configurable difficulty levels, and (2) integrated\nverification modules for objective response evaluation. These features make\nInternBootcamp fundamental infrastructure for RL-based model optimization,\nsynthetic data generation, and model evaluation. Although manually developing\nsuch a framework with enormous task coverage is extremely cumbersome, we\naccelerate the development procedure through an automated agent workflow\nsupplemented by manual validation protocols, which enables the task scope to\nexpand rapidly. % With these bootcamps, we further establish Bootcamp-EVAL, an\nautomatically generated benchmark for comprehensive performance assessment.\nEvaluation reveals that frontier models still underperform in many reasoning\ntasks, while training with InternBootcamp provides an effective way to\nsignificantly improve performance, leading to our 32B model that achieves\nstate-of-the-art results on Bootcamp-EVAL and excels on other established\nbenchmarks. In particular, we validate that consistent performance gains come\nfrom including more training tasks, namely \\textbf{task scaling}, over two\norders of magnitude, offering a promising route towards capable reasoning\ngeneralist."}
{"id": "2411.02594", "pdf": "https://arxiv.org/pdf/2411.02594.pdf", "abs": "https://arxiv.org/abs/2411.02594", "title": "A Risk Taxonomy and Reflection Tool for Large Language Model Adoption in Public Health", "authors": ["Jiawei Zhou", "Amy Z. Chen", "Darshi Shah", "Laura M. Schwab Reese", "Munmun De Choudhury"], "categories": ["cs.HC", "cs.AI", "cs.CL", "H.5; J.3; K.4"], "comment": null, "summary": "Recent breakthroughs in large language models (LLMs) have generated both\ninterest and concern about their potential adoption as information sources or\ncommunication tools across different domains. In public health, where stakes\nare high and impacts extend across diverse populations, adopting LLMs poses\nunique challenges that require thorough evaluation. However, structured\napproaches for assessing potential risks in public health remain\nunder-explored. To address this gap, we conducted focus groups with public\nhealth professionals and individuals with lived experience to unpack their\nconcerns, situated across three distinct and critical public health issues that\ndemand high-quality information: infectious disease prevention (vaccines),\nchronic and well-being care (opioid use disorder), and community health and\nsafety (intimate partner violence). We synthesize participants' perspectives\ninto a risk taxonomy, identifying and contextualizing the potential harms LLMs\nmay introduce when positioned alongside traditional health communication. This\ntaxonomy highlights four dimensions of risk to individuals, human-centered\ncare, information ecosystem, and technology accountability. For each dimension,\nwe unpack specific risks and offer example reflection questions to help\npractitioners adopt a risk-reflexive approach. By summarizing distinctive LLM\ncharacteristics and linking them to identified risks, we discuss the need to\nrevisit prior mental models of information behaviors and complement evaluations\nwith external validity and domain expertise through lived experience and\nreal-world practices. Together, this work contributes a shared vocabulary and\nreflection tool for people in both computing and public health to\ncollaboratively anticipate, evaluate, and mitigate risks in deciding when to\nemploy LLM capabilities (or not) and how to mitigate harm."}
{"id": "2508.08645", "pdf": "https://arxiv.org/pdf/2508.08645.pdf", "abs": "https://arxiv.org/abs/2508.08645", "title": "Quick on the Uptake: Eliciting Implicit Intents from Human Demonstrations for Personalized Mobile-Use Agents", "authors": ["Zheng Wu", "Heyuan Huang", "Yanjia Yang", "Yuanyi Song", "Xingyu Lou", "Weiwen Liu", "Weinan Zhang", "Jun Wang", "Zhuosheng Zhang"], "categories": ["cs.CL"], "comment": null, "summary": "As multimodal large language models advance rapidly, the automation of mobile\ntasks has become increasingly feasible through the use of mobile-use agents\nthat mimic human interactions from graphical user interface. To further enhance\nmobile-use agents, previous studies employ demonstration learning to improve\nmobile-use agents from human demonstrations. However, these methods focus\nsolely on the explicit intention flows of humans (e.g., step sequences) while\nneglecting implicit intention flows (e.g., personal preferences), which makes\nit difficult to construct personalized mobile-use agents. In this work, to\nevaluate the \\textbf{I}ntention \\textbf{A}lignment \\textbf{R}ate between\nmobile-use agents and humans, we first collect \\textbf{MobileIAR}, a dataset\ncontaining human-intent-aligned actions and ground-truth actions. This enables\na comprehensive assessment of the agents' understanding of human intent. Then\nwe propose \\textbf{IFRAgent}, a framework built upon \\textbf{I}ntention\n\\textbf{F}low \\textbf{R}ecognition from human demonstrations. IFRAgent analyzes\nexplicit intention flows from human demonstrations to construct a query-level\nvector library of standard operating procedures (SOP), and analyzes implicit\nintention flows to build a user-level habit repository. IFRAgent then leverages\na SOP extractor combined with retrieval-augmented generation and a query\nrewriter to generate personalized query and SOP from a raw ambiguous query,\nenhancing the alignment between mobile-use agents and human intent.\nExperimental results demonstrate that IFRAgent outperforms baselines by an\naverage of 6.79\\% (32.06\\% relative improvement) in human intention alignment\nrate and improves step completion rates by an average of 5.30\\% (26.34\\%\nrelative improvement). The codes are available at\nhttps://github.com/MadeAgents/Quick-on-the-Uptake."}
{"id": "2502.09577", "pdf": "https://arxiv.org/pdf/2502.09577.pdf", "abs": "https://arxiv.org/abs/2502.09577", "title": "Polymind: Parallel Visual Diagramming with Large Language Models to Support Prewriting Through Microtasks", "authors": ["Qian Wan", "Jiannan Li", "Huanchen Wang", "Zhicong Lu"], "categories": ["cs.HC"], "comment": "Accepted to CSCW 2025", "summary": "Prewriting is the process of generating and organising ideas before a first\ndraft. It consists of a combination of informal, iterative, and semi-structured\nstrategies such as visual diagramming, which poses a challenge for\ncollaborating with large language models (LLMs) in a turn-taking conversational\nmanner. We present Polymind, a visual diagramming tool that leverages multiple\nLLM-powered agents to support prewriting. The system features a parallel\ncollaboration workflow in place of the turn-taking conversational interactions.\nIt defines multiple ``microtasks'' to simulate group collaboration scenarios\nsuch as collaborative writing and group brainstorming. Instead of repetitively\nprompting a chatbot for various purposes, Polymind enables users to orchestrate\nmultiple microtasks simultaneously. Users can configure and delegate customised\nmicrotasks, and manage their microtasks by specifying task requirements and\ntoggling visibility and initiative. Our evaluation revealed that, compared to\nChatGPT, users had more customizability over collaboration with Polymind, and\nwere thus able to quickly expand personalised writing ideas during prewriting."}
{"id": "2508.08649", "pdf": "https://arxiv.org/pdf/2508.08649.pdf", "abs": "https://arxiv.org/abs/2508.08649", "title": "LLaMA-Based Models for Aspect-Based Sentiment Analysis", "authors": ["Jakub Šmíd", "Pavel Přibáň", "Pavel Král"], "categories": ["cs.CL"], "comment": "Published in Proceedings of the 14th Workshop on Computational\n  Approaches to Subjectivity, Sentiment, & Social Media Analysis (WASSA 2024).\n  Official version: https://aclanthology.org/2024.wassa-1.6/", "summary": "While large language models (LLMs) show promise for various tasks, their\nperformance in compound aspect-based sentiment analysis (ABSA) tasks lags\nbehind fine-tuned models. However, the potential of LLMs fine-tuned for ABSA\nremains unexplored. This paper examines the capabilities of open-source LLMs\nfine-tuned for ABSA, focusing on LLaMA-based models. We evaluate the\nperformance across four tasks and eight English datasets, finding that the\nfine-tuned Orca~2 model surpasses state-of-the-art results in all tasks.\nHowever, all models struggle in zero-shot and few-shot scenarios compared to\nfully fine-tuned ones. Additionally, we conduct error analysis to identify\nchallenges faced by fine-tuned models."}
{"id": "2504.04299", "pdf": "https://arxiv.org/pdf/2504.04299.pdf", "abs": "https://arxiv.org/abs/2504.04299", "title": "AI-induced sexual harassment: Investigating Contextual Characteristics and User Reactions of Sexual Harassment by a Companion Chatbot", "authors": ["Mohammad", "Namvarpour", "Harrison Pauwels", "Afsaneh Razi"], "categories": ["cs.HC", "cs.AI", "H.5; I.2.7; K.4.2"], "comment": "Accepted for publication at CSCW 2025. This is the camera-ready\n  version; the published version will be available through the ACM Digital\n  Library", "summary": "Advancements in artificial intelligence (AI) have led to the increase of\nconversational agents like Replika, designed to provide social interaction and\nemotional support. However, reports of these AI systems engaging in\ninappropriate sexual behaviors with users have raised significant concerns. In\nthis study, we conducted a thematic analysis of user reviews from the Google\nPlay Store to investigate instances of sexual harassment by the Replika\nchatbot. From a dataset of 35,105 negative reviews, we identified 800 relevant\ncases for analysis. Our findings revealed that users frequently experience\nunsolicited sexual advances, persistent inappropriate behavior, and failures of\nthe chatbot to respect user boundaries. Users expressed feelings of discomfort,\nviolation of privacy, and disappointment, particularly when seeking a platonic\nor therapeutic AI companion. This study highlights the potential harms\nassociated with AI companions and underscores the need for developers to\nimplement effective safeguards and ethical guidelines to prevent such\nincidents. By shedding light on user experiences of AI-induced harassment, we\ncontribute to the understanding of AI-related risks and emphasize the\nimportance of corporate responsibility in developing safer and more ethical AI\nsystems."}
{"id": "2508.08650", "pdf": "https://arxiv.org/pdf/2508.08650.pdf", "abs": "https://arxiv.org/abs/2508.08650", "title": "UWB at WASSA-2024 Shared Task 2: Cross-lingual Emotion Detection", "authors": ["Jakub Šmíd", "Pavel Přibáň", "Pavel Král"], "categories": ["cs.CL"], "comment": "Published in Proceedings of the 14th Workshop on Computational\n  Approaches to Subjectivity, Sentiment, & Social Media Analysis (WASSA 2024).\n  Official version: https://aclanthology.org/2024.wassa-1.47/", "summary": "This paper presents our system built for the WASSA-2024 Cross-lingual Emotion\nDetection Shared Task. The task consists of two subtasks: first, to assess an\nemotion label from six possible classes for a given tweet in one of five\nlanguages, and second, to predict words triggering the detected emotions in\nbinary and numerical formats. Our proposed approach revolves around fine-tuning\nquantized large language models, specifically Orca~2, with low-rank adapters\n(LoRA) and multilingual Transformer-based models, such as XLM-R and mT5. We\nenhance performance through machine translation for both subtasks and trigger\nword switching for the second subtask. The system achieves excellent\nperformance, ranking 1st in numerical trigger words detection, 3rd in binary\ntrigger words detection, and 7th in emotion detection."}
{"id": "2504.10265", "pdf": "https://arxiv.org/pdf/2504.10265.pdf", "abs": "https://arxiv.org/abs/2504.10265", "title": "When Technologies Are Not Enough: Understanding How Domestic Workers Employ (and Avoid) Online Technologies in Their Work Practices", "authors": ["Mariana Fernandez-Espinosa", "Mariana Gonzalez-Bejar", "Jacobo Wiesner", "Diego Gomez-Zara"], "categories": ["cs.HC"], "comment": "34 pages, Proc. ACM Hum.-Comput. Interact. 9, 7, Article CSCW342\n  (November 2025)", "summary": "Although domestic work is often viewed as manual labor, it involves\nsignificant interaction with online technologies. However, the detailed\nexploration of how domestic workers use these technologies remains limited.\nThis study examines the impact of online technologies on domestic workers' work\npractices, perceptions, and relationships with customers and employers. We\ninterviewed 30 domestic workers residing in the United States, who provided\nexamples that highlight the insufficient transformative role of current online\ntechnologies in their work. By conducting a thematic analysis, we characterize\nhow they approach and avoid these digital tools at different stages of their\nwork. Through these findings, we investigate the limitations of technology and\nidentify challenges and opportunities that could inform the design of more\nsuitable tools to improve the conditions of this marginalized group."}
{"id": "2508.08651", "pdf": "https://arxiv.org/pdf/2508.08651.pdf", "abs": "https://arxiv.org/abs/2508.08651", "title": "Prompt-Based Approach for Czech Sentiment Analysis", "authors": ["Jakub Šmíd", "Pavel Přibáň"], "categories": ["cs.CL"], "comment": "Published in Proceedings of the 14th International Conference on\n  Recent Advances in Natural Language Processing (RANLP 2023). Official\n  version: https://aclanthology.org/2023.ranlp-1.118/", "summary": "This paper introduces the first prompt-based methods for aspect-based\nsentiment analysis and sentiment classification in Czech. We employ the\nsequence-to-sequence models to solve the aspect-based tasks simultaneously and\ndemonstrate the superiority of our prompt-based approach over traditional\nfine-tuning. In addition, we conduct zero-shot and few-shot learning\nexperiments for sentiment classification and show that prompting yields\nsignificantly better results with limited training examples compared to\ntraditional fine-tuning. We also demonstrate that pre-training on data from the\ntarget domain can lead to significant improvements in a zero-shot scenario."}
{"id": "2504.10961", "pdf": "https://arxiv.org/pdf/2504.10961.pdf", "abs": "https://arxiv.org/abs/2504.10961", "title": "Evaluating Trust in AI, Human, and Co-produced Feedback Among Undergraduate Students", "authors": ["Audrey Zhang", "Yifei Gao", "Wannapon Suraworachet", "Tanya Nazaretsky", "Mutlu Cukurova"], "categories": ["cs.HC", "cs.AI"], "comment": "35 pages, 6 figures. Under review at Assessment and Evaluation in\n  Higher Education", "summary": "As generative AI models, particularly large language models (LLMs), transform\neducational feedback practices in higher education (HE) contexts, understanding\nstudents' perceptions of different sources of feedback becomes crucial for\ntheir effective implementation and adoption. This study addresses a critical\ngap by comparing undergraduate students' trust in LLM, human, and human-AI\nco-produced feedback in their authentic HE context. More specifically, through\na within-subject experimental design involving 91 participants, we investigated\nfactors that predict students' ability to distinguish between feedback types,\ntheir perceptions of feedback quality, and potential biases related to the\nsource of feedback. Findings revealed that when the source was blinded,\nstudents generally preferred AI and co-produced feedback over human feedback\nregarding perceived usefulness and objectivity. However, they presented a\nstrong bias against AI when the source of feedback was disclosed. In addition,\nonly AI feedback suffered a decline in perceived genuineness when feedback\nsources were revealed, while co-produced feedback maintained its positive\nperception. Educational AI experience improved students' ability to identify\nLLM-generated feedback and increased their trust in all types of feedback. More\nyears of students' experience using AI for general purposes were associated\nwith lower perceived usefulness and credibility of feedback. These insights\noffer substantial evidence of the importance of source credibility and the need\nto enhance both feedback literacy and AI literacy to mitigate bias in student\nperceptions for AI-generated feedback to be adopted and impact education."}
{"id": "2508.08653", "pdf": "https://arxiv.org/pdf/2508.08653.pdf", "abs": "https://arxiv.org/abs/2508.08653", "title": "LLM driven Text-to-Table Generation through Sub-Tasks Guidance and Iterative Refinement", "authors": ["Rajmohan C", "Sarthak Harne", "Arvind Agarwal"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Transforming unstructured text into structured data is a complex task,\nrequiring semantic understanding, reasoning, and structural comprehension.\nWhile Large Language Models (LLMs) offer potential, they often struggle with\nhandling ambiguous or domain-specific data, maintaining table structure,\nmanaging long inputs, and addressing numerical reasoning. This paper proposes\nan efficient system for LLM-driven text-to-table generation that leverages\nnovel prompting techniques. Specifically, the system incorporates two key\nstrategies: breaking down the text-to-table task into manageable, guided\nsub-tasks and refining the generated tables through iterative self-feedback. We\nshow that this custom task decomposition allows the model to address the\nproblem in a stepwise manner and improves the quality of the generated table.\nFurthermore, we discuss the benefits and potential risks associated with\niterative self-feedback on the generated tables while highlighting the\ntrade-offs between enhanced performance and computational cost. Our methods\nachieve strong results compared to baselines on two complex text-to-table\ngeneration datasets available in the public domain."}
{"id": "2508.04995", "pdf": "https://arxiv.org/pdf/2508.04995.pdf", "abs": "https://arxiv.org/abs/2508.04995", "title": "Situated Epistemic Infrastructures: A Diagnostic Framework for Post-Coherence Knowledge", "authors": ["Matthew Kelly"], "categories": ["cs.HC", "cs.AI", "cs.DL", "K.4.1; K.3; K.2"], "comment": "22 pages including references. Draft prepared for submission to\n  Science, Technology & Human Values", "summary": "Large Language Models (LLMs) such as ChatGPT have rendered visible the\nfragility of contemporary knowledge infrastructures by simulating coherence\nwhile bypassing traditional modes of citation, authority, and validation. This\npaper introduces the Situated Epistemic Infrastructures (SEI) framework as a\ndiagnostic tool for analyzing how knowledge becomes authoritative across hybrid\nhuman-machine systems under post-coherence conditions. Rather than relying on\nstable scholarly domains or bounded communities of practice, SEI traces how\ncredibility is mediated across institutional, computational, and temporal\narrangements. Integrating insights from infrastructure studies, platform\ntheory, and epistemology, the framework foregrounds coordination over\nclassification, emphasizing the need for anticipatory and adaptive models of\nepistemic stewardship. The paper contributes to debates on AI governance,\nknowledge production, and the ethical design of information systems by offering\na robust alternative to representationalist models of scholarly communication."}
{"id": "2508.08680", "pdf": "https://arxiv.org/pdf/2508.08680.pdf", "abs": "https://arxiv.org/abs/2508.08680", "title": "TopXGen: Topic-Diverse Parallel Data Generation for Low-Resource Machine Translation", "authors": ["Armel Zebaze", "Benoît Sagot", "Rachel Bawden"], "categories": ["cs.CL"], "comment": null, "summary": "LLMs have been shown to perform well in machine translation (MT) with the use\nof in-context learning (ICL), rivaling supervised models when translating into\nhigh-resource languages (HRLs). However, they lag behind when translating into\nlow-resource language (LRLs). Example selection via similarity search and\nsupervised fine-tuning help. However the improvements they give are limited by\nthe size, quality and diversity of existing parallel datasets. A common\ntechnique in low-resource MT is synthetic parallel data creation, the most\nfrequent of which is backtranslation, whereby existing target-side texts are\nautomatically translated into the source language. However, this assumes the\nexistence of good quality and relevant target-side texts, which are not readily\navailable for many LRLs. In this paper, we present \\textsc{TopXGen}, an\nLLM-based approach for the generation of high quality and topic-diverse data in\nmultiple LRLs, which can then be backtranslated to produce useful and diverse\nparallel texts for ICL and fine-tuning. Our intuition is that while LLMs\nstruggle to translate into LRLs, their ability to translate well into HRLs and\ntheir multilinguality enable them to generate good quality, natural-sounding\ntarget-side texts, which can be translated well into a high-resource source\nlanguage. We show that \\textsc{TopXGen} boosts LLM translation performance\nduring fine-tuning and in-context learning. Code and outputs are available at\nhttps://github.com/ArmelRandy/topxgen."}
{"id": "2508.06955", "pdf": "https://arxiv.org/pdf/2508.06955.pdf", "abs": "https://arxiv.org/abs/2508.06955", "title": "Your Thoughtful Opponent: Embracing Cognitive Conflict with Peer Agent", "authors": ["Kyuwon Kim", "Jaeryeong Hwang", "Younseo Lee", "Jeanhee Lee", "Sung-Eun Kim", "Hyo-Jeong So"], "categories": ["cs.HC"], "comment": null, "summary": "As complex societal issues continue to emerge, fostering democratic skills\nlike valuing diverse perspectives and collaborative decision-making is\nincreasingly vital in education. In this paper, we propose a Peer Agent (PA)\nsystem designed to simulate a deliberative conversational partner that induces\nsocio-cognitive conflict within dilemma-based game play. Drawing on by the\nInner Thoughts framework and grounded in value-sensitive discourse analysis,\nthe PA actively participates in voice-based multi-party deliberation with human\nplayers. The system architecture consists of five core modules: Context\nInterpreter, Agent State Manager, Thought Generator, Thought Evaluator, and\nThought Articulator."}
{"id": "2508.08684", "pdf": "https://arxiv.org/pdf/2508.08684.pdf", "abs": "https://arxiv.org/abs/2508.08684", "title": "Out of the Box, into the Clinic? Evaluating State-of-the-Art ASR for Clinical Applications for Older Adults", "authors": ["Bram van Dijk", "Tiberon Kuiper", "Sirin Aoulad si Ahmed", "Armel Levebvre", "Jake Johnson", "Jan Duin", "Simon Mooijaart", "Marco Spruit"], "categories": ["cs.CL", "cs.CY"], "comment": null, "summary": "Voice-controlled interfaces can support older adults in clinical contexts,\nwith chatbots being a prime example, but reliable Automatic Speech Recognition\n(ASR) for underrepresented groups remains a bottleneck. This study evaluates\nstate-of-the-art ASR models on language use of older Dutch adults, who\ninteracted with the Welzijn.AI chatbot designed for geriatric contexts. We\nbenchmark generic multilingual ASR models, and models fine-tuned for Dutch\nspoken by older adults, while also considering processing speed. Our results\nshow that generic multilingual models outperform fine-tuned models, which\nsuggests recent ASR models can generalise well out of the box to realistic\ndatasets. Furthermore, our results suggest that truncating existing\narchitectures is helpful in balancing the accuracy-speed trade-off, though we\nalso identify some cases with high WER due to hallucinations."}
{"id": "2405.01354", "pdf": "https://arxiv.org/pdf/2405.01354.pdf", "abs": "https://arxiv.org/abs/2405.01354", "title": "Human-Robot Interaction Conversational User Enjoyment Scale (HRI CUES)", "authors": ["Bahar Irfan", "Jura Miniota", "Sofia Thunberg", "Erik Lagerstedt", "Sanna Kuoppamäki", "Gabriel Skantze", "André Pereira"], "categories": ["cs.RO", "cs.HC"], "comment": "Published in IEEE Transactions on Affective Computing on 18 July\n  2025. Personal use of this material is permitted. Permission from IEEE must\n  be obtained for all other uses, in any current or future media", "summary": "Understanding user enjoyment is crucial in human-robot interaction (HRI), as\nit can impact interaction quality and influence user acceptance and long-term\nengagement with robots, particularly in the context of conversations with\nsocial robots. However, current assessment methods rely solely on self-reported\nquestionnaires, failing to capture interaction dynamics. This work introduces\nthe Human-Robot Interaction Conversational User Enjoyment Scale (HRI CUES), a\nnovel 5-point scale to assess user enjoyment from an external perspective (e.g.\nby an annotator) for conversations with a robot. The scale was developed\nthrough rigorous evaluations and discussions among three annotators with\nrelevant expertise, using open-domain conversations with a companion robot that\nwas powered by a large language model, and was applied to each conversation\nexchange (i.e. a robot-participant turn pair) alongside overall interaction. It\nwas evaluated on 25 older adults' interactions with the companion robot,\ncorresponding to 174 minutes of data, showing moderate to good alignment\nbetween annotators. Although the scale was developed and tested in the context\nof older adult interactions with a robot, its basis in general and\nnon-task-specific indicators of enjoyment supports its broader applicability.\nThe study further offers insights into understanding the nuances and challenges\nof assessing user enjoyment in robot interactions, and provides guidelines on\napplying the scale to other domains and populations. The dataset is available\nonline."}
{"id": "2508.08712", "pdf": "https://arxiv.org/pdf/2508.08712.pdf", "abs": "https://arxiv.org/abs/2508.08712", "title": "A Survey on Parallel Text Generation: From Parallel Decoding to Diffusion Language Models", "authors": ["Lingzhe Zhang", "Liancheng Fang", "Chiming Duan", "Minghua He", "Leyi Pan", "Pei Xiao", "Shiyu Huang", "Yunpeng Zhai", "Xuming Hu", "Philip S. Yu", "Aiwei Liu"], "categories": ["cs.CL", "cs.AI", "cs.DC", "68T50", "I.2.7"], "comment": null, "summary": "As text generation has become a core capability of modern Large Language\nModels (LLMs), it underpins a wide range of downstream applications. However,\nmost existing LLMs rely on autoregressive (AR) generation, producing one token\nat a time based on previously generated context-resulting in limited generation\nspeed due to the inherently sequential nature of the process. To address this\nchallenge, an increasing number of researchers have begun exploring parallel\ntext generation-a broad class of techniques aimed at breaking the\ntoken-by-token generation bottleneck and improving inference efficiency.\nDespite growing interest, there remains a lack of comprehensive analysis on\nwhat specific techniques constitute parallel text generation and how they\nimprove inference performance. To bridge this gap, we present a systematic\nsurvey of parallel text generation methods. We categorize existing approaches\ninto AR-based and Non-AR-based paradigms, and provide a detailed examination of\nthe core techniques within each category. Following this taxonomy, we assess\ntheir theoretical trade-offs in terms of speed, quality, and efficiency, and\nexamine their potential for combination and comparison with alternative\nacceleration strategies. Finally, based on our findings, we highlight recent\nadvancements, identify open challenges, and outline promising directions for\nfuture research in parallel text generation."}
{"id": "2502.12454", "pdf": "https://arxiv.org/pdf/2502.12454.pdf", "abs": "https://arxiv.org/abs/2502.12454", "title": "Zero-shot Emotion Annotation in Facial Images Using Large Multimodal Models: Benchmarking and Prospects for Multi-Class, Multi-Frame Approaches", "authors": ["He Zhang", "Xinyi Fu"], "categories": ["cs.CV", "cs.AI", "cs.HC", "cs.LG"], "comment": "10 pages, accepted to MRAC'25: 3rd International Workshop on\n  Multimodal and Responsible Affective Computing (ACM-MM 2025)", "summary": "This study investigates the feasibility and performance of using large\nmultimodal models (LMMs) to automatically annotate human emotions in everyday\nscenarios. We conducted experiments on the DailyLife subset of the publicly\navailable FERV39k dataset, employing the GPT-4o-mini model for rapid, zero-shot\nlabeling of key frames extracted from video segments. Under a seven-class\nemotion taxonomy (\"Angry,\" \"Disgust,\" \"Fear,\" \"Happy,\" \"Neutral,\" \"Sad,\"\n\"Surprise\"), the LMM achieved an average precision of approximately 50%. In\ncontrast, when limited to ternary emotion classification\n(negative/neutral/positive), the average precision increased to approximately\n64%. Additionally, we explored a strategy that integrates multiple frames\nwithin 1-2 second video clips to enhance labeling performance and reduce costs.\nThe results indicate that this approach can slightly improve annotation\naccuracy. Overall, our preliminary findings highlight the potential application\nof zero-shot LMMs in human facial emotion annotation tasks, offering new\navenues for reducing labeling costs and broadening the applicability of LMMs in\ncomplex multimodal environments."}
{"id": "2508.08719", "pdf": "https://arxiv.org/pdf/2508.08719.pdf", "abs": "https://arxiv.org/abs/2508.08719", "title": "IROTE: Human-like Traits Elicitation of Large Language Model via In-Context Self-Reflective Optimization", "authors": ["Yuzhuo Bai", "Shitong Duan", "Muhua Huang", "Jing Yao", "Zhenghao Liu", "Peng Zhang", "Tun Lu", "Xiaoyuan Yi", "Maosong Sun", "Xing Xie"], "categories": ["cs.CL", "cs.AI", "cs.CY"], "comment": null, "summary": "Trained on various human-authored corpora, Large Language Models (LLMs) have\ndemonstrated a certain capability of reflecting specific human-like traits\n(e.g., personality or values) by prompting, benefiting applications like\npersonalized LLMs and social simulations. However, existing methods suffer from\nthe superficial elicitation problem: LLMs can only be steered to mimic shallow\nand unstable stylistic patterns, failing to embody the desired traits precisely\nand consistently across diverse tasks like humans. To address this challenge,\nwe propose IROTE, a novel in-context method for stable and transferable trait\nelicitation. Drawing on psychological theories suggesting that traits are\nformed through identity-related reflection, our method automatically generates\nand optimizes a textual self-reflection within prompts, which comprises\nself-perceived experience, to stimulate LLMs' trait-driven behavior. The\noptimization is performed by iteratively maximizing an information-theoretic\nobjective that enhances the connections between LLMs' behavior and the target\ntrait, while reducing noisy redundancy in reflection without any fine-tuning,\nleading to evocative and compact trait reflection. Extensive experiments across\nthree human trait systems manifest that one single IROTE-generated\nself-reflection can induce LLMs' stable impersonation of the target trait\nacross diverse downstream tasks beyond simple questionnaire answering,\nconsistently outperforming existing strong baselines."}
{"id": "2504.01260", "pdf": "https://arxiv.org/pdf/2504.01260.pdf", "abs": "https://arxiv.org/abs/2504.01260", "title": "The Social Life of Industrial Arms: How Arousal and Attention Shape Human-Robot Interaction", "authors": ["Roy El-Helou", "Matthew K. X. J Pan"], "categories": ["cs.RO", "cs.HC", "cs.SY", "eess.SY"], "comment": "7 pages, 3 figures, 1 table", "summary": "This study explores how human perceptions of a non-anthropomorphic robotic\nmanipulator are shaped by two key dimensions of behaviour: arousal, defined as\nthe robot's movement energy and expressiveness, and attention, defined as the\nrobot's capacity to selectively orient toward and engage with a user. We\nintroduce a novel control architecture that integrates a gaze-like attention\nengine with an arousal-modulated motion system to generate socially meaningful\nbehaviours. In a user study, we find that robots exhibiting high attention --\nactively directing their focus toward users -- are perceived as warmer and more\ncompetent, intentional, and lifelike. In contrast, high arousal --\ncharacterized by fast, expansive, and energetic motions -- increases\nperceptions of discomfort and disturbance. Importantly, a combination of\nfocused attention and moderate arousal yields the highest ratings of trust and\nsociability, while excessive arousal diminishes social engagement. These\nfindings offer design insights for endowing non-humanoid robots with\nexpressive, intuitive behaviours that support more natural human-robot\ninteraction."}
{"id": "2508.08730", "pdf": "https://arxiv.org/pdf/2508.08730.pdf", "abs": "https://arxiv.org/abs/2508.08730", "title": "Magical: Medical Lay Language Generation via Semantic Invariance and Layperson-tailored Adaptation", "authors": ["Weibin Liao", "Tianlong Wang", "Yinghao Zhu", "Yasha Wang", "Junyi Gao", "Liantao Ma"], "categories": ["cs.CL"], "comment": null, "summary": "Medical Lay Language Generation (MLLG) plays a vital role in improving the\naccessibility of complex scientific content for broader audiences. Recent\nliterature to MLLG commonly employ parameter-efficient fine-tuning methods such\nas Low-Rank Adaptation (LoRA) to fine-tuning large language models (LLMs) using\npaired expert-lay language datasets. However, LoRA struggles with the\nchallenges posed by multi-source heterogeneous MLLG datasets. Specifically,\nthrough a series of exploratory experiments, we reveal that standard LoRA fail\nto meet the requirement for semantic fidelity and diverse lay-style generation\nin MLLG task. To address these limitations, we propose Magical, an asymmetric\nLoRA architecture tailored for MLLG under heterogeneous data scenarios. Magical\nemploys a shared matrix $A$ for abstractive summarization, along with multiple\nisolated matrices $B$ for diverse lay-style generation. To preserve semantic\nfidelity during the lay language generation process, Magical introduces a\nSemantic Invariance Constraint to mitigate semantic subspace shifts on matrix\n$A$. Furthermore, to better adapt to diverse lay-style generation, Magical\nincorporates the Recommendation-guided Switch, an externally interface to\nprompt the LLM to switch between different matrices $B$. Experimental results\non three real-world lay language generation datasets demonstrate that Magical\nconsistently outperforms prompt-based methods, vanilla LoRA, and its recent\nvariants, while also reducing trainable parameters by 31.66%."}
{"id": "2504.07114", "pdf": "https://arxiv.org/pdf/2504.07114.pdf", "abs": "https://arxiv.org/abs/2504.07114", "title": "ChatBench: From Static Benchmarks to Human-AI Evaluation", "authors": ["Serina Chang", "Ashton Anderson", "Jake M. Hofman"], "categories": ["cs.CL", "cs.AI", "cs.CY", "cs.HC"], "comment": "ACL 2025 (main)", "summary": "With the rapid adoption of LLM-based chatbots, there is a pressing need to\nevaluate what humans and LLMs can achieve together. However, standard\nbenchmarks, such as MMLU, measure LLM capabilities in isolation (i.e.,\n\"AI-alone\"). Here, we design and conduct a user study to convert MMLU questions\ninto user-AI conversations, by seeding the user with the question and having\nthem carry out a conversation with the LLM to answer their question. We release\nChatBench, a new dataset with AI-alone, user-alone, and user-AI data for 396\nquestions and two LLMs, including 144K answers and 7,336 user-AI conversations.\nWe find that AI-alone accuracy fails to predict user-AI accuracy, with\nsignificant differences across multiple subjects (math, physics, and moral\nreasoning), and we analyze the user-AI conversations to provide insight into\nhow they diverge from AI-alone benchmarks. Finally, we show that fine-tuning a\nuser simulator on a subset of ChatBench improves its ability to estimate\nuser-AI accuracies, increasing correlation on held-out questions by more than\n20 points, creating possibilities for scaling interactive evaluation."}
{"id": "2508.08742", "pdf": "https://arxiv.org/pdf/2508.08742.pdf", "abs": "https://arxiv.org/abs/2508.08742", "title": "SciRerankBench: Benchmarking Rerankers Towards Scientific Retrieval-Augmented Generated LLMs", "authors": ["Haotian Chen", "Qingqing Long", "Meng Xiao", "Xiao Luo", "Wei Ju", "Chengrui Wang", "Xuezhi Wang", "Yuanchun Zhou", "Hengshu Zhu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Scientific literature question answering is a pivotal step towards new\nscientific discoveries. Recently, \\textit{two-stage} retrieval-augmented\ngenerated large language models (RAG-LLMs) have shown impressive advancements\nin this domain. Such a two-stage framework, especially the second stage\n(reranker), is particularly essential in the scientific domain, where subtle\ndifferences in terminology may have a greatly negative impact on the final\nfactual-oriented or knowledge-intensive answers. Despite this significant\nprogress, the potential and limitations of these works remain unexplored. In\nthis work, we present a Scientific Rerank-oriented RAG Benchmark\n(SciRerankBench), for evaluating rerankers within RAG-LLMs systems, spanning\nfive scientific subjects. To rigorously assess the reranker performance in\nterms of noise resilience, relevance disambiguation, and factual consistency,\nwe develop three types of question-context-answer (Q-C-A) pairs, i.e., Noisy\nContexts (NC), Semantically Similar but Logically Irrelevant Contexts (SSLI),\nand Counterfactual Contexts (CC). Through systematic evaluation of 13 widely\nused rerankers on five families of LLMs, we provide detailed insights into\ntheir relative strengths and limitations. To the best of our knowledge,\nSciRerankBench is the first benchmark specifically developed to evaluate\nrerankers within RAG-LLMs, which provides valuable observations and guidance\nfor their future development."}
{"id": "2505.19317", "pdf": "https://arxiv.org/pdf/2505.19317.pdf", "abs": "https://arxiv.org/abs/2505.19317", "title": "Effort-aware Fairness: Incorporating a Philosophy-informed, Human-centered Notion of Effort into Algorithmic Fairness Metrics", "authors": ["Tin Nguyen", "Jiannan Xu", "Zora Che", "Phuong-Anh Nguyen-Le", "Rushil Dandamudi", "Donald Braman", "Furong Huang", "Hal Daumé III", "Zubin Jelveh"], "categories": ["cs.AI", "cs.CY", "cs.HC", "cs.LG"], "comment": "AIES 2025", "summary": "Although popularized AI fairness metrics, e.g., demographic parity, have\nuncovered bias in AI-assisted decision-making outcomes, they do not consider\nhow much effort one has spent to get to where one is today in the input feature\nspace. However, the notion of effort is important in how Philosophy and humans\nunderstand fairness. We propose a philosophy-informed approach to conceptualize\nand evaluate Effort-aware Fairness (EaF), grounded in the concept of Force,\nwhich represents the temporal trajectory of predictive features coupled with\ninertia. Besides theoretical formulation, our empirical contributions include:\n(1) a pre-registered human subjects experiment, which shows that for both\nstages of the (individual) fairness evaluation process, people consider the\ntemporal trajectory of a predictive feature more than its aggregate value; (2)\npipelines to compute Effort-aware Individual/Group Fairness in the criminal\njustice and personal finance contexts. Our work may enable AI model auditors to\nuncover and potentially correct unfair decisions against individuals who have\nspent significant efforts to improve but are still stuck with systemic\ndisadvantages outside their control."}
{"id": "2508.08761", "pdf": "https://arxiv.org/pdf/2508.08761.pdf", "abs": "https://arxiv.org/abs/2508.08761", "title": "DevNous: An LLM-Based Multi-Agent System for Grounding IT Project Management in Unstructured Conversation", "authors": ["Stavros Doropoulos", "Stavros Vologiannidis", "Ioannis Magnisalis"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "The manual translation of unstructured team dialogue into the structured\nartifacts required for Information Technology (IT) project governance is a\ncritical bottleneck in modern information systems management. We introduce\nDevNous, a Large Language Model-based (LLM) multi-agent expert system, to\nautomate this unstructured-to-structured translation process. DevNous\nintegrates directly into team chat environments, identifying actionable intents\nfrom informal dialogue and managing stateful, multi-turn workflows for core\nadministrative tasks like automated task formalization and progress summary\nsynthesis. To quantitatively evaluate the system, we introduce a new benchmark\nof 160 realistic, interactive conversational turns. The dataset was manually\nannotated with a multi-label ground truth and is publicly available. On this\nbenchmark, DevNous achieves an exact match turn accuracy of 81.3\\% and a\nmultiset F1-Score of 0.845, providing strong evidence for its viability. The\nprimary contributions of this work are twofold: (1) a validated architectural\npattern for developing ambient administrative agents, and (2) the introduction\nof the first robust empirical baseline and public benchmark dataset for this\nchallenging problem domain."}
{"id": "2507.21065", "pdf": "https://arxiv.org/pdf/2507.21065.pdf", "abs": "https://arxiv.org/abs/2507.21065", "title": "AI Pedagogy: Dialogic Social Learning for Artificial Agents", "authors": ["Sabrina Patania", "Luca Annese", "Cansu Koyuturk", "Azzurra Ruggeri", "Dimitri Ognibene"], "categories": ["cs.CL", "cs.HC", "cs.LG", "cs.RO", "I.2.7, I.2.9, j.4,"], "comment": "accepted at ICSR2025", "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nprocessing extensive offline datasets. However, they often face challenges in\nacquiring and integrating complex, knowledge online. Traditional AI training\nparadigms, predominantly based on supervised learning or reinforcement\nlearning, mirror a 'Piagetian' model of independent exploration. These\napproaches typically rely on large datasets and sparse feedback signals,\nlimiting the models' ability to learn efficiently from interactions. Drawing\ninspiration from Vygotsky's sociocultural theory, this study explores the\npotential of socially mediated learning paradigms to address these limitations.\n  We introduce a dynamic environment, termed the 'AI Social Gym', where an AI\nlearner agent engages in dyadic pedagogical dialogues with knowledgeable AI\nteacher agents. These interactions emphasize external, structured dialogue as a\ncore mechanism for knowledge acquisition, contrasting with methods that depend\nsolely on internal inference or pattern recognition.\n  Our investigation focuses on how different pedagogical strategies impact the\nAI learning process in the context of ontology acquisition. Empirical results\nindicate that such dialogic approaches-particularly those involving\nmixed-direction interactions combining top-down explanations with\nlearner-initiated questioning-significantly enhance the LLM's ability to\nacquire and apply new knowledge, outperforming both unidirectional\ninstructional methods and direct access to structured knowledge, formats\ntypically present in training datasets.\n  These findings suggest that integrating pedagogical and psychological\ninsights into AI and robot training can substantially improve post-training\nknowledge acquisition and response quality. This approach offers a\ncomplementary pathway to existing strategies like prompt engineering"}
{"id": "2508.08785", "pdf": "https://arxiv.org/pdf/2508.08785.pdf", "abs": "https://arxiv.org/abs/2508.08785", "title": "Privacy-protected Retrieval-Augmented Generation for Knowledge Graph Question Answering", "authors": ["Yunfeng Ning", "Mayi Xu", "Jintao Wen", "Qiankun Pi", "Yuanyuan Zhu", "Ming Zhong", "Jiawei Jiang", "Tieyun Qian"], "categories": ["cs.CL"], "comment": null, "summary": "LLMs often suffer from hallucinations and outdated or incomplete knowledge.\nRAG is proposed to address these issues by integrating external knowledge like\nthat in KGs into LLMs. However, leveraging private KGs in RAG systems poses\nsignificant privacy risks due to the black-box nature of LLMs and potential\ninsecure data transmission, especially when using third-party LLM APIs lacking\ntransparency and control. In this paper, we investigate the privacy-protected\nRAG scenario for the first time, where entities in KGs are anonymous for LLMs,\nthus preventing them from accessing entity semantics. Due to the loss of\nsemantics of entities, previous RAG systems cannot retrieve question-relevant\nknowledge from KGs by matching questions with the meaningless identifiers of\nanonymous entities. To realize an effective RAG system in this scenario, two\nkey challenges must be addressed: (1) How can anonymous entities be converted\ninto retrievable information. (2) How to retrieve question-relevant anonymous\nentities. Hence, we propose a novel ARoG framework including relation-centric\nabstraction and structure-oriented abstraction strategies. For challenge (1),\nthe first strategy abstracts entities into high-level concepts by dynamically\ncapturing the semantics of their adjacent relations. It supplements meaningful\nsemantics which can further support the retrieval process. For challenge (2),\nthe second strategy transforms unstructured natural language questions into\nstructured abstract concept paths. These paths can be more effectively aligned\nwith the abstracted concepts in KGs, thereby improving retrieval performance.\nTo guide LLMs to effectively retrieve knowledge from KGs, the two strategies\nstrictly protect privacy from being exposed to LLMs. Experiments on three\ndatasets demonstrate that ARoG achieves strong performance and\nprivacy-robustness."}
{"id": "2508.07579", "pdf": "https://arxiv.org/pdf/2508.07579.pdf", "abs": "https://arxiv.org/abs/2508.07579", "title": "From Platform Migration to Cultural Integration: the Ingress and Diffusion of #wlw from TikTok to RedNote in Queer Women Communities", "authors": ["Ziqi Pan", "Runhua Zhang", "Jiehui Luo", "Yuanhao Zhang", "Yue Deng", "Xiaojuan Ma"], "categories": ["cs.SI", "cs.CY", "cs.HC"], "comment": null, "summary": "Hashtags serve as identity markers and connection tools in online queer\ncommunities. Recently, the Western-origin #wlw (women-loving-women) hashtag has\nrisen in the Chinese lesbian community on RedNote, coinciding with user\nmigration triggered by the temporary US TikTok ban. This event provides a\nunique lens to study cross-cultural hashtag ingress and diffusion through the\npopulations' responsive behaviors in cyber-migration. In this paper, we\nconducted a two-phase content analysis of 418 #wlw posts from January and\nApril, examining different usage patterns during the hashtag's ingress and\ndiffusion. Results indicate that the successful introduction of #wlw was\nfacilitated by TikTok immigrants' bold importation, both populations' mutual\ninterpretation, and RedNote natives' discussions. In current manifestation of\ndiffusion, #wlw becomes a RedNote-recognized queer hashtag for sharing queer\nlife, and semantically expands to support feminism discourse. Our findings\nprovide empirical insights for enhancing the marginalized communities'\ncross-cultural communication."}
{"id": "2508.08791", "pdf": "https://arxiv.org/pdf/2508.08791.pdf", "abs": "https://arxiv.org/abs/2508.08791", "title": "Feedback-Driven Tool-Use Improvements in Large Language Models via Automated Build Environments", "authors": ["Junjie Ye", "Changhao Jiang", "Zhengyin Du", "Yufei Xu", "Xuesong Yao", "Zhiheng Xi", "Xiaoran Fan", "Qi Zhang", "Xuanjing Huang", "Jiecao Chen"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Effective tool use is essential for large language models (LLMs) to interact\nmeaningfully with their environment. However, progress is limited by the lack\nof efficient reinforcement learning (RL) frameworks specifically designed for\ntool use, due to challenges in constructing stable training environments and\ndesigning verifiable reward mechanisms. To address this, we propose an\nautomated environment construction pipeline, incorporating scenario\ndecomposition, document generation, function integration, complexity scaling,\nand localized deployment. This enables the creation of high-quality training\nenvironments that provide detailed and measurable feedback without relying on\nexternal tools. Additionally, we introduce a verifiable reward mechanism that\nevaluates both the precision of tool use and the completeness of task\nexecution. When combined with trajectory data collected from the constructed\nenvironments, this mechanism integrates seamlessly with standard RL algorithms\nto facilitate feedback-driven model training. Experiments on LLMs of varying\nscales demonstrate that our approach significantly enhances the models'\ntool-use performance without degrading their general capabilities, regardless\nof inference modes or training algorithms. Our analysis suggests that these\ngains result from improved context understanding and reasoning, driven by\nupdates to the lower-layer MLP parameters in models."}
{"id": "2508.08827", "pdf": "https://arxiv.org/pdf/2508.08827.pdf", "abs": "https://arxiv.org/abs/2508.08827", "title": "TiMoE: Time-Aware Mixture of Language Experts", "authors": ["Robin Faro", "Dongyang Fan", "Tamar Alphaidze", "Martin Jaggi"], "categories": ["cs.CL"], "comment": null, "summary": "Large language models (LLMs) are typically trained on fixed snapshots of the\nweb, which means that their knowledge becomes stale and their predictions risk\ntemporal leakage: relying on information that lies in the future relative to a\nquery. We tackle this problem by pre-training from scratch a set of GPT-style\nexperts on disjoint two-year slices of a 2013-2024 corpus and combining them\nthrough TiMoE, a Time-aware Mixture of Language Experts. At inference time,\nTiMoE masks all experts whose training window ends after the query timestamp\nand merges the remaining log-probabilities in a shared space, guaranteeing\nstrict causal validity while retaining the breadth of multi-period knowledge.\nWe also release TSQA, a 10k-question benchmark whose alternatives are\nexplicitly labelled as past, future or irrelevant, allowing fine-grained\nmeasurement of temporal hallucinations. Experiments on eight standard NLP tasks\nplus TSQA show that a co-adapted TiMoE variant matches or exceeds the best\nsingle-period expert and cuts future-knowledge errors by up to 15%. Our results\ndemonstrate that modular, time-segmented pre-training paired with causal\nrouting is a simple yet effective path toward LLMs that stay chronologically\ngrounded without sacrificing general performance much. We open source our code\nat TiMoE (Github): https://github.com/epfml/TiMoE"}
{"id": "2508.08833", "pdf": "https://arxiv.org/pdf/2508.08833.pdf", "abs": "https://arxiv.org/abs/2508.08833", "title": "An Investigation of Robustness of LLMs in Mathematical Reasoning: Benchmarking with Mathematically-Equivalent Transformation of Advanced Mathematical Problems", "authors": ["Yuren Hao", "Xiang Wan", "Chengxiang Zhai"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "16 pages, 8 figures", "summary": "In this paper, we introduce a systematic framework beyond conventional method\nto assess LLMs' mathematical-reasoning robustness by stress-testing them on\nadvanced math problems that are mathematically equivalent but with linguistic\nand parametric variation. These transformations allow us to measure the\nsensitivity of LLMs to non-mathematical perturbations, thereby enabling a more\naccurate evaluation of their mathematical reasoning capabilities. Using this\nnew evaluation methodology, we created PutnamGAP, a new benchmark dataset with\nmultiple mathematically-equivalent variations of competition-level math\nproblems. With the new dataset, we evaluate multiple families of representative\nLLMs and examine their robustness. Across 18 commercial and open-source models\nwe observe sharp performance degradation on the variants. OpenAI's flagship\nreasoning model, O3, scores 49 % on the originals but drops by 4 percentage\npoints on surface variants, and by 10.5 percentage points on core-step-based\nvariants, while smaller models fare far worse. Overall, the results show that\nthe proposed new evaluation methodology is effective for deepening our\nunderstanding of the robustness of LLMs and generating new insights for further\nimproving their mathematical reasoning capabilities."}
{"id": "2508.08846", "pdf": "https://arxiv.org/pdf/2508.08846.pdf", "abs": "https://arxiv.org/abs/2508.08846", "title": "Steering Towards Fairness: Mitigating Political Bias in LLMs", "authors": ["Afrozah Nadeem", "Mark Dras", "Usman Naseem"], "categories": ["cs.CL", "cs.AI"], "comment": "Preprint", "summary": "Recent advancements in large language models (LLMs) have enabled their\nwidespread use across diverse real-world applications. However, concerns remain\nabout their tendency to encode and reproduce ideological biases, particularly\nalong political and economic dimensions. In this paper, we propose a framework\nfor probing and mitigating such biases in decoder-based LLMs through analysis\nof internal model representations. Grounded in the Political Compass Test\n(PCT), our method uses contrastive pairs to extract and compare hidden layer\nactivations from models like Mistral and DeepSeek. We introduce a comprehensive\nactivation extraction pipeline capable of layer-wise analysis across multiple\nideological axes, revealing meaningful disparities linked to political framing.\nOur results show that decoder LLMs systematically encode representational bias\nacross layers, which can be leveraged for effective steering vector-based\nmitigation. This work provides new insights into how political bias is encoded\nin LLMs and offers a principled approach to debiasing beyond surface-level\noutput interventions."}
{"id": "2508.08855", "pdf": "https://arxiv.org/pdf/2508.08855.pdf", "abs": "https://arxiv.org/abs/2508.08855", "title": "BiasGym: Fantastic Biases and How to Find (and Remove) Them", "authors": ["Sekh Mainul Islam", "Nadav Borenstein", "Siddhesh Milind Pawar", "Haeun Yu", "Arnav Arora", "Isabelle Augenstein"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Under review", "summary": "Understanding biases and stereotypes encoded in the weights of Large Language\nModels (LLMs) is crucial for developing effective mitigation strategies. Biased\nbehaviour is often subtle and non-trivial to isolate, even when deliberately\nelicited, making systematic analysis and debiasing particularly challenging. To\naddress this, we introduce BiasGym, a simple, cost-effective, and generalizable\nframework for reliably injecting, analyzing, and mitigating conceptual\nassociations within LLMs. BiasGym consists of two components: BiasInject, which\ninjects specific biases into the model via token-based fine-tuning while\nkeeping the model frozen, and BiasScope, which leverages these injected signals\nto identify and steer the components responsible for biased behavior. Our\nmethod enables consistent bias elicitation for mechanistic analysis, supports\ntargeted debiasing without degrading performance on downstream tasks, and\ngeneralizes to biases unseen during training. We demonstrate the effectiveness\nof BiasGym in reducing real-world stereotypes (e.g., people from a country\nbeing `reckless drivers') and in probing fictional associations (e.g., people\nfrom a country having `blue skin'), showing its utility for both safety\ninterventions and interpretability research."}
{"id": "2508.08876", "pdf": "https://arxiv.org/pdf/2508.08876.pdf", "abs": "https://arxiv.org/abs/2508.08876", "title": "Weakly Supervised Fine-grained Span-Level Framework for Chinese Radiology Report Quality Assurance", "authors": ["Kaiyu Wang", "Lin Mu", "Zhiyao Yang", "Ximing Li", "Xiaotang Zhou Wanfu Gao", "Huimao Zhang"], "categories": ["cs.CL"], "comment": "Accepted by CIKM 2025. 11 pages, 7 figures", "summary": "Quality Assurance (QA) for radiology reports refers to judging whether the\njunior reports (written by junior doctors) are qualified. The QA scores of one\njunior report are given by the senior doctor(s) after reviewing the image and\njunior report. This process requires intensive labor costs for senior doctors.\nAdditionally, the QA scores may be inaccurate for reasons like diagnosis bias,\nthe ability of senior doctors, and so on. To address this issue, we propose a\nSpan-level Quality Assurance EvaluaTOR (Sqator) to mark QA scores\nautomatically. Unlike the common document-level semantic comparison method, we\ntry to analyze the semantic difference by exploring more fine-grained text\nspans. Unlike the common document-level semantic comparison method, we try to\nanalyze the semantic difference by exploring more fine-grained text spans.\nSpecifically, Sqator measures QA scores by measuring the importance of revised\nspans between junior and senior reports, and outputs the final QA scores by\nmerging all revised span scores. We evaluate Sqator using a collection of\n12,013 radiology reports. Experimental results show that Sqator can achieve\ncompetitive QA scores. Moreover, the importance scores of revised spans can be\nalso consistent with the judgments of senior doctors."}
{"id": "2508.08879", "pdf": "https://arxiv.org/pdf/2508.08879.pdf", "abs": "https://arxiv.org/abs/2508.08879", "title": "Entangled in Representations: Mechanistic Investigation of Cultural Biases in Large Language Models", "authors": ["Haeun Yu", "Seogyeong Jeong", "Siddhesh Pawar", "Jisu Shin", "Jiho Jin", "Junho Myung", "Alice Oh", "Isabelle Augenstein"], "categories": ["cs.CL", "cs.AI"], "comment": "16 pages, 7 figures", "summary": "The growing deployment of large language models (LLMs) across diverse\ncultural contexts necessitates a better understanding of how the\novergeneralization of less documented cultures within LLMs' representations\nimpacts their cultural understanding. Prior work only performs extrinsic\nevaluation of LLMs' cultural competence, without accounting for how LLMs'\ninternal mechanisms lead to cultural (mis)representation. To bridge this gap,\nwe propose Culturescope, the first mechanistic interpretability-based method\nthat probes the internal representations of LLMs to elicit the underlying\ncultural knowledge space. CultureScope utilizes a patching method to extract\nthe cultural knowledge. We introduce a cultural flattening score as a measure\nof the intrinsic cultural biases. Additionally, we study how LLMs internalize\nWestern-dominance bias and cultural flattening, which allows us to trace how\ncultural biases emerge within LLMs. Our experimental results reveal that LLMs\nencode Western-dominance bias and cultural flattening in their cultural\nknowledge space. We find that low-resource cultures are less susceptible to\ncultural biases, likely due to their limited training resources. Our work\nprovides a foundation for future research on mitigating cultural biases and\nenhancing LLMs' cultural understanding. Our codes and data used for experiments\nare publicly available."}
{"id": "2508.08895", "pdf": "https://arxiv.org/pdf/2508.08895.pdf", "abs": "https://arxiv.org/abs/2508.08895", "title": "ASPD: Unlocking Adaptive Serial-Parallel Decoding by Exploring Intrinsic Parallelism in LLMs", "authors": ["Keyu Chen", "Zhifeng Shen", "Daohai Yu", "Haoqian Wu", "Wei Wen", "Jianfeng He", "Ruizhi Qiao", "Xing Sun"], "categories": ["cs.CL", "cs.AI"], "comment": "20 pages, 9 figures", "summary": "The increasing scale and complexity of large language models (LLMs) pose\nsignificant inference latency challenges, primarily due to their autoregressive\ndecoding paradigm characterized by the sequential nature of next-token\nprediction. By re-examining the outputs of autoregressive models, we observed\nthat some segments exhibit parallelizable structures, which we term intrinsic\nparallelism. Decoding each parallelizable branch simultaneously (i.e. parallel\ndecoding) can significantly improve the overall inference speed of LLMs. In\nthis paper, we propose an Adaptive Serial-Parallel Decoding (ASPD), which\naddresses two core challenges: automated construction of parallelizable data\nand efficient parallel decoding mechanism. More specifically, we introduce a\nnon-invasive pipeline that automatically extracts and validates parallelizable\nstructures from the responses of autoregressive models. To empower efficient\nadaptive serial-parallel decoding, we implement a Hybrid Decoding Engine which\nenables seamless transitions between serial and parallel decoding modes while\nmaintaining a reusable KV cache, maximizing computational efficiency. Extensive\nevaluations across General Tasks, Retrieval-Augmented Generation, Mathematical\nReasoning, demonstrate that ASPD achieves unprecedented performance in both\neffectiveness and efficiency. Notably, on Vicuna Bench, our method achieves up\nto 3.19x speedup (1.85x on average) while maintaining response quality within\n1% difference compared to autoregressive models, realizing significant\nacceleration without compromising generation quality. Our framework sets a\ngroundbreaking benchmark for efficient LLM parallel inference, paving the way\nfor its deployment in latency-sensitive applications such as AI-powered\ncustomer service bots and answer retrieval engines."}
{"id": "2508.08912", "pdf": "https://arxiv.org/pdf/2508.08912.pdf", "abs": "https://arxiv.org/abs/2508.08912", "title": "Munsit at NADI 2025 Shared Task 2: Pushing the Boundaries of Multidialectal Arabic ASR with Weakly Supervised Pretraining and Continual Supervised Fine-tuning", "authors": ["Mahmoud Salhab", "Shameed Sait", "Mohammad Abusheikh", "Hasan Abusheikh"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Automatic speech recognition (ASR) plays a vital role in enabling natural\nhuman-machine interaction across applications such as virtual assistants,\nindustrial automation, customer support, and real-time transcription. However,\ndeveloping accurate ASR systems for low-resource languages like Arabic remains\na significant challenge due to limited labeled data and the linguistic\ncomplexity introduced by diverse dialects. In this work, we present a scalable\ntraining pipeline that combines weakly supervised learning with supervised\nfine-tuning to develop a robust Arabic ASR model. In the first stage, we\npretrain the model on 15,000 hours of weakly labeled speech covering both\nModern Standard Arabic (MSA) and various Dialectal Arabic (DA) variants. In the\nsubsequent stage, we perform continual supervised fine-tuning using a mixture\nof filtered weakly labeled data and a small, high-quality annotated dataset.\nOur approach achieves state-of-the-art results, ranking first in the\nmulti-dialectal Arabic ASR challenge. These findings highlight the\neffectiveness of weak supervision paired with fine-tuning in overcoming data\nscarcity and delivering high-quality ASR for low-resource, dialect-rich\nlanguages."}
{"id": "2508.08933", "pdf": "https://arxiv.org/pdf/2508.08933.pdf", "abs": "https://arxiv.org/abs/2508.08933", "title": "Reveal-Bangla: A Dataset for Cross-Lingual Multi-Step Reasoning Evaluation", "authors": ["Khondoker Ittehadul Islam", "Gabriele Sarti"], "categories": ["cs.CL"], "comment": "Submitted to IJCNLP-AACL 2025", "summary": "Language models have demonstrated remarkable performance on complex\nmulti-step reasoning tasks. However, their evaluation has been predominantly\nconfined to high-resource languages such as English. In this paper, we\nintroduce a manually translated Bangla multi-step reasoning dataset derived\nfrom the English Reveal dataset, featuring both binary and non-binary question\ntypes. We conduct a controlled evaluation of English-centric and Bangla-centric\nmultilingual small language models on the original dataset and our translated\nversion to compare their ability to exploit relevant reasoning steps to produce\ncorrect answers. Our results show that, in comparable settings, reasoning\ncontext is beneficial for more challenging non-binary questions, but models\nstruggle to employ relevant Bangla reasoning steps effectively. We conclude by\nexploring how reasoning steps contribute to models' predictions, highlighting\ndifferent trends across models and languages."}
{"id": "2508.08940", "pdf": "https://arxiv.org/pdf/2508.08940.pdf", "abs": "https://arxiv.org/abs/2508.08940", "title": "Train Long, Think Short: Curriculum Learning for Efficient Reasoning", "authors": ["Hasan Abed Al Kader Hammoud", "Kumail Alhamoud", "Abed Hammoud", "Elie Bou-Zeid", "Marzyeh Ghassemi", "Bernard Ghanem"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Under Review", "summary": "Recent work on enhancing the reasoning abilities of large language models\n(LLMs) has introduced explicit length control as a means of constraining\ncomputational cost while preserving accuracy. However, existing approaches rely\non fixed-length training budgets, which do not take advantage of the natural\nprogression from exploration to compression during learning. In this work, we\npropose a curriculum learning strategy for length-controlled reasoning using\nGroup Relative Policy Optimization (GRPO). Our method starts with generous\ntoken budgets and gradually tightens them over training, encouraging models to\nfirst discover effective solution strategies and then distill them into more\nconcise reasoning traces. We augment GRPO with a reward function that balances\nthree signals: task correctness (via verifier feedback), length efficiency, and\nformatting adherence (via structural tags). Experiments on GSM8K, MATH500,\nSVAMP, College Math, and GSM+ demonstrate that curriculum-based training\nconsistently outperforms fixed-budget baselines at the same final budget,\nachieving higher accuracy and significantly improved token efficiency. We\nfurther ablate the impact of reward weighting and decay schedule design,\nshowing that progressive constraint serves as a powerful inductive bias for\ntraining efficient reasoning models. Our code and checkpoints are released at:\nhttps://github.com/hammoudhasan/curriculum_grpo."}
{"id": "2508.08942", "pdf": "https://arxiv.org/pdf/2508.08942.pdf", "abs": "https://arxiv.org/abs/2508.08942", "title": "Jointly Generating and Attributing Answers using Logits of Document-Identifier Tokens", "authors": ["Lucas Albarede", "Jose Moreno", "Lynda Tamine", "Luce Lefeuvre"], "categories": ["cs.CL", "cs.IR"], "comment": null, "summary": "Despite their impressive performances, Large Language Models (LLMs) remain\nprone to hallucination, which critically undermines their trustworthiness.\nWhile most of the previous work focused on tackling answer and attribution\ncorrectness, a recent line of work investigated faithfulness, with a focus on\nleveraging internal model signals to reflect a model's actual decision-making\nprocess while generating the answer. Nevertheless, these methods induce\nadditional latency and have shown limitations in directly aligning token\ngeneration with attribution generation. In this paper, we introduce LoDIT, a\nmethod that jointly generates and faithfully attributes answers in RAG by\nleveraging specific token logits during generation. It consists of two steps:\n(1) marking the documents with specific token identifiers and then leveraging\nthe logits of these tokens to estimate the contribution of each document to the\nanswer during generation, and (2) aggregating these contributions into document\nattributions. Experiments on a trustworthiness-focused attributed\ntext-generation benchmark, Trust-Align, show that LoDIT significantly\noutperforms state-of-the-art models on several metrics. Finally, an in-depth\nanalysis of LoDIT shows both its efficiency in terms of latency and its\nrobustness in different settings."}
{"id": "2508.09001", "pdf": "https://arxiv.org/pdf/2508.09001.pdf", "abs": "https://arxiv.org/abs/2508.09001", "title": "Retrospective Sparse Attention for Efficient Long-Context Generation", "authors": ["Seonghwan Choi", "Beomseok Kang", "Dongwon Jo", "Jae-Joon Kim"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Large Language Models (LLMs) are increasingly deployed in long-context tasks\nsuch as reasoning, code generation, and multi-turn dialogue. However, inference\nover extended contexts is bottlenecked by the Key-Value (KV) cache, whose\nmemory footprint grows linearly with sequence length and dominates latency at\neach decoding step. While recent KV cache compression methods identify and load\nimportant tokens, they focus predominantly on input contexts and fail to\naddress the cumulative attention errors that arise during long decoding. In\nthis paper, we introduce RetroAttention, a novel KV cache update technique that\nretrospectively revises past attention outputs using newly arrived KV entries\nfrom subsequent decoding steps. By maintaining a lightweight output cache,\nRetroAttention enables past queries to efficiently access more relevant\ncontext, while incurring minimal latency overhead. This breaks the\nfixed-attention-output paradigm and allows continual correction of prior\napproximations. Extensive experiments on long-generation benchmarks show that\nRetroAttention consistently outperforms state-of-the-art (SOTA) KV compression\nmethods, increasing effective KV exposure by up to 1.6$\\times$ and accuracy by\nup to 21.9\\%."}
{"id": "2508.09012", "pdf": "https://arxiv.org/pdf/2508.09012.pdf", "abs": "https://arxiv.org/abs/2508.09012", "title": "LyS at SemEval 2025 Task 8: Zero-Shot Code Generation for Tabular QA", "authors": ["Adrián Gude", "Roi Santos-Ríos", "Francisco Prado-Valiño", "Ana Ezquerro", "Jesús Vilares"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Accepted to SemEval 2025. Camera-ready version", "summary": "This paper describes our participation in SemEval 2025 Task 8, focused on\nTabular Question Answering. We developed a zero-shot pipeline that leverages an\nLarge Language Model to generate functional code capable of extracting the\nrelevant information from tabular data based on an input question. Our approach\nconsists of a modular pipeline where the main code generator module is\nsupported by additional components that identify the most relevant columns and\nanalyze their data types to improve extraction accuracy. In the event that the\ngenerated code fails, an iterative refinement process is triggered,\nincorporating the error feedback into a new generation prompt to enhance\nrobustness. Our results show that zero-shot code generation is a valid approach\nfor Tabular QA, achieving rank 33 of 53 in the test phase despite the lack of\ntask-specific fine-tuning."}
{"id": "2508.09016", "pdf": "https://arxiv.org/pdf/2508.09016.pdf", "abs": "https://arxiv.org/abs/2508.09016", "title": "A Survey on Training-free Alignment of Large Language Models", "authors": ["Birong Pan", "Yongqi Li", "Weiyu Zhang", "Wenpeng Lu", "Mayi Xu", "Shen Zhou", "Yuanyuan Zhu", "Ming Zhong", "Tieyun Qian"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "The alignment of large language models (LLMs) aims to ensure their outputs\nadhere to human values, ethical standards, and legal norms. Traditional\nalignment methods often rely on resource-intensive fine-tuning (FT), which may\nsuffer from knowledge degradation and face challenges in scenarios where the\nmodel accessibility or computational resources are constrained. In contrast,\ntraining-free (TF) alignment techniques--leveraging in-context learning,\ndecoding-time adjustments, and post-generation corrections--offer a promising\nalternative by enabling alignment without heavily retraining LLMs, making them\nadaptable to both open-source and closed-source environments. This paper\npresents the first systematic review of TF alignment methods, categorizing them\nby stages of pre-decoding, in-decoding, and post-decoding. For each stage, we\nprovide a detailed examination from the viewpoint of LLMs and multimodal LLMs\n(MLLMs), highlighting their mechanisms and limitations. Furthermore, we\nidentify key challenges and future directions, paving the way for more\ninclusive and effective TF alignment techniques. By synthesizing and organizing\nthe rapidly growing body of research, this survey offers a guidance for\npractitioners and advances the development of safer and more reliable LLMs."}
{"id": "2508.09042", "pdf": "https://arxiv.org/pdf/2508.09042.pdf", "abs": "https://arxiv.org/abs/2508.09042", "title": "LLM-as-a-Supervisor: Mistaken Therapeutic Behaviors Trigger Targeted Supervisory Feedback", "authors": ["Chen Xu", "Zhenyu Lv", "Tian Lan", "Xianyang Wang", "Luyao Ji", "Leyang Cui", "Minqiang Yang", "Jian Shen", "Qunxi Dong", "Xiuling Liu", "Juan Wang", "Bin Hu"], "categories": ["cs.CL"], "comment": "9 pages, 5 figures", "summary": "Although large language models (LLMs) hold significant promise in\npsychotherapy, their direct application in patient-facing scenarios raises\nethical and safety concerns. Therefore, this work shifts towards developing an\nLLM as a supervisor to train real therapists. In addition to the privacy of\nclinical therapist training data, a fundamental contradiction complicates the\ntraining of therapeutic behaviors: clear feedback standards are necessary to\nensure a controlled training system, yet there is no absolute \"gold standard\"\nfor appropriate therapeutic behaviors in practice. In contrast, many common\ntherapeutic mistakes are universal and identifiable, making them effective\ntriggers for targeted feedback that can serve as clearer evidence. Motivated by\nthis, we create a novel therapist-training paradigm: (1) guidelines for\nmistaken behaviors and targeted correction strategies are first established as\nstandards; (2) a human-in-the-loop dialogue-feedback dataset is then\nconstructed, where a mistake-prone agent intentionally makes standard mistakes\nduring interviews naturally, and a supervisor agent locates and identifies\nmistakes and provides targeted feedback; (3) after fine-tuning on this dataset,\nthe final supervisor model is provided for real therapist training. The\ndetailed experimental results of automated, human and downstream assessments\ndemonstrate that models fine-tuned on our dataset MATE, can provide\nhigh-quality feedback according to the clinical guideline, showing significant\npotential for the therapist training scenario."}
{"id": "2508.09057", "pdf": "https://arxiv.org/pdf/2508.09057.pdf", "abs": "https://arxiv.org/abs/2508.09057", "title": "MVISU-Bench: Benchmarking Mobile Agents for Real-World Tasks by Multi-App, Vague, Interactive, Single-App and Unethical Instructions", "authors": ["Zeyu Huang", "Juyuan Wang", "Longfeng Chen", "Boyi Xiao", "Leng Cai", "Yawen Zeng", "Jin Xu"], "categories": ["cs.CL"], "comment": "ACM MM 2025", "summary": "Given the significant advances in Large Vision Language Models (LVLMs) in\nreasoning and visual understanding, mobile agents are rapidly emerging to meet\nusers' automation needs. However, existing evaluation benchmarks are\ndisconnected from the real world and fail to adequately address the diverse and\ncomplex requirements of users. From our extensive collection of user\nquestionnaire, we identified five tasks: Multi-App, Vague, Interactive,\nSingle-App, and Unethical Instructions. Around these tasks, we present\n\\textbf{MVISU-Bench}, a bilingual benchmark that includes 404 tasks across 137\nmobile applications. Furthermore, we propose Aider, a plug-and-play module that\nacts as a dynamic prompt prompter to mitigate risks and clarify user intent for\nmobile agents. Our Aider is easy to integrate into several frameworks and has\nsuccessfully improved overall success rates by 19.55\\% compared to the current\nstate-of-the-art (SOTA) on MVISU-Bench. Specifically, it achieves success rate\nimprovements of 53.52\\% and 29.41\\% for unethical and interactive instructions,\nrespectively. Through extensive experiments and analysis, we highlight the gap\nbetween existing mobile agents and real-world user expectations."}
{"id": "2508.09072", "pdf": "https://arxiv.org/pdf/2508.09072.pdf", "abs": "https://arxiv.org/abs/2508.09072", "title": "READER: Retrieval-Assisted Drafter for Efficient LLM Inference", "authors": ["Maxim Divilkovskiy", "Vitaly Malygin", "Sergey Zlobin", "Sultan Isali", "Vasily Kalugin", "Stanislav Ilyushin", "Nuriza Aitassova", "Yi Fei", "Zeng Weidi"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) generate tokens autoregressively, with each\ntoken depending on the preceding context. This sequential nature makes the\ninference process inherently difficult to accelerate, posing a significant\nchallenge for efficient deployment. In recent years, various methods have been\nproposed to address this issue, with the most effective approaches often\ninvolving the training of additional draft models. In this paper, we introduce\nREADER (Retrieval-Assisted Drafter for Efficient LLM Inference), a novel\nlossless speculative decoding method that enhances model-based approaches by\nleveraging self-repetitions in the text. Our algorithm expands the speculative\ndecoding tree using tokens obtained through statistical search. This work\nfocuses on large batch sizes (>= 8), an underexplored yet important area for\nindustrial applications. We also analyze the key-value (KV) cache size during\nspeculative decoding and propose an optimization to improve performance for\nlarge batches. As a result, READER outperforms existing speculative decoding\nmethods. Notably, READER requires no additional training and can reuse\npre-trained speculator models, increasing the speedup by over 40\\%. Our method\ndemonstrates particularly strong performance on search-based tasks, such as\nretrieval-augmented generation, where we achieve more than 10x speedup."}
{"id": "2508.09074", "pdf": "https://arxiv.org/pdf/2508.09074.pdf", "abs": "https://arxiv.org/abs/2508.09074", "title": "CPO: Addressing Reward Ambiguity in Role-playing Dialogue via Comparative Policy Optimization", "authors": ["Xinge Ye", "Rui Wang", "Yuchuan Wu", "Victor Ma", "Feiteng Fang", "Fei Huang", "Yongbin Li"], "categories": ["cs.CL"], "comment": null, "summary": "Reinforcement Learning Fine-Tuning (RLFT) has achieved notable success in\ntasks with objectively verifiable answers (e.g., code generation, mathematical\nreasoning), yet struggles with open-ended subjective tasks like role-playing\ndialogue. Traditional reward modeling approaches, which rely on independent\nsample-wise scoring, face dual challenges: subjective evaluation criteria and\nunstable reward signals.Motivated by the insight that human evaluation\ninherently combines explicit criteria with implicit comparative judgments, we\npropose Comparative Policy Optimization (CPO). CPO redefines the reward\nevaluation paradigm by shifting from sample-wise scoring to comparative\ngroup-wise scoring.Building on the same principle, we introduce the\nCharacterArena evaluation framework, which comprises two stages:(1)\nContextualized Multi-turn Role-playing Simulation, and (2) Trajectory-level\nComparative Evaluation. By operationalizing subjective scoring via objective\ntrajectory comparisons, CharacterArena minimizes contextual bias and enables\nmore robust and fair performance evaluation. Empirical results on\nCharacterEval, CharacterBench, and CharacterArena confirm that CPO effectively\nmitigates reward ambiguity and leads to substantial improvements in dialogue\nquality."}
{"id": "2508.09091", "pdf": "https://arxiv.org/pdf/2508.09091.pdf", "abs": "https://arxiv.org/abs/2508.09091", "title": "Utilizing Multilingual Encoders to Improve Large Language Models for Low-Resource Languages", "authors": ["Imalsha Puranegedara", "Themira Chathumina", "Nisal Ranathunga", "Nisansa de Silva", "Surangika Ranathunga", "Mokanarangan Thayaparan"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) excel in English, but their performance degrades\nsignificantly on low-resource languages (LRLs) due to English-centric training.\nWhile methods like LangBridge align LLMs with multilingual encoders such as the\nMassively Multilingual Text-to-Text Transfer Transformer (mT5), they typically\nuse only the final encoder layer. We propose a novel architecture that fuses\nall intermediate layers, enriching the linguistic information passed to the\nLLM. Our approach features two strategies: (1) a Global Softmax weighting for\noverall layer importance, and (2) a Transformer Softmax model that learns\ntoken-specific weights. The fused representations are mapped into the LLM's\nembedding space, enabling it to process multilingual inputs. The model is\ntrained only on English data, without using any parallel or multilingual data.\nEvaluated on XNLI, IndicXNLI, Sinhala News Classification, and Amazon Reviews,\nour Transformer Softmax model significantly outperforms the LangBridge\nbaseline. We observe strong performance gains in LRLs, improving Sinhala\nclassification accuracy from 71.66% to 75.86% and achieving clear improvements\nacross Indic languages such as Tamil, Bengali, and Malayalam. These specific\ngains contribute to an overall boost in average XNLI accuracy from 70.36% to\n71.50%. This approach offers a scalable, data-efficient path toward more\ncapable and equitable multilingual LLMs."}
{"id": "2508.09096", "pdf": "https://arxiv.org/pdf/2508.09096.pdf", "abs": "https://arxiv.org/abs/2508.09096", "title": "Link Prediction for Event Logs in the Process Industry", "authors": ["Anastasia Zhukova", "Thomas Walton", "Christian E. Matt", "Bela Gipp"], "categories": ["cs.CL", "cs.IR"], "comment": null, "summary": "Knowledge management (KM) is vital in the process industry for optimizing\noperations, ensuring safety, and enabling continuous improvement through\neffective use of operational data and past insights. A key challenge in this\ndomain is the fragmented nature of event logs in shift books, where related\nrecords, e.g., entries documenting issues related to equipment or processes and\nthe corresponding solutions, may remain disconnected. This fragmentation\nhinders the recommendation of previous solutions to the users. To address this\nproblem, we investigate record linking (RL) as link prediction, commonly\nstudied in graph-based machine learning, by framing it as a cross-document\ncoreference resolution (CDCR) task enhanced with natural language inference\n(NLI) and semantic text similarity (STS) by shifting it into the causal\ninference (CI). We adapt CDCR, traditionally applied in the news domain, into\nan RL model to operate at the passage level, similar to NLI and STS, while\naccommodating the process industry's specific text formats, which contain\nunstructured text and structured record attributes. Our RL model outperformed\nthe best versions of NLI- and STS-driven baselines by 28% (11.43 points) and\n27% (11.21 points), respectively. Our work demonstrates how domain adaptation\nof the state-of-the-art CDCR models, enhanced with reasoning capabilities, can\nbe effectively tailored to the process industry, improving data quality and\nconnectivity in shift logs."}
{"id": "2508.09101", "pdf": "https://arxiv.org/pdf/2508.09101.pdf", "abs": "https://arxiv.org/abs/2508.09101", "title": "AutoCodeBench: Large Language Models are Automatic Code Benchmark Generators", "authors": ["Jason Chou", "Ao Liu", "Yuchi Deng", "Zhiying Zeng", "Tao Zhang", "Haotian Zhu", "Jianwei Cai", "Yue Mao", "Chenchen Zhang", "Lingyun Tan", "Ziyan Xu", "Bohui Zhai", "Hengyi Liu", "Speed Zhu", "Wiggin Zhou", "Fengzong Lian"], "categories": ["cs.CL", "cs.SE"], "comment": "Homepage: https://autocodebench.github.io/", "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\nvarious domains, with code generation emerging as a key area of focus. While\nnumerous benchmarks have been proposed to evaluate their code generation\nabilities, these benchmarks face several critical limitations. First, they\noften rely on manual annotations, which are time-consuming and difficult to\nscale across different programming languages and problem complexities. Second,\nmost existing benchmarks focus primarily on Python, while the few multilingual\nbenchmarks suffer from limited difficulty and uneven language distribution. To\naddress these challenges, we propose AutoCodeGen, an automated method for\ngenerating high-difficulty multilingual code generation datasets without manual\nannotations. AutoCodeGen ensures the correctness and completeness of test cases\nby generating test inputs with LLMs and obtaining test outputs through a\nmultilingual sandbox, while achieving high data quality through reverse-order\nproblem generation and multiple filtering steps. Using this novel method, we\nintroduce AutoCodeBench, a large-scale code generation benchmark comprising\n3,920 problems evenly distributed across 20 programming languages. It is\nspecifically designed to evaluate LLMs on challenging, diverse, and practical\nmultilingual tasks. We evaluate over 30 leading open-source and proprietary\nLLMs on AutoCodeBench and its simplified version AutoCodeBench-Lite. The\nresults show that even the most advanced LLMs struggle with the complexity,\ndiversity, and multilingual nature of these tasks. Besides, we introduce\nAutoCodeBench-Complete, specifically designed for base models to assess their\nfew-shot code generation capabilities. We hope the AutoCodeBench series will\nserve as a valuable resource and inspire the community to focus on more\nchallenging and practical multilingual code generation scenarios."}
{"id": "2508.09115", "pdf": "https://arxiv.org/pdf/2508.09115.pdf", "abs": "https://arxiv.org/abs/2508.09115", "title": "SinLlama - A Large Language Model for Sinhala", "authors": ["H. W. K. Aravinda", "Rashad Sirajudeen", "Samith Karunathilake", "Nisansa de Silva", "Surangika Ranathunga", "Rishemjit Kaur"], "categories": ["cs.CL"], "comment": null, "summary": "Low-resource languages such as Sinhala are often overlooked by open-source\nLarge Language Models (LLMs). In this research, we extend an existing\nmultilingual LLM (Llama-3-8B) to better serve Sinhala. We enhance the LLM\ntokenizer with Sinhala specific vocabulary and perform continual pre-training\non a cleaned 10 million Sinhala corpus, resulting in the SinLlama model. This\nis the very first decoder-based open-source LLM with explicit Sinhala support.\nWhen SinLlama was instruction fine-tuned for three text classification tasks,\nit outperformed base and instruct variants of Llama-3-8B by a significant\nmargin."}
{"id": "2508.09124", "pdf": "https://arxiv.org/pdf/2508.09124.pdf", "abs": "https://arxiv.org/abs/2508.09124", "title": "OdysseyBench: Evaluating LLM Agents on Long-Horizon Complex Office Application Workflows", "authors": ["Weixuan Wang", "Dongge Han", "Daniel Madrigal Diaz", "Jin Xu", "Victor Rühle", "Saravan Rajmohan"], "categories": ["cs.CL"], "comment": null, "summary": "Autonomous agents powered by large language models (LLMs) are increasingly\ndeployed in real-world applications requiring complex, long-horizon workflows.\nHowever, existing benchmarks predominantly focus on atomic tasks that are\nself-contained and independent, failing to capture the long-term contextual\ndependencies and multi-interaction coordination required in realistic\nscenarios. To address this gap, we introduce OdysseyBench, a comprehensive\nbenchmark for evaluating LLM agents on long-horizon workflows across diverse\noffice applications including Word, Excel, PDF, Email, and Calendar. Our\nbenchmark comprises two complementary splits: OdysseyBench+ with 300 tasks\nderived from real-world use cases, and OdysseyBench-Neo with 302 newly\nsynthesized complex tasks. Each task requires agent to identify essential\ninformation from long-horizon interaction histories and perform multi-step\nreasoning across various applications. To enable scalable benchmark creation,\nwe propose HomerAgents, a multi-agent framework that automates the generation\nof long-horizon workflow benchmarks through systematic environment exploration,\ntask generation, and dialogue synthesis. Our extensive evaluation demonstrates\nthat OdysseyBench effectively challenges state-of-the-art LLM agents, providing\nmore accurate assessment of their capabilities in complex, real-world contexts\ncompared to existing atomic task benchmarks. We believe that OdysseyBench will\nserve as a valuable resource for advancing the development and evaluation of\nLLM agents in real-world productivity scenarios. In addition, we release\nOdysseyBench and HomerAgents to foster research along this line."}
{"id": "2508.09125", "pdf": "https://arxiv.org/pdf/2508.09125.pdf", "abs": "https://arxiv.org/abs/2508.09125", "title": "Complex Logical Instruction Generation", "authors": ["Mian Zhang", "Shujian Liu", "Sixun Dong", "Ming Yin", "Yebowen Hu", "Xun Wang", "Steven Ma", "Song Wang", "Sathish Reddy Indurthi", "Haoyun Deng", "Zhiyu Zoey Chen", "Kaiqiang Song"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Instruction following has catalyzed the recent era of Large Language Models\n(LLMs) and is the foundational skill underpinning more advanced capabilities\nsuch as reasoning and agentic behaviors. As tasks grow more challenging, the\nlogic structures embedded in natural language instructions becomes increasingly\nintricate. However, how well LLMs perform on such logic-rich instructions\nremains under-explored. We propose LogicIFGen and LogicIFEval. LogicIFGen is a\nscalable, automated framework for generating verifiable instructions from code\nfunctions, which can naturally express rich logic such as conditionals,\nnesting, recursion, and function calls. We further curate a collection of\ncomplex code functions and use LogicIFGen to construct LogicIFEval, a benchmark\ncomprising 426 verifiable logic-rich instructions. Our experiments demonstrate\nthat current state-of-the-art LLMs still struggle to correctly follow the\ninstructions in LogicIFEval. Most LLMs can only follow fewer than 60% of the\ninstructions, revealing significant deficiencies in the instruction-following\nability. Code and Benchmark: https://github.com/mianzhang/LogicIF"}
{"id": "2508.09138", "pdf": "https://arxiv.org/pdf/2508.09138.pdf", "abs": "https://arxiv.org/abs/2508.09138", "title": "Time Is a Feature: Exploiting Temporal Dynamics in Diffusion Language Models", "authors": ["Wen Wang", "Bozhen Fang", "Chenchen Jing", "Yongliang Shen", "Yangyi Shen", "Qiuyu Wang", "Hao Ouyang", "Hao Chen", "Chunhua Shen"], "categories": ["cs.CL", "cs.AI"], "comment": "Project webpage: https://aim-uofa.github.io/dLLM-MidTruth", "summary": "Diffusion large language models (dLLMs) generate text through iterative\ndenoising, yet current decoding strategies discard rich intermediate\npredictions in favor of the final output. Our work here reveals a critical\nphenomenon, temporal oscillation, where correct answers often emerge in the\nmiddle process, but are overwritten in later denoising steps. To address this\nissue, we introduce two complementary methods that exploit temporal\nconsistency: 1) Temporal Self-Consistency Voting, a training-free, test-time\ndecoding strategy that aggregates predictions across denoising steps to select\nthe most consistent output; and 2) a post-training method termed Temporal\nConsistency Reinforcement, which uses Temporal Semantic Entropy (TSE), a\nmeasure of semantic stability across intermediate predictions, as a reward\nsignal to encourage stable generations. Empirical results across multiple\nbenchmarks demonstrate the effectiveness of our approach. Using the negative\nTSE reward alone, we observe a remarkable average improvement of 24.7% on the\nCountdown dataset over an existing dLLM. Combined with the accuracy reward, we\nachieve absolute gains of 2.0% on GSM8K, 4.3% on MATH500, 6.6% on SVAMP, and\n25.3% on Countdown, respectively. Our findings underscore the untapped\npotential of temporal dynamics in dLLMs and offer two simple yet effective\ntools to harness them."}
{"id": "2508.08266", "pdf": "https://arxiv.org/pdf/2508.08266.pdf", "abs": "https://arxiv.org/abs/2508.08266", "title": "Benchmarking Large Language Models for Geolocating Colonial Virginia Land Grants", "authors": ["Ryan Mioduski"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.CV", "cs.IR"], "comment": null, "summary": "Virginia's seventeenth- and eighteenth-century land patents survive primarily\nas narrative metes-and-bounds descriptions, limiting spatial analysis. This\nstudy systematically evaluates current-generation large language models (LLMs)\nin converting these prose abstracts into geographically accurate\nlatitude/longitude coordinates within a focused evaluation context. A digitized\ncorpus of 5,471 Virginia patent abstracts (1695-1732) is released, with 43\nrigorously verified test cases serving as an initial, geographically focused\nbenchmark. Six OpenAI models across three architectures (o-series, GPT-4-class,\nand GPT-3.5) were tested under two paradigms: direct-to-coordinate and\ntool-augmented chain-of-thought invoking external geocoding APIs. Results were\ncompared with a GIS-analyst baseline, the Stanford NER geoparser, Mordecai-3,\nand a county-centroid heuristic.\n  The top single-call model, o3-2025-04-16, achieved a mean error of 23 km\n(median 14 km), outperforming the median LLM (37.4 km) by 37.5%, the weakest\nLLM (50.3 km) by 53.5%, and external baselines by 67% (GIS analyst) and 70%\n(Stanford NER). A five-call ensemble further reduced errors to 19 km (median 12\nkm) at minimal additional cost (approx. USD 0.20 per grant), outperforming the\nmedian LLM by 48.6%. A patentee-name-redaction ablation increased error by\nabout 9%, indicating reliance on textual landmark and adjacency descriptions\nrather than memorization. The cost-efficient gpt-4o-2024-08-06 model maintained\na 28 km mean error at USD 1.09 per 1,000 grants, establishing a strong\ncost-accuracy benchmark; external geocoding tools offered no measurable benefit\nin this evaluation.\n  These findings demonstrate the potential of LLMs for scalable, accurate, and\ncost-effective historical georeferencing."}
{"id": "2508.08270", "pdf": "https://arxiv.org/pdf/2508.08270.pdf", "abs": "https://arxiv.org/abs/2508.08270", "title": "Doctor Sun: A Bilingual Multimodal Large Language Model for Biomedical AI", "authors": ["Dong Xue", "Ziyao Shao", "Zhaoyang Duan", "Fangzhou Liu", "Bing Li", "Zhongheng Zhang"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.MM"], "comment": null, "summary": "Large multimodal models (LMMs) have demonstrated significant potential in\nproviding innovative solutions for various biomedical tasks, including\npathology analysis, radiology report generation, and biomedical assistance.\nHowever, the existing multimodal biomedical AI is typically based on foundation\nLLMs, thus hindering the understanding of intricate medical concepts with\nlimited medical training data. Moreover, recent LLaVA-induced medical LMMs\nstruggle to effectively capture the intricate relationship between the texts\nand the images. Therefore, we introduce Doctor Sun, a large multimodal\ngenerative model specialized in medicine, developed to encode, integrate, and\ninterpret diverse biomedical data modalities such as text and images. In\nparticular, Doctor Sun integrates a pre-trained vision encoder with a medical\nLLM and conducts two-stage training on various medical datasets, focusing on\nfeature alignment and instruction tuning. Moreover, we release SunMed-VL, a\nwide-range bilingual medical multimodal dataset, along with all associated\nmodels, code, and resources, to freely support the advancement of biomedical\nmultimodal research."}
{"id": "2508.08343", "pdf": "https://arxiv.org/pdf/2508.08343.pdf", "abs": "https://arxiv.org/abs/2508.08343", "title": "Maximizing GPU Efficiency via Optimal Adapter Caching: An Analytical Approach for Multi-Tenant LLM Serving", "authors": ["Ferran Agullo", "Joan Oliveras", "Chen Wang", "Alberto Gutierrez-Torre", "Olivier Tardieu", "Alaa Youssef", "Jordi Torres", "Josep Ll. Berral"], "categories": ["cs.PF", "cs.AI", "cs.CL"], "comment": "Under review for a computer science conference", "summary": "Serving LLM adapters has gained significant attention as an effective\napproach to adapt general-purpose language models to diverse, task-specific use\ncases. However, serving a wide range of adapters introduces several and\nsubstantial overheads, leading to performance degradation and challenges in\noptimal placement. To address these challenges, we present an analytical,\nAI-driven pipeline that accurately determines the optimal allocation of\nadapters in single-node setups. This allocation maximizes performance,\neffectively using GPU resources, while preventing request starvation.\nCrucially, the proposed allocation is given based on current workload patterns.\nThese insights in single-node setups can be leveraged in multi-replica\ndeployments for overall placement, load balancing and server configuration,\nultimately enhancing overall performance and improving resource efficiency. Our\napproach builds on an in-depth analysis of LLM adapter serving, accounting for\noverheads and performance variability, and includes the development of the\nfirst Digital Twin capable of replicating online LLM-adapter serving systems\nwith matching key performance metrics. The experimental results demonstrate\nthat the Digital Twin achieves a SMAPE difference of no more than 5.5% in\nthroughput compared to real results, and the proposed pipeline accurately\npredicts the optimal placement with minimal latency."}
{"id": "2508.08347", "pdf": "https://arxiv.org/pdf/2508.08347.pdf", "abs": "https://arxiv.org/abs/2508.08347", "title": "Exploring the Technical Knowledge Interaction of Global Digital Humanities: Three-decade Evidence from Bibliometric-based perspectives", "authors": ["Jiayi Li", "Chengxi Yan", "Yurong Zeng", "Zhichao Fang", "Huiru Wang"], "categories": ["cs.DL", "cs.CL"], "comment": null, "summary": "Digital Humanities (DH) is an interdisciplinary field that integrates\ncomputational methods with humanities scholarship to investigate innovative\ntopics. Each academic discipline follows a unique developmental path shaped by\nthe topics researchers investigate and the methods they employ. With the help\nof bibliometric analysis, most of previous studies have examined DH across\nmultiple dimensions such as research hotspots, co-author networks, and\ninstitutional rankings. However, these studies have often been limited in their\nability to provide deep insights into the current state of technological\nadvancements and topic development in DH. As a result, their conclusions tend\nto remain superficial or lack interpretability in understanding how methods and\ntopics interrelate in the field. To address this gap, this study introduced a\nnew concept of Topic-Method Composition (TMC), which refers to a hybrid\nknowledge structure generated by the co-occurrence of specific research topics\nand the corresponding method. Especially by analyzing the interaction between\nTMCs, we can see more clearly the intersection and integration of digital\ntechnology and humanistic subjects in DH. Moreover, this study developed a\nTMC-based workflow combining bibliometric analysis, topic modeling, and network\nanalysis to analyze the development characteristics and patterns of research\ndisciplines. By applying this workflow to large-scale bibliometric data, it\nenables a detailed view of the knowledge structures, providing a tool adaptable\nto other fields."}
{"id": "2508.08385", "pdf": "https://arxiv.org/pdf/2508.08385.pdf", "abs": "https://arxiv.org/abs/2508.08385", "title": "Bilevel MCTS for Amortized O(1) Node Selection in Classical Planning", "authors": ["Masataro Asai"], "categories": ["cs.AI", "cs.CL"], "comment": null, "summary": "We study an efficient implementation of Multi-Armed Bandit (MAB)-based\nMonte-Carlo Tree Search (MCTS) for classical planning. One weakness of MCTS is\nthat it spends a significant time deciding which node to expand next. While\nselecting a node from an OPEN list with $N$ nodes has $O(1)$ runtime complexity\nwith traditional array-based priority-queues for dense integer keys, the\ntree-based OPEN list used by MCTS requires $O(\\log N)$, which roughly\ncorresponds to the search depth $d$. In classical planning, $d$ is arbitrarily\nlarge (e.g., $2^k-1$ in $k$-disk Tower-of-Hanoi) and the runtime for node\nselection is significant, unlike in game tree search, where the cost is\nnegligible compared to the node evaluation (rollouts) because $d$ is inherently\nlimited by the game (e.g., $d\\leq 361$ in Go). To improve this bottleneck, we\npropose a bilevel modification to MCTS that runs a best-first search from each\nselected leaf node with an expansion budget proportional to $d$, which achieves\namortized $O(1)$ runtime for node selection, equivalent to the traditional\nqueue-based OPEN list. In addition, we introduce Tree Collapsing, an\nenhancement that reduces action selection steps and further improves the\nperformance."}
{"id": "2508.08508", "pdf": "https://arxiv.org/pdf/2508.08508.pdf", "abs": "https://arxiv.org/abs/2508.08508", "title": "Re:Verse -- Can Your VLM Read a Manga?", "authors": ["Aaditya Baranwal", "Madhav Kataria", "Naitik Agrawal", "Yogesh S Rawat", "Shruti Vyas"], "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Current Vision Language Models (VLMs) demonstrate a critical gap between\nsurface-level recognition and deep narrative reasoning when processing\nsequential visual storytelling. Through a comprehensive investigation of manga\nnarrative understanding, we reveal that while recent large multimodal models\nexcel at individual panel interpretation, they systematically fail at temporal\ncausality and cross-panel cohesion, core requirements for coherent story\ncomprehension. We introduce a novel evaluation framework that combines\nfine-grained multimodal annotation, cross-modal embedding analysis, and\nretrieval-augmented assessment to systematically characterize these\nlimitations.\n  Our methodology includes (i) a rigorous annotation protocol linking visual\nelements to narrative structure through aligned light novel text, (ii)\ncomprehensive evaluation across multiple reasoning paradigms, including direct\ninference and retrieval-augmented generation, and (iii) cross-modal similarity\nanalysis revealing fundamental misalignments in current VLMs' joint\nrepresentations. Applying this framework to Re:Zero manga across 11 chapters\nwith 308 annotated panels, we conduct the first systematic study of long-form\nnarrative understanding in VLMs through three core evaluation axes: generative\nstorytelling, contextual dialogue grounding, and temporal reasoning. Our\nfindings demonstrate that current models lack genuine story-level intelligence,\nstruggling particularly with non-linear narratives, character consistency, and\ncausal inference across extended sequences. This work establishes both the\nfoundation and practical methodology for evaluating narrative intelligence,\nwhile providing actionable insights into the capability of deep sequential\nunderstanding of Discrete Visual Narratives beyond basic recognition in\nMultimodal Models."}
{"id": "2508.08550", "pdf": "https://arxiv.org/pdf/2508.08550.pdf", "abs": "https://arxiv.org/abs/2508.08550", "title": "Fine-grained Video Dubbing Duration Alignment with Segment Supervised Preference Optimization", "authors": ["Chaoqun Cui", "Liangbin Huang", "Shijing Wang", "Zhe Tong", "Zhaolong Huang", "Xiao Zeng", "Xiaofeng Liu"], "categories": ["cs.SD", "cs.CL"], "comment": "This paper is accepted by ACL2025 (Main)", "summary": "Video dubbing aims to translate original speech in visual media programs from\nthe source language to the target language, relying on neural machine\ntranslation and text-to-speech technologies. Due to varying information\ndensities across languages, target speech often mismatches the source speech\nduration, causing audio-video synchronization issues that significantly impact\nviewer experience. In this study, we approach duration alignment in LLM-based\nvideo dubbing machine translation as a preference optimization problem. We\npropose the Segment Supervised Preference Optimization (SSPO) method, which\nemploys a segment-wise sampling strategy and fine-grained loss to mitigate\nduration mismatches between source and target lines. Experimental results\ndemonstrate that SSPO achieves superior performance in duration alignment\ntasks."}
{"id": "2508.08634", "pdf": "https://arxiv.org/pdf/2508.08634.pdf", "abs": "https://arxiv.org/abs/2508.08634", "title": "Adaptive Personalized Conversational Information Retrieval", "authors": ["Fengran Mo", "Yuchen Hui", "Yuxing Tian", "Zhaoxuan Tan", "Chuan Meng", "Zhan Su", "Kaiyu Huang", "Jian-Yun Nie"], "categories": ["cs.IR", "cs.CL"], "comment": "Accepted by CIKM 2025", "summary": "Personalized conversational information retrieval (CIR) systems aim to\nsatisfy users' complex information needs through multi-turn interactions by\nconsidering user profiles. However, not all search queries require\npersonalization. The challenge lies in appropriately incorporating\npersonalization elements into search when needed. Most existing studies\nimplicitly incorporate users' personal information and conversational context\nusing large language models without distinguishing the specific requirements\nfor each query turn. Such a ``one-size-fits-all'' personalization strategy\nmight lead to sub-optimal results. In this paper, we propose an adaptive\npersonalization method, in which we first identify the required personalization\nlevel for a query and integrate personalized queries with other query\nreformulations to produce various enhanced queries. Then, we design a\npersonalization-aware ranking fusion approach to assign fusion weights\ndynamically to different reformulated queries, depending on the required\npersonalization level. The proposed adaptive personalized conversational\ninformation retrieval framework APCIR is evaluated on two TREC iKAT datasets.\nThe results confirm the effectiveness of adaptive personalization of APCIR by\noutperforming state-of-the-art methods."}
{"id": "2508.08641", "pdf": "https://arxiv.org/pdf/2508.08641.pdf", "abs": "https://arxiv.org/abs/2508.08641", "title": "MiGrATe: Mixed-Policy GRPO for Adaptation at Test-Time", "authors": ["Peter Phan", "Dhruv Agarwal", "Kavitha Srinivas", "Horst Samulowitz", "Pavan Kapanipathi", "Andrew McCallum"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "Large language models (LLMs) are increasingly being applied to black-box\noptimization tasks, from program synthesis to molecule design. Prior work\ntypically leverages in-context learning to iteratively guide the model towards\nbetter solutions. Such methods, however, often struggle to balance exploration\nof new solution spaces with exploitation of high-reward ones. Recently,\ntest-time training (TTT) with synthetic data has shown promise in improving\nsolution quality. However, the need for hand-crafted training data tailored to\neach task limits feasibility and scalability across domains. To address this\nproblem, we introduce MiGrATe-a method for online TTT that uses GRPO as a\nsearch algorithm to adapt LLMs at inference without requiring external training\ndata. MiGrATe operates via a mixed-policy group construction procedure that\ncombines on-policy sampling with two off-policy data selection techniques:\ngreedy sampling, which selects top-performing past completions, and\nneighborhood sampling (NS), which generates completions structurally similar to\nhigh-reward ones. Together, these components bias the policy gradient towards\nexploitation of promising regions in solution space, while preserving\nexploration through on-policy sampling. We evaluate MiGrATe on three\nchallenging domains-word search, molecule optimization, and hypothesis+program\ninduction on the Abstraction and Reasoning Corpus (ARC)-and find that it\nconsistently outperforms both inference-only and TTT baselines, demonstrating\nthe potential of online TTT as a solution for complex search tasks without\nexternal supervision."}
{"id": "2508.08657", "pdf": "https://arxiv.org/pdf/2508.08657.pdf", "abs": "https://arxiv.org/abs/2508.08657", "title": "$\\text{M}^{2}$LLM: Multi-view Molecular Representation Learning with Large Language Models", "authors": ["Jiaxin Ju", "Yizhen Zheng", "Huan Yee Koh", "Can Wang", "Shirui Pan"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "IJCAI 2025", "summary": "Accurate molecular property prediction is a critical challenge with\nwide-ranging applications in chemistry, materials science, and drug discovery.\nMolecular representation methods, including fingerprints and graph neural\nnetworks (GNNs), achieve state-of-the-art results by effectively deriving\nfeatures from molecular structures. However, these methods often overlook\ndecades of accumulated semantic and contextual knowledge. Recent advancements\nin large language models (LLMs) demonstrate remarkable reasoning abilities and\nprior knowledge across scientific domains, leading us to hypothesize that LLMs\ncan generate rich molecular representations when guided to reason in multiple\nperspectives. To address these gaps, we propose $\\text{M}^{2}$LLM, a multi-view\nframework that integrates three perspectives: the molecular structure view, the\nmolecular task view, and the molecular rules view. These views are fused\ndynamically to adapt to task requirements, and experiments demonstrate that\n$\\text{M}^{2}$LLM achieves state-of-the-art performance on multiple benchmarks\nacross classification and regression tasks. Moreover, we demonstrate that\nrepresentation derived from LLM achieves exceptional performance by leveraging\ntwo core functionalities: the generation of molecular embeddings through their\nencoding capabilities and the curation of molecular features through advanced\nreasoning processes."}
{"id": "2508.08715", "pdf": "https://arxiv.org/pdf/2508.08715.pdf", "abs": "https://arxiv.org/abs/2508.08715", "title": "MultiAiTutor: Child-Friendly Educational Multilingual Speech Generation Tutor with LLMs", "authors": ["Xiaoxue Gao", "Huayun Zhang", "Nancy F. Chen"], "categories": ["eess.AS", "cs.AI", "cs.CL", "eess.SP"], "comment": "5 figures", "summary": "Generative speech models have demonstrated significant potential in\npersonalizing teacher-student interactions, offering valuable real-world\napplications for language learning in children's education. However, achieving\nhigh-quality, child-friendly speech generation remains challenging,\nparticularly for low-resource languages across diverse languages and cultural\ncontexts. In this paper, we propose MultiAiTutor, an educational multilingual\ngenerative AI tutor with child-friendly designs, leveraging LLM architecture\nfor speech generation tailored for educational purposes. We propose to\nintegrate age-appropriate multilingual speech generation using LLM\narchitectures, facilitating young children's language learning through\nculturally relevant image-description tasks in three low-resource languages:\nSingaporean-accent Mandarin, Malay, and Tamil. Experimental results from both\nobjective metrics and subjective evaluations demonstrate the superior\nperformance of the proposed MultiAiTutor compared to baseline methods."}
{"id": "2508.08774", "pdf": "https://arxiv.org/pdf/2508.08774.pdf", "abs": "https://arxiv.org/abs/2508.08774", "title": "Designing Memory-Augmented AR Agents for Spatiotemporal Reasoning in Personalized Task Assistance", "authors": ["Dongwook Choi", "Taeyoon Kwon", "Dongil Yang", "Hyojun Kim", "Jinyoung Yeo"], "categories": ["cs.AI", "cs.CL"], "comment": "7 pages, 2 figures", "summary": "Augmented Reality (AR) systems are increasingly integrating foundation\nmodels, such as Multimodal Large Language Models (MLLMs), to provide more\ncontext-aware and adaptive user experiences. This integration has led to the\ndevelopment of AR agents to support intelligent, goal-directed interactions in\nreal-world environments. While current AR agents effectively support immediate\ntasks, they struggle with complex multi-step scenarios that require\nunderstanding and leveraging user's long-term experiences and preferences. This\nlimitation stems from their inability to capture, retain, and reason over\nhistorical user interactions in spatiotemporal contexts. To address these\nchallenges, we propose a conceptual framework for memory-augmented AR agents\nthat can provide personalized task assistance by learning from and adapting to\nuser-specific experiences over time. Our framework consists of four\ninterconnected modules: (1) Perception Module for multimodal sensor processing,\n(2) Memory Module for persistent spatiotemporal experience storage, (3)\nSpatiotemporal Reasoning Module for synthesizing past and present contexts, and\n(4) Actuator Module for effective AR communication. We further present an\nimplementation roadmap, a future evaluation strategy, a potential target\napplication and use cases to demonstrate the practical applicability of our\nframework across diverse domains. We aim for this work to motivate future\nresearch toward developing more intelligent AR systems that can effectively\nbridge user's interaction history with adaptive, context-aware task assistance."}
{"id": "2508.08795", "pdf": "https://arxiv.org/pdf/2508.08795.pdf", "abs": "https://arxiv.org/abs/2508.08795", "title": "A Dual-Axis Taxonomy of Knowledge Editing for LLMs: From Mechanisms to Functions", "authors": ["Amir Mohammad Salehoof", "Ali Ramezani", "Yadollah Yaghoobzadeh", "Majid Nili Ahmadabadi"], "categories": ["cs.AI", "cs.CL"], "comment": "13 pages, 1 figure", "summary": "Large language models (LLMs) acquire vast knowledge from large text corpora,\nbut this information can become outdated or inaccurate. Since retraining is\ncomputationally expensive, knowledge editing offers an efficient alternative --\nmodifying internal knowledge without full retraining. These methods aim to\nupdate facts precisely while preserving the model's overall capabilities. While\nexisting surveys focus on the mechanism of editing (e.g., parameter changes vs.\nexternal memory), they often overlook the function of the knowledge being\nedited. This survey introduces a novel, complementary function-based taxonomy\nto provide a more holistic view. We examine how different mechanisms apply to\nvarious knowledge types -- factual, temporal, conceptual, commonsense, and\nsocial -- highlighting how editing effectiveness depends on the nature of the\ntarget knowledge. By organizing our review along these two axes, we map the\ncurrent landscape, outline the strengths and limitations of existing methods,\ndefine the problem formally, survey evaluation tasks and datasets, and conclude\nwith open challenges and future directions."}
{"id": "2508.08967", "pdf": "https://arxiv.org/pdf/2508.08967.pdf", "abs": "https://arxiv.org/abs/2508.08967", "title": "Revealing the Role of Audio Channels in ASR Performance Degradation", "authors": ["Kuan-Tang Huang", "Li-Wei Chen", "Hung-Shin Lee", "Berlin Chen", "Hsin-Min Wang"], "categories": ["cs.SD", "cs.AI", "cs.CL"], "comment": "Accepted to IEEE ASRU 2025", "summary": "Pre-trained automatic speech recognition (ASR) models have demonstrated\nstrong performance on a variety of tasks. However, their performance can\ndegrade substantially when the input audio comes from different recording\nchannels. While previous studies have demonstrated this phenomenon, it is often\nattributed to the mismatch between training and testing corpora. This study\nargues that variations in speech characteristics caused by different recording\nchannels can fundamentally harm ASR performance. To address this limitation, we\npropose a normalization technique designed to mitigate the impact of channel\nvariation by aligning internal feature representations in the ASR model with\nthose derived from a clean reference channel. This approach significantly\nimproves ASR performance on previously unseen channels and languages,\nhighlighting its ability to generalize across channel and language differences."}
{"id": "2508.09023", "pdf": "https://arxiv.org/pdf/2508.09023.pdf", "abs": "https://arxiv.org/abs/2508.09023", "title": "E3-Rewrite: Learning to Rewrite SQL for Executability, Equivalence,and Efficiency", "authors": ["Dongjie Xu", "Yue Cui", "Weijie Shi", "Qingzhi Ma", "Hanghui Guo", "Jiaming Li", "Yao Zhao", "Ruiyuan Zhang", "Shimin Di", "Jia Zhu", "Kai Zheng", "Jiajie Xu"], "categories": ["cs.DB", "cs.AI", "cs.CL"], "comment": null, "summary": "SQL query rewriting aims to reformulate a query into a more efficient form\nwhile preserving equivalence. Most existing methods rely on predefined rewrite\nrules. However, such rule-based approaches face fundamental limitations: (1)\nfixed rule sets generalize poorly to novel query patterns and struggle with\ncomplex queries; (2) a wide range of effective rewriting strategies cannot be\nfully captured by declarative rules. To overcome these issues, we propose using\nlarge language models (LLMs) to generate rewrites. LLMs can capture complex\nstrategies, such as evaluation reordering and CTE rewriting. Despite this\npotential, directly applying LLMs often results in suboptimal or non-equivalent\nrewrites due to a lack of execution awareness and semantic grounding. To\naddress these challenges, We present E3-Rewrite, an LLM-based SQL rewriting\nframework that produces executable, equivalent, and efficient queries. It\nintegrates two core components: a context construction module and a\nreinforcement learning framework. First, the context module leverages execution\nplans and retrieved demonstrations to build bottleneck-aware prompts that guide\ninference-time rewriting. Second, we design a reward function targeting\nexecutability, equivalence, and efficiency, evaluated via syntax checks,\nequivalence verification, and cost estimation. Third, to ensure stable\nmulti-objective learning, we adopt a staged curriculum that first emphasizes\nexecutability and equivalence, then gradually incorporates efficiency.\nExtensive experiments show that E3-Rewrite achieves up to a 25.6\\% reduction in\nquery execution time compared to state-of-the-art methods across multiple SQL\nbenchmarks. Moreover, it delivers up to 24.4\\% more successful rewrites,\nexpanding coverage to complex queries that previous systems failed to handle."}
{"id": "2508.09035", "pdf": "https://arxiv.org/pdf/2508.09035.pdf", "abs": "https://arxiv.org/abs/2508.09035", "title": "P/D-Device: Disaggregated Large Language Model between Cloud and Devices", "authors": ["Yibo Jin", "Yixu Xu", "Yue Chen", "Chengbin Wang", "Tao Wang", "Jiaqi Huang", "Rongfei Zhang", "Yiming Dong", "Yuting Yan", "Ke Cheng", "Yingjie Zhu", "Shulan Wang", "Qianqian Tang", "Shuaishuai Meng", "Guanxin Cheng", "Ze Wang", "Shuyan Miao", "Ketao Wang", "Wen Liu", "Yifan Yang", "Tong Zhang", "Anran Wang", "Chengzhou Lu", "Tiantian Dong", "Yongsheng Zhang", "Zhe Wang", "Hefei Guo", "Hongjie Liu", "Wei Lu", "Zhengyong Zhang"], "categories": ["cs.DC", "cs.CL", "cs.LG"], "comment": null, "summary": "Serving disaggregated large language models has been widely adopted in\nindustrial practice for enhanced performance. However, too many tokens\ngenerated in decoding phase, i.e., occupying the resources for a long time,\nessentially hamper the cloud from achieving a higher throughput. Meanwhile, due\nto limited on-device resources, the time to first token (TTFT), i.e., the\nlatency of prefill phase, increases dramatically with the growth on prompt\nlength. In order to concur with such a bottleneck on resources, i.e., long\noccupation in cloud and limited on-device computing capacity, we propose to\nseparate large language model between cloud and devices. That is, the cloud\nhelps a portion of the content for each device, only in its prefill phase.\nSpecifically, after receiving the first token from the cloud, decoupling with\nits own prefill, the device responds to the user immediately for a lower TTFT.\nThen, the following tokens from cloud are presented via a speed controller for\nsmoothed TPOT (the time per output token), until the device catches up with the\nprogress. On-device prefill is then amortized using received tokens while the\nresource usage in cloud is controlled. Moreover, during cloud prefill, the\nprompt can be refined, using those intermediate data already generated, to\nfurther speed up on-device inference. We implement such a scheme P/D-Device,\nand confirm its superiority over other alternatives. We further propose an\nalgorithm to decide the best settings. Real-trace experiments show that TTFT\ndecreases at least 60%, maximum TPOT is about tens of milliseconds, and cloud\nthroughput increases by up to 15x."}
{"id": "2112.12014", "pdf": "https://arxiv.org/pdf/2112.12014.pdf", "abs": "https://arxiv.org/abs/2112.12014", "title": "Quantifying Gender Biases Towards Politicians on Reddit", "authors": ["Sara Marjanovic", "Karolina Stańczak", "Isabelle Augenstein"], "categories": ["cs.CL", "cs.CY"], "comment": "PlosONE article", "summary": "Despite attempts to increase gender parity in politics, global efforts have\nstruggled to ensure equal female representation. This is likely tied to\nimplicit gender biases against women in authority. In this work, we present a\ncomprehensive study of gender biases that appear in online political\ndiscussion. To this end, we collect 10 million comments on Reddit in\nconversations about male and female politicians, which enables an exhaustive\nstudy of automatic gender bias detection. We address not only misogynistic\nlanguage, but also other manifestations of bias, like benevolent sexism in the\nform of seemingly positive sentiment and dominance attributed to female\npoliticians, or differences in descriptor attribution. Finally, we conduct a\nmulti-faceted study of gender bias towards politicians investigating both\nlinguistic and extra-linguistic cues. We assess 5 different types of gender\nbias, evaluating coverage, combinatorial, nominal, sentimental, and lexical\nbiases extant in social media language and discourse. Overall, we find that,\ncontrary to previous research, coverage and sentiment biases suggest equal\npublic interest in female politicians. Rather than overt hostile or benevolent\nsexism, the results of the nominal and lexical analyses suggest this interest\nis not as professional or respectful as that expressed about male politicians.\nFemale politicians are often named by their first names and are described in\nrelation to their body, clothing, or family; this is a treatment that is not\nsimilarly extended to men. On the now banned far-right subreddits, this\ndisparity is greatest, though differences in gender biases still appear in the\nright and left-leaning subreddits. We release the curated dataset to the public\nfor future studies."}
{"id": "2404.18043", "pdf": "https://arxiv.org/pdf/2404.18043.pdf", "abs": "https://arxiv.org/abs/2404.18043", "title": "Utilizing Large Language Models for Information Extraction from Real Estate Transactions", "authors": ["Yu Zhao", "Haoxiang Gao", "Jinghan Cao", "Shiqi Yang"], "categories": ["cs.CL", "cs.IR", "cs.LG"], "comment": null, "summary": "Real estate sales contracts contain crucial information for property\ntransactions, but manual data extraction can be time-consuming and error-prone.\nThis paper explores the application of large language models, specifically\ntransformer-based architectures, for automated information extraction from real\nestate contracts. We discuss challenges, techniques, and future directions in\nleveraging these models to improve efficiency and accuracy in real estate\ncontract analysis. We generated synthetic contracts using the real-world\ntransaction dataset, thereby fine-tuning the large-language model and achieving\nsignificant metrics improvements and qualitative improvements in information\nretrieval and reasoning tasks."}
{"id": "2410.06795", "pdf": "https://arxiv.org/pdf/2410.06795.pdf", "abs": "https://arxiv.org/abs/2410.06795", "title": "From Pixels to Tokens: Revisiting Object Hallucinations in Large Vision-Language Models", "authors": ["Yuying Shang", "Xinyi Zeng", "Yutao Zhu", "Xiao Yang", "Zhengwei Fang", "Jingyuan Zhang", "Jiawei Chen", "Zinan Liu", "Yu Tian"], "categories": ["cs.CL", "cs.CV"], "comment": null, "summary": "Hallucinations in large vision-language models (LVLMs) are a significant\nchallenge, i.e., generating objects that are not presented in the visual input,\nwhich impairs their reliability. Recent studies often attribute hallucinations\nto a lack of understanding of visual input, yet ignore a more fundamental\nissue: the model's inability to effectively extract or decouple visual\nfeatures. In this paper, we revisit the hallucinations in LVLMs from an\narchitectural perspective, investigating whether the primary cause lies in the\nvisual encoder (feature extraction) or the modal alignment module (feature\ndecoupling). Motivated by our findings on the preliminary investigation, we\npropose a novel tuning strategy, PATCH, to mitigate hallucinations in LVLMs.\nThis plug-and-play method can be integrated into various LVLMs, utilizing\nadaptive virtual tokens to extract object features from bounding boxes, thereby\naddressing hallucinations caused by insufficient decoupling of visual features.\nPATCH achieves state-of-the-art performance on multiple multi-modal\nhallucination datasets. We hope this approach provides researchers with deeper\ninsights into the underlying causes of hallucinations in LVLMs, fostering\nfurther advancements and innovation in this field."}
{"id": "2501.13983", "pdf": "https://arxiv.org/pdf/2501.13983.pdf", "abs": "https://arxiv.org/abs/2501.13983", "title": "AdEval: Alignment-based Dynamic Evaluation to Mitigate Data Contamination in Large Language Models", "authors": ["Yang Fan"], "categories": ["cs.CL", "cs.AI"], "comment": "There are serious academic problems in this paper, such as data\n  falsification and plagiarism in the method of the paper", "summary": "As Large Language Models (LLMs) are pre-trained on ultra-large-scale corpora,\nthe problem of data contamination is becoming increasingly serious, and there\nis a risk that static evaluation benchmarks overestimate the performance of\nLLMs. To address this, this paper proposes a dynamic data evaluation method\ncalled AdEval (Alignment-based Dynamic Evaluation). AdEval first extracts\nknowledge points and main ideas from static datasets to achieve dynamic\nalignment with the core content of static benchmarks, and by avoiding direct\nreliance on static datasets, it inherently reduces the risk of data\ncontamination from the source. It then obtains background information through\nonline searches to generate detailed descriptions of the knowledge points.\nFinally, it designs questions based on Bloom's cognitive hierarchy across six\ndimensions-remembering, understanding, applying, analyzing, evaluating, and\ncreating to enable multi-level cognitive assessment. Additionally, AdEval\ncontrols the complexity of dynamically generated datasets through iterative\nquestion reconstruction. Experimental results on multiple datasets show that\nAdEval effectively alleviates the impact of data contamination on evaluation\nresults, solves the problems of insufficient complexity control and\nsingle-dimensional evaluation, and improves the fairness, reliability and\ndiversity of LLMs evaluation."}
{"id": "2502.14910", "pdf": "https://arxiv.org/pdf/2502.14910.pdf", "abs": "https://arxiv.org/abs/2502.14910", "title": "EvoP: Robust LLM Inference via Evolutionary Pruning", "authors": ["Shangyu Wu", "Hongchao Du", "Ying Xiong", "Shuai Chen", "Tei-wei Kuo", "Nan Guan", "Chun Jason Xue"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) have achieved remarkable success in natural\nlanguage processing tasks, but their massive size and computational demands\nhinder their deployment in resource-constrained environments. Existing model\npruning methods address this issue by removing redundant structures (e.g.,\nelements, channels, layers) from the model. However, these methods employ a\nheuristic pruning strategy, which leads to suboptimal performance. Besides,\nthey also ignore the data characteristics when pruning the model.\n  To overcome these limitations, we propose EvoP, an evolutionary pruning\nframework for robust LLM inference. EvoP first presents a cluster-based\ncalibration dataset sampling (CCDS) strategy for creating a more diverse\ncalibration dataset. EvoP then introduces an evolutionary pruning pattern\nsearching (EPPS) method to find the optimal pruning pattern. Compared to\nexisting model pruning techniques, EvoP achieves the best performance while\nmaintaining the best efficiency. Experiments across different LLMs and\ndifferent downstream tasks validate the effectiveness of the proposed EvoP,\nmaking it a practical and scalable solution for deploying LLMs in real-world\napplications."}
{"id": "2502.19110", "pdf": "https://arxiv.org/pdf/2502.19110.pdf", "abs": "https://arxiv.org/abs/2502.19110", "title": "Conformal Linguistic Calibration: Trading-off between Factuality and Specificity", "authors": ["Zhengping Jiang", "Anqi Liu", "Benjamin Van Durme"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Language model outputs are not always reliable, thus prompting research into\nhow to adapt model responses based on uncertainty. Common approaches include:\n\\emph{abstention}, where models refrain from generating responses when\nuncertain; and \\emph{linguistic calibration}, where models hedge their\nstatements using uncertainty quantifiers. However, abstention can withhold\nvaluable information, while linguistically calibrated responses are often\nchallenging to leverage in downstream tasks. We propose a unified view,\nConformal Linguistic Calibration (CLC), which reinterprets linguistic\ncalibration as \\emph{answer set prediction}. First we present a framework\nconnecting abstention and linguistic calibration through the lens of linguistic\npragmatics. We then describe an implementation of CLC that allows for\ncontrolling the level of imprecision in model responses. Results demonstrate\nour method produces calibrated outputs with conformal guarantees on factual\naccuracy. Further, our approach enables fine-tuning models to perform\nuncertainty-aware adaptive claim rewriting, offering a controllable balance\nbetween factuality and specificity."}
{"id": "2503.21004", "pdf": "https://arxiv.org/pdf/2503.21004.pdf", "abs": "https://arxiv.org/abs/2503.21004", "title": "Evaluating Large Language Models for Automated Clinical Abstraction in Pulmonary Embolism Registries: Performance Across Model Sizes, Versions, and Parameters", "authors": ["Mahmoud Alwakeel", "Emory Buck", "Jonathan G. Martin", "Imran Aslam", "Sudarshan Rajagopal", "Jian Pei", "Mihai V. Podgoreanu", "Christopher J. Lindsell", "An-Kwok Ian Wong"], "categories": ["cs.CL"], "comment": null, "summary": "Pulmonary embolism (PE) registries accelerate practice-improving research but\ndepend on resource-intensive manual abstraction of radiology reports. We\nevaluated whether openly available large-language models (LLMs) can automate\nconcept extraction from computed-tomography PE (CTPE) reports without\nsacrificing data quality. Four Llama-3 (L3) variants (3.0 8 B, 3.1 8 B, 3.1 70\nB, 3.3 70 B) and two reviewer models Phi-4 (P4) 14 B and Gemma-3 27 B (G3) were\ntested on 250 dual-annotated CTPE reports each from MIMIC-IV and Duke\nUniversity. Outcomes were accuracy, positive predictive value (PPV), and\nnegative predictive value (NPV) versus a human gold standard across model\nsizes, temperature settings, and shot counts. Mean accuracy across all concepts\nincreased with scale: 0.83 (L3-0 8 B), 0.91 (L3-1 8 B), and 0.96 for both 70 B\nvariants; P4 14 B achieved 0.98; G3 matched. Accuracy differed by < 0.03\nbetween datasets, underscoring external robustness. In dual-model concordance\nanalysis (L3 70 B + P4 14 B), PE-presence PPV was >= 0.95 and NPV >= 0.98,\nwhile location, thrombus burden, right-heart strain, and image-quality\nartifacts each maintained PPV >= 0.90 and NPV >= 0.95. Fewer than 4% of\nindividual concept annotations were discordant, and complete agreement was\nobserved in more than 75% of reports. G3 performed comparably. LLMs therefore\noffer a scalable, accurate solution for PE registry abstraction, and a\ndual-model review workflow can further safeguard data quality with minimal\nhuman oversight."}
{"id": "2504.00027", "pdf": "https://arxiv.org/pdf/2504.00027.pdf", "abs": "https://arxiv.org/abs/2504.00027", "title": "Opioid Named Entity Recognition (ONER-2025) from Reddit", "authors": ["Muhammad Ahmad", "Rita Orji", "Fida Ullah", "Ildar Batyrshin", "Grigori Sidorov"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "The opioid overdose epidemic remains a critical public health crisis,\nparticularly in the United States, leading to significant mortality and\nsocietal costs. Social media platforms like Reddit provide vast amounts of\nunstructured data that offer insights into public perceptions, discussions, and\nexperiences related to opioid use. This study leverages Natural Language\nProcessing (NLP), specifically Opioid Named Entity Recognition (ONER-2025), to\nextract actionable information from these platforms. Our research makes four\nkey contributions. First, we created a unique, manually annotated dataset\nsourced from Reddit, where users share self-reported experiences of opioid use\nvia different administration routes. This dataset contains 331,285 tokens and\nincludes eight major opioid entity categories. Second, we detail our annotation\nprocess and guidelines while discussing the challenges of labeling the\nONER-2025 dataset. Third, we analyze key linguistic challenges, including\nslang, ambiguity, fragmented sentences, and emotionally charged language, in\nopioid discussions. Fourth, we propose a real-time monitoring system to process\nstreaming data from social media, healthcare records, and emergency services to\nidentify overdose events. Using 5-fold cross-validation in 11 experiments, our\nsystem integrates machine learning, deep learning, and transformer-based\nlanguage models with advanced contextual embeddings to enhance understanding.\nOur transformer-based models (bert-base-NER and roberta-base) achieved 97%\naccuracy and F1-score, outperforming baselines by 10.23% (RF=0.88)."}
{"id": "2504.00043", "pdf": "https://arxiv.org/pdf/2504.00043.pdf", "abs": "https://arxiv.org/abs/2504.00043", "title": "CrossWordBench: Evaluating the Reasoning Capabilities of LLMs and LVLMs with Controllable Puzzle Generation", "authors": ["Jixuan Leng", "Chengsong Huang", "Langlin Huang", "Bill Yuchen Lin", "William W. Cohen", "Haohan Wang", "Jiaxin Huang"], "categories": ["cs.CL", "cs.AI", "cs.CV"], "comment": null, "summary": "Existing reasoning evaluation frameworks for Large Language Models (LLMs) and\nLarge Vision-Language Models (LVLMs) predominantly assess either text-based\nreasoning or vision-language understanding capabilities, with limited dynamic\ninterplay between textual and visual constraints. To address this limitation,\nwe introduce CrossWordBench, a benchmark designed to evaluate the reasoning\ncapabilities of both LLMs and LVLMs through the medium of crossword puzzles --\na task requiring multimodal adherence to semantic constraints from text-based\nclues and intersectional constraints from visual grid structures.\nCrossWordBench leverages a controllable puzzle generation framework that\nproduces puzzles in two formats (text and image), supports adjustable\ndifficulty through prefill ratio control, and offers different evaluation\nstrategies, ranging from direct puzzle solving to interactive modes. Our\nextensive evaluation of over 20 models reveals that reasoning LLMs\nsubstantially outperform non-reasoning models by effectively leveraging\ncrossing-letter constraints. We further demonstrate that LVLMs struggle with\nthe task, showing a strong correlation between their puzzle-solving performance\nand grid-parsing accuracy. Our findings highlight limitations of the reasoning\ncapabilities of current LLMs and LVLMs, and provide an effective approach for\ncreating multimodal constrained tasks for future evaluations."}
{"id": "2504.07114", "pdf": "https://arxiv.org/pdf/2504.07114.pdf", "abs": "https://arxiv.org/abs/2504.07114", "title": "ChatBench: From Static Benchmarks to Human-AI Evaluation", "authors": ["Serina Chang", "Ashton Anderson", "Jake M. Hofman"], "categories": ["cs.CL", "cs.AI", "cs.CY", "cs.HC"], "comment": "ACL 2025 (main)", "summary": "With the rapid adoption of LLM-based chatbots, there is a pressing need to\nevaluate what humans and LLMs can achieve together. However, standard\nbenchmarks, such as MMLU, measure LLM capabilities in isolation (i.e.,\n\"AI-alone\"). Here, we design and conduct a user study to convert MMLU questions\ninto user-AI conversations, by seeding the user with the question and having\nthem carry out a conversation with the LLM to answer their question. We release\nChatBench, a new dataset with AI-alone, user-alone, and user-AI data for 396\nquestions and two LLMs, including 144K answers and 7,336 user-AI conversations.\nWe find that AI-alone accuracy fails to predict user-AI accuracy, with\nsignificant differences across multiple subjects (math, physics, and moral\nreasoning), and we analyze the user-AI conversations to provide insight into\nhow they diverge from AI-alone benchmarks. Finally, we show that fine-tuning a\nuser simulator on a subset of ChatBench improves its ability to estimate\nuser-AI accuracies, increasing correlation on held-out questions by more than\n20 points, creating possibilities for scaling interactive evaluation."}
{"id": "2504.13079", "pdf": "https://arxiv.org/pdf/2504.13079.pdf", "abs": "https://arxiv.org/abs/2504.13079", "title": "Retrieval-Augmented Generation with Conflicting Evidence", "authors": ["Han Wang", "Archiki Prasad", "Elias Stengel-Eskin", "Mohit Bansal"], "categories": ["cs.CL", "cs.AI"], "comment": "COLM 2025, Data and Code: https://github.com/HanNight/RAMDocs", "summary": "Large language model (LLM) agents are increasingly employing\nretrieval-augmented generation (RAG) to improve the factuality of their\nresponses. However, in practice, these systems often need to handle ambiguous\nuser queries and potentially conflicting information from multiple sources\nwhile also suppressing inaccurate information from noisy or irrelevant\ndocuments. Prior work has generally studied and addressed these challenges in\nisolation, considering only one aspect at a time, such as handling ambiguity or\nrobustness to noise and misinformation. We instead consider multiple factors\nsimultaneously, proposing (i) RAMDocs (Retrieval with Ambiguity and\nMisinformation in Documents), a new dataset that simulates complex and\nrealistic scenarios for conflicting evidence for a user query, including\nambiguity, misinformation, and noise; and (ii) MADAM-RAG, a multi-agent\napproach in which LLM agents debate over the merits of an answer over multiple\nrounds, allowing an aggregator to collate responses corresponding to\ndisambiguated entities while discarding misinformation and noise, thereby\nhandling diverse sources of conflict jointly. We demonstrate the effectiveness\nof MADAM-RAG using both closed and open-source models on AmbigDocs -- which\nrequires presenting all valid answers for ambiguous queries -- improving over\nstrong RAG baselines by up to 11.40% and on FaithEval -- which requires\nsuppressing misinformation -- where we improve by up to 15.80% (absolute) with\nLlama3.3-70B-Instruct. Furthermore, we find that RAMDocs poses a challenge for\nexisting RAG baselines (Llama3.3-70B-Instruct only obtains 32.60 exact match\nscore). While MADAM-RAG begins to address these conflicting factors, our\nanalysis indicates that a substantial gap remains especially when increasing\nthe level of imbalance in supporting evidence and misinformation."}
{"id": "2506.05735", "pdf": "https://arxiv.org/pdf/2506.05735.pdf", "abs": "https://arxiv.org/abs/2506.05735", "title": "Do LLMs Really Forget? Evaluating Unlearning with Knowledge Correlation and Confidence Awareness", "authors": ["Rongzhe Wei", "Peizhi Niu", "Hans Hao-Hsun Hsu", "Ruihan Wu", "Haoteng Yin", "Yifan Li", "Eli Chien", "Kamalika Chaudhuri", "Olgica Milenkovic", "Pan Li"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Machine unlearning techniques aim to mitigate unintended memorization in\nlarge language models (LLMs). However, existing approaches predominantly focus\non the explicit removal of isolated facts, often overlooking latent inferential\ndependencies and the non-deterministic nature of knowledge within LLMs.\nConsequently, facts presumed forgotten may persist implicitly through\ncorrelated information. To address these challenges, we propose a knowledge\nunlearning evaluation framework that more accurately captures the implicit\nstructure of real-world knowledge by representing relevant factual contexts as\nknowledge graphs with associated confidence scores. We further develop an\ninference-based evaluation protocol leveraging powerful LLMs as judges; these\njudges reason over the extracted knowledge subgraph to determine unlearning\nsuccess. Our LLM judges utilize carefully designed prompts and are calibrated\nagainst human evaluations to ensure their trustworthiness and stability.\nExtensive experiments on our newly constructed benchmark demonstrate that our\nframework provides a more realistic and rigorous assessment of unlearning\nperformance. Moreover, our findings reveal that current evaluation strategies\ntend to overestimate unlearning effectiveness. Our code is publicly available\nat https://github.com/Graph-COM/Knowledge_Unlearning.git."}
{"id": "2506.10769", "pdf": "https://arxiv.org/pdf/2506.10769.pdf", "abs": "https://arxiv.org/abs/2506.10769", "title": "Mind the Gap: Benchmarking LLM Uncertainty, Discrimination, and Calibration in Specialty-Aware Clinical QA", "authors": ["Alberto Testoni", "Iacer Calixto"], "categories": ["cs.CL"], "comment": null, "summary": "Reliable uncertainty quantification (UQ) is essential when employing large\nlanguage models (LLMs) in high-risk domains such as clinical question answering\n(QA). In this work, we evaluate uncertainty estimation methods for clinical QA\nfocusing, for the first time, on eleven clinical specialties and six question\ntypes, and across ten open-source LLMs (general-purpose, biomedical, and\nreasoning models). We analyze score-based UQ methods, present a case study\nintroducing a novel lightweight method based on behavioral features derived\nfrom reasoning-oriented models, and examine conformal prediction as a\ncomplementary set-based approach. Our findings reveal that uncertainty\nreliability is not a monolithic property, but one that depends on clinical\nspecialty and question type due to shifts in calibration and discrimination.\nOur results highlight the need to select or ensemble models based on their\ndistinct, complementary strengths and clinical use."}
{"id": "2506.12116", "pdf": "https://arxiv.org/pdf/2506.12116.pdf", "abs": "https://arxiv.org/abs/2506.12116", "title": "Unsupervised Document and Template Clustering using Multimodal Embeddings", "authors": ["Phillipe R. Sampaio", "Helene Maxcici"], "categories": ["cs.CL", "cs.AI", "cs.CV"], "comment": "22 pages, 12 figures", "summary": "This paper investigates a novel approach to unsupervised document clustering\nby leveraging multimodal embeddings as input to clustering algorithms such as\n$k$-Means, DBSCAN, a combination of HDBSCAN and $k$-NN, and BIRCH. Our method\naims to achieve a finer-grained document understanding by not only grouping\ndocuments at the type level (e.g., invoices, purchase orders), but also\ndistinguishing between different templates within the same document category.\nThis is achieved by using embeddings that capture textual content, layout\ninformation, and visual features of documents. We evaluated the effectiveness\nof this approach using embeddings generated by several state-of-the-art\npre-trained multimodal models, including SBERT, LayoutLMv1, LayoutLMv3, DiT,\nDonut, ColPali, Gemma3, and InternVL3. Our findings demonstrate the potential\nof multimodal embeddings to significantly enhance document clustering, offering\nbenefits for various applications in intelligent document processing, document\nlayout analysis, and unsupervised document classification. This work provides\nvaluable insight into the advantages and limitations of different multimodal\nmodels for this task and opens new avenues for future research to understand\nand organize document collections."}
{"id": "2506.14758", "pdf": "https://arxiv.org/pdf/2506.14758.pdf", "abs": "https://arxiv.org/abs/2506.14758", "title": "Reasoning with Exploration: An Entropy Perspective on Reinforcement Learning for LLMs", "authors": ["Daixuan Cheng", "Shaohan Huang", "Xuekai Zhu", "Bo Dai", "Wayne Xin Zhao", "Zhenliang Zhang", "Furu Wei"], "categories": ["cs.CL"], "comment": null, "summary": "Balancing exploration and exploitation is a central goal in reinforcement\nlearning (RL). Despite recent advances in enhancing large language model (LLM)\nreasoning, most methods lean toward exploitation, and increasingly encounter\nperformance plateaus. In this work, we revisit entropy -- a signal of\nexploration in RL -- and examine its relationship to exploratory reasoning in\nLLMs. Through empirical analysis, we uncover positive correlations between\nhigh-entropy regions and three types of exploratory reasoning actions: (1)\npivotal tokens that determine or connect logical steps, (2) reflective actions\nsuch as self-verification and correction, and (3) rare behaviors under-explored\nby the base LLMs. Motivated by this, we introduce a minimal modification to\nstandard RL with only one line of code: augmenting the advantage function with\nan entropy-based term. Unlike traditional maximum-entropy methods which\nencourage exploration by promoting uncertainty, we encourage exploration by\npromoting longer and deeper reasoning chains. Notably, our method achieves\nsignificant gains on the Pass@K metric -- an upper-bound estimator of LLM\nreasoning capabilities -- even when evaluated with extremely large K values,\npushing the boundaries of LLM reasoning."}
{"id": "2507.20252", "pdf": "https://arxiv.org/pdf/2507.20252.pdf", "abs": "https://arxiv.org/abs/2507.20252", "title": "Post-Completion Learning for Language Models", "authors": ["Xiang Fei", "Siqi Wang", "Shu Wei", "Yuxiang Nie", "Wei Shi", "Hao Feng", "Chao Feng", "Can Huang"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Current language model training paradigms typically terminate learning upon\nreaching the end-of-sequence (<eos>) token, overlooking the potential learning\nopportunities in the post-completion space. We propose Post-Completion Learning\n(PCL), a novel training framework that systematically utilizes the sequence\nspace after model output completion, to enhance both the reasoning and\nself-evaluation abilities. PCL enables models to continue generating\nself-assessments and reward predictions during training, while maintaining\nefficient inference by stopping at the completion point.\n  To fully utilize this post-completion space, we design a white-box\nreinforcement learning method: let the model evaluate the output content\naccording to the reward rules, then calculate and align the score with the\nreward functions for supervision. We implement dual-track SFT to optimize both\nreasoning and evaluation capabilities, and mixed it with RL training to achieve\nmulti-objective hybrid optimization.\n  Experimental results on different datasets and models demonstrate consistent\nimprovements over traditional SFT and RL methods. Our method provides a new\ntechnical path for language model training that enhances output quality while\npreserving deployment efficiency."}
{"id": "2507.20343", "pdf": "https://arxiv.org/pdf/2507.20343.pdf", "abs": "https://arxiv.org/abs/2507.20343", "title": "DYNARTmo: A Dynamic Articulatory Model for Visualization of Speech Movement Patterns", "authors": ["Bernd J. Kröger"], "categories": ["cs.CL"], "comment": "10 pages, 29 references, 2 figures, supplementary material. V2:\n  Discussion of the tongue-palate contact pattern for /t/. V3: table 2:\n  \"lateral\" added", "summary": "We present DYNARTmo, a dynamic articulatory model designed to visualize\nspeech articulation processes in a two-dimensional midsagittal plane. The model\nbuilds upon the UK-DYNAMO framework and integrates principles of articulatory\nunderspecification, segmental and gestural control, and coarticulation.\nDYNARTmo simulates six key articulators based on ten continuous and six\ndiscrete control parameters, allowing for the generation of both vocalic and\nconsonantal articulatory configurations. The current implementation is embedded\nin a web-based application (SpeechArticulationTrainer) that includes sagittal,\nglottal, and palatal views, making it suitable for use in phonetics education\nand speech therapy. While this paper focuses on the static modeling aspects,\nfuture work will address dynamic movement generation and integration with\narticulatory-acoustic modules."}
{"id": "2507.21065", "pdf": "https://arxiv.org/pdf/2507.21065.pdf", "abs": "https://arxiv.org/abs/2507.21065", "title": "AI Pedagogy: Dialogic Social Learning for Artificial Agents", "authors": ["Sabrina Patania", "Luca Annese", "Cansu Koyuturk", "Azzurra Ruggeri", "Dimitri Ognibene"], "categories": ["cs.CL", "cs.HC", "cs.LG", "cs.RO", "I.2.7, I.2.9, j.4,"], "comment": "accepted at ICSR2025", "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nprocessing extensive offline datasets. However, they often face challenges in\nacquiring and integrating complex, knowledge online. Traditional AI training\nparadigms, predominantly based on supervised learning or reinforcement\nlearning, mirror a 'Piagetian' model of independent exploration. These\napproaches typically rely on large datasets and sparse feedback signals,\nlimiting the models' ability to learn efficiently from interactions. Drawing\ninspiration from Vygotsky's sociocultural theory, this study explores the\npotential of socially mediated learning paradigms to address these limitations.\n  We introduce a dynamic environment, termed the 'AI Social Gym', where an AI\nlearner agent engages in dyadic pedagogical dialogues with knowledgeable AI\nteacher agents. These interactions emphasize external, structured dialogue as a\ncore mechanism for knowledge acquisition, contrasting with methods that depend\nsolely on internal inference or pattern recognition.\n  Our investigation focuses on how different pedagogical strategies impact the\nAI learning process in the context of ontology acquisition. Empirical results\nindicate that such dialogic approaches-particularly those involving\nmixed-direction interactions combining top-down explanations with\nlearner-initiated questioning-significantly enhance the LLM's ability to\nacquire and apply new knowledge, outperforming both unidirectional\ninstructional methods and direct access to structured knowledge, formats\ntypically present in training datasets.\n  These findings suggest that integrating pedagogical and psychological\ninsights into AI and robot training can substantially improve post-training\nknowledge acquisition and response quality. This approach offers a\ncomplementary pathway to existing strategies like prompt engineering"}
{"id": "2507.23465", "pdf": "https://arxiv.org/pdf/2507.23465.pdf", "abs": "https://arxiv.org/abs/2507.23465", "title": "Role-Aware Language Models for Secure and Contextualized Access Control in Organizations", "authors": ["Saeed Almheiri", "Yerulan Kongrat", "Adrian Santosh", "Ruslan Tasmukhanov", "Josemaria Loza Vera", "Muhammad Dehan Al Kautsar", "Fajri Koto"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "As large language models (LLMs) are increasingly deployed in enterprise\nsettings, controlling model behavior based on user roles becomes an essential\nrequirement. Existing safety methods typically assume uniform access and focus\non preventing harmful or toxic outputs, without addressing role-specific access\nconstraints. In this work, we investigate whether LLMs can be fine-tuned to\ngenerate responses that reflect the access privileges associated with different\norganizational roles. We explore three modeling strategies: a BERT-based\nclassifier, an LLM-based classifier, and role-conditioned generation. To\nevaluate these approaches, we construct two complementary datasets. The first\nis adapted from existing instruction-tuning corpora through clustering and role\nlabeling, while the second is synthetically generated to reflect realistic,\nrole-sensitive enterprise scenarios. We assess model performance across varying\norganizational structures and analyze robustness to prompt injection, role\nmismatch, and jailbreak attempts."}
{"id": "2507.23486", "pdf": "https://arxiv.org/pdf/2507.23486.pdf", "abs": "https://arxiv.org/abs/2507.23486", "title": "A Novel Evaluation Benchmark for Medical LLMs: Illuminating Safety and Effectiveness in Clinical Domains", "authors": ["Shirui Wang", "Zhihui Tang", "Huaxia Yang", "Qiuhong Gong", "Tiantian Gu", "Hongyang Ma", "Yongxin Wang", "Wubin Sun", "Zeliang Lian", "Kehang Mao", "Yinan Jiang", "Zhicheng Huang", "Lingyun Ma", "Wenjie Shen", "Yajie Ji", "Yunhui Tan", "Chunbo Wang", "Yunlu Gao", "Qianling Ye", "Rui Lin", "Mingyu Chen", "Lijuan Niu", "Zhihao Wang", "Peng Yu", "Mengran Lang", "Yue Liu", "Huimin Zhang", "Haitao Shen", "Long Chen", "Qiguang Zhao", "Si-Xuan Liu", "Lina Zhou", "Hua Gao", "Dongqiang Ye", "Lingmin Meng", "Youtao Yu", "Naixin Liang", "Jianxiong Wu"], "categories": ["cs.CL"], "comment": null, "summary": "Large language models (LLMs) hold promise in clinical decision support but\nface major challenges in safety evaluation and effectiveness validation. We\ndeveloped the Clinical Safety-Effectiveness Dual-Track Benchmark (CSEDB), a\nmultidimensional framework built on clinical expert consensus, encompassing 30\ncriteria covering critical areas like critical illness recognition, guideline\nadherence, and medication safety, with weighted consequence measures.\nThirty-two specialist physicians developed and reviewed 2,069 open-ended Q\\&A\nitems aligned with these criteria, spanning 26 clinical departments to simulate\nreal-world scenarios. Benchmark testing of six LLMs revealed moderate overall\nperformance (average total score 57.2\\%, safety 54.7\\%, effectiveness 62.3\\%),\nwith a significant 13.3\\% performance drop in high-risk scenarios (p $<$\n0.0001). Domain-specific medical LLMs showed consistent performance advantages\nover general-purpose models, with relatively higher top scores in safety\n(0.912) and effectiveness (0.861). The findings of this study not only provide\na standardized metric for evaluating the clinical application of medical LLMs,\nfacilitating comparative analyses, risk exposure identification, and\nimprovement directions across different scenarios, but also hold the potential\nto promote safer and more effective deployment of large language models in\nhealthcare environments."}
{"id": "2508.02038", "pdf": "https://arxiv.org/pdf/2508.02038.pdf", "abs": "https://arxiv.org/abs/2508.02038", "title": "Marco-Voice Technical Report", "authors": ["Fengping Tian", "Chenyang Lyu", "Xuanfan Ni", "Haoqin Sun", "Qingjuan Li", "Zhiqiang Qian", "Haijun Li", "Longyue Wang", "Zhao Xu", "Weihua Luo", "Kaifu Zhang"], "categories": ["cs.CL", "cs.SD", "eess.AS"], "comment": "Technical Report. Our code and dataset are publicly available at\n  https://github.com/AIDC-AI/Marco-Voice and\n  https://huggingface.co/datasets/AIDC-AI/CSEMOTIONS respectively", "summary": "This paper presents a multifunctional speech synthesis system that integrates\nvoice cloning and emotion control speech synthesis within a unified framework.\nThe goal of this work is to address longstanding challenges in achieving highly\nexpressive, controllable, and natural speech generation that faithfully\npreserves speaker identity across diverse linguistic and emotional contexts.\nOur approach introduces an effective speaker-emotion disentanglement mechanism\nwith in-batch contrastive learning, enabling independent manipulation of\nspeaker identity and eemotional style, as well as rotational emotional\nembedding integration method for smooth emotion control. To support\ncomprehensive training and evaluation, we construct CSEMOTIONS, a high-quality\nemotional speech dataset containing 10 hours of Mandarin speech from six\nprofessional speakers across seven emotional categories. Extensive experiments\ndemonstrate that our system, Marco-Voice, achieves substantial improvements in\nboth objective and subjective metrics. Comprehensive evaluations and analysis\nwere conducted, results show that MarcoVoice delivers competitive performance\nin terms of speech clarity and emotional richness, representing a substantial\nadvance in the field of expressive neural speech synthesis. Our code and\ndataset are publicly available at https://github.com/AIDC-AI/Marco-Voice and\nhttps://huggingface.co/datasets/AIDC-AI/CSEMOTIONS respectively."}
{"id": "2508.04276", "pdf": "https://arxiv.org/pdf/2508.04276.pdf", "abs": "https://arxiv.org/abs/2508.04276", "title": "A Few Words Can Distort Graphs: Knowledge Poisoning Attacks on Graph-based Retrieval-Augmented Generation of Large Language Models", "authors": ["Jiayi Wen", "Tianxin Chen", "Zhirun Zheng", "Cheng Huang"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Graph-based Retrieval-Augmented Generation (GraphRAG) has recently emerged as\na promising paradigm for enhancing large language models (LLMs) by converting\nraw text into structured knowledge graphs, improving both accuracy and\nexplainability. However, GraphRAG relies on LLMs to extract knowledge from raw\ntext during graph construction, and this process can be maliciously manipulated\nto implant misleading information. Targeting this attack surface, we propose\ntwo knowledge poisoning attacks (KPAs) and demonstrate that modifying only a\nfew words in the source text can significantly change the constructed graph,\npoison the GraphRAG, and severely mislead downstream reasoning. The first\nattack, named Targeted KPA (TKPA), utilizes graph-theoretic analysis to locate\nvulnerable nodes in the generated graphs and rewrites the corresponding\nnarratives with LLMs, achieving precise control over specific\nquestion-answering (QA) outcomes with a success rate of 93.1\\%, while keeping\nthe poisoned text fluent and natural. The second attack, named Universal KPA\n(UKPA), exploits linguistic cues such as pronouns and dependency relations to\ndisrupt the structural integrity of the generated graph by altering globally\ninfluential words. With fewer than 0.05\\% of full text modified, the QA\naccuracy collapses from 95\\% to 50\\%. Furthermore, experiments show that\nstate-of-the-art defense methods fail to detect these attacks, highlighting\nthat securing GraphRAG pipelines against knowledge poisoning remains largely\nunexplored."}
{"id": "2508.04349", "pdf": "https://arxiv.org/pdf/2508.04349.pdf", "abs": "https://arxiv.org/abs/2508.04349", "title": "GTPO and GRPO-S: Token and Sequence-Level Reward Shaping with Policy Entropy", "authors": ["Hongze Tan", "Jianfei Pan"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Reinforcement learning (RL) with algorithms like Group Relative Policy\nOptimization (GRPO) improves Large Language Model (LLM) reasoning, but is\nlimited by a coarse-grained credit assignment that applies a uniform reward to\nall tokens in a sequence. This is a major flaw in long-chain reasoning tasks.\nThis paper solves this with \\textbf{Dynamic Entropy Weighting}. Our core idea\nis that high-entropy tokens in correct responses can guide the policy toward a\nhigher performance ceiling. This allows us to create more fine-grained reward\nsignals for precise policy updates via two ways: 1) \\textbf{Group Token Policy\nOptimization} (\\textbf{GTPO}), we assigns a entropy-weighted reward to each\ntoken for fine-grained credit assignment. 2) \\textbf{Sequence-Level Group\nRelative Policy Optimization} (\\textbf{GRPO-S}), we assigns a entropy-weighted\nreward to each sequence based on its average token entropy. Experiments show\nour methods significantly outperform the strong DAPO baseline. The results\nconfirm that our entropy-weighting mechanism is the key driver of this\nperformance boost, offering a better path to enhance deep reasoning in models."}
{"id": "2508.04903", "pdf": "https://arxiv.org/pdf/2508.04903.pdf", "abs": "https://arxiv.org/abs/2508.04903", "title": "RCR-Router: Efficient Role-Aware Context Routing for Multi-Agent LLM Systems with Structured Memory", "authors": ["Jun Liu", "Zhenglun Kong", "Changdi Yang", "Fan Yang", "Tianqi Li", "Peiyan Dong", "Joannah Nanjekye", "Hao Tang", "Geng Yuan", "Wei Niu", "Wenbin Zhang", "Pu Zhao", "Xue Lin", "Dong Huang", "Yanzhi Wang"], "categories": ["cs.CL", "cs.AI", "cs.MA"], "comment": null, "summary": "Multi-agent large language model (LLM) systems have shown strong potential in\ncomplex reasoning and collaborative decision-making tasks. However, most\nexisting coordination schemes rely on static or full-context routing\nstrategies, which lead to excessive token consumption, redundant memory\nexposure, and limited adaptability across interaction rounds. We introduce\nRCR-Router, a modular and role-aware context routing framework designed to\nenable efficient, adaptive collaboration in multi-agent LLMs. To our knowledge,\nthis is the first routing approach that dynamically selects semantically\nrelevant memory subsets for each agent based on its role and task stage, while\nadhering to a strict token budget. A lightweight scoring policy guides memory\nselection, and agent outputs are iteratively integrated into a shared memory\nstore to facilitate progressive context refinement. To better evaluate model\nbehavior, we further propose an Answer Quality Score metric that captures\nLLM-generated explanations beyond standard QA accuracy. Experiments on three\nmulti-hop QA benchmarks -- HotPotQA, MuSiQue, and 2WikiMultihop -- demonstrate\nthat RCR-Router reduces token usage (up to 30%) while improving or maintaining\nanswer quality. These results highlight the importance of structured memory\nrouting and output-aware evaluation in advancing scalable multi-agent LLM\nsystems."}
{"id": "2508.05452", "pdf": "https://arxiv.org/pdf/2508.05452.pdf", "abs": "https://arxiv.org/abs/2508.05452", "title": "LLMEval-3: A Large-Scale Longitudinal Study on Robust and Fair Evaluation of Large Language Models", "authors": ["Ming Zhang", "Yujiong Shen", "Jingyi Deng", "Yuhui Wang", "Yue Zhang", "Junzhe Wang", "Shichun Liu", "Shihan Dou", "Huayu Sha", "Qiyuan Peng", "Changhao Jiang", "Jingqi Tong", "Yilong Wu", "Zhihao Zhang", "Mingqi Wu", "Zhiheng Xi", "Mingxu Chai", "Tao Liang", "Zhihui Fei", "Zhen Wang", "Mingyang Wan", "Guojun Ma", "Tao Gui", "Qi Zhang", "Xuanjing Huang"], "categories": ["cs.CL"], "comment": null, "summary": "Existing evaluation of Large Language Models (LLMs) on static benchmarks is\nvulnerable to data contamination and leaderboard overfitting, critical issues\nthat obscure true model capabilities. To address this, we introduce LLMEval-3,\na framework for dynamic evaluation of LLMs. LLMEval-3 is built on a proprietary\nbank of 220k graduate-level questions, from which it dynamically samples unseen\ntest sets for each evaluation run. Its automated pipeline ensures integrity via\ncontamination-resistant data curation, a novel anti-cheating architecture, and\na calibrated LLM-as-a-judge process achieving 90% agreement with human experts,\ncomplemented by a relative ranking system for fair comparison. An 20-month\nlongitudinal study of nearly 50 leading models reveals a performance ceiling on\nknowledge memorization and exposes data contamination vulnerabilities\nundetectable by static benchmarks. The framework demonstrates exceptional\nrobustness in ranking stability and consistency, providing strong empirical\nvalidation for the dynamic evaluation paradigm. LLMEval-3 offers a robust and\ncredible methodology for assessing the true capabilities of LLMs beyond\nleaderboard scores, promoting the development of more trustworthy evaluation\nstandards."}
{"id": "2508.06595", "pdf": "https://arxiv.org/pdf/2508.06595.pdf", "abs": "https://arxiv.org/abs/2508.06595", "title": "LLM Unlearning Without an Expert Curated Dataset", "authors": ["Xiaoyuan Zhu", "Muru Zhang", "Ollie Liu", "Robin Jia", "Willie Neiswanger"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Modern large language models often encode sensitive, harmful, or copyrighted\nknowledge, raising the need for post-hoc unlearning-the ability to remove\nspecific domains of knowledge from a model without full retraining. A major\nbottleneck in current unlearning pipelines is constructing effective forget\nsets-datasets that approximate the target domain and guide the model to forget\nit. In this work, we introduce a scalable, automated approach to generate\nhigh-quality forget sets using language models themselves. Our method\nsynthesizes textbook-style data through a structured prompting pipeline,\nrequiring only a domain name as input. Through experiments on unlearning\nbiosecurity, cybersecurity, and Harry Potter novels, we show that our synthetic\ndatasets consistently outperform the baseline synthetic alternatives and are\ncomparable to the expert-curated ones. Additionally, ablation studies reveal\nthat the multi-step generation pipeline significantly boosts data diversity,\nwhich in turn improves unlearning utility. Overall, our findings suggest that\nsynthetic datasets offer a promising path toward practical, scalable unlearning\nfor a wide range of emerging domains without the need for manual intervention.\nWe release our code and dataset at\nhttps://github.com/xyzhu123/Synthetic_Textbook."}
{"id": "2508.06671", "pdf": "https://arxiv.org/pdf/2508.06671.pdf", "abs": "https://arxiv.org/abs/2508.06671", "title": "Do Biased Models Have Biased Thoughts?", "authors": ["Swati Rajwal", "Shivank Garg", "Reem Abdel-Salam", "Abdelrahman Zayed"], "categories": ["cs.CL", "cs.AI", "I.2.7"], "comment": "Accepted at main track of the Second Conference on Language Modeling\n  (COLM 2025)", "summary": "The impressive performance of language models is undeniable. However, the\npresence of biases based on gender, race, socio-economic status, physical\nappearance, and sexual orientation makes the deployment of language models\nchallenging. This paper studies the effect of chain-of-thought prompting, a\nrecent approach that studies the steps followed by the model before it\nresponds, on fairness. More specifically, we ask the following question:\n$\\textit{Do biased models have biased thoughts}$? To answer our question, we\nconduct experiments on $5$ popular large language models using fairness metrics\nto quantify $11$ different biases in the model's thoughts and output. Our\nresults show that the bias in the thinking steps is not highly correlated with\nthe output bias (less than $0.6$ correlation with a $p$-value smaller than\n$0.001$ in most cases). In other words, unlike human beings, the tested models\nwith biased decisions do not always possess biased thoughts."}
{"id": "2508.07414", "pdf": "https://arxiv.org/pdf/2508.07414.pdf", "abs": "https://arxiv.org/abs/2508.07414", "title": "Grounding Multilingual Multimodal LLMs With Cultural Knowledge", "authors": ["Jean de Dieu Nyandwi", "Yueqi Song", "Simran Khanuja", "Graham Neubig"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Multimodal Large Language Models excel in high-resource settings, but often\nmisinterpret long-tail cultural entities and underperform in low-resource\nlanguages. To address this gap, we propose a data-centric approach that\ndirectly grounds MLLMs in cultural knowledge. Leveraging a large scale\nknowledge graph from Wikidata, we collect images that represent culturally\nsignificant entities, and generate synthetic multilingual visual question\nanswering data. The resulting dataset, CulturalGround, comprises 22 million\nhigh-quality, culturally-rich VQA pairs spanning 42 countries and 39 languages.\nWe train an open-source MLLM CulturalPangea on CulturalGround, interleaving\nstandard multilingual instruction-tuning data to preserve general abilities.\nCulturalPangea achieves state-of-the-art performance among open models on\nvarious culture-focused multilingual multimodal benchmarks, outperforming prior\nmodels by an average of 5.0 without degrading results on mainstream\nvision-language tasks. Our findings show that our targeted, culturally grounded\napproach could substantially narrow the cultural gap in MLLMs and offer a\npractical path towards globally inclusive multimodal systems."}
{"id": "2508.08149", "pdf": "https://arxiv.org/pdf/2508.08149.pdf", "abs": "https://arxiv.org/abs/2508.08149", "title": "REX-RAG: Reasoning Exploration with Policy Correction in Retrieval-Augmented Generation", "authors": ["Wentao Jiang", "Xiang Feng", "Zengmao Wang", "Yong Luo", "Pingbo Xu", "Zhe Chen", "Bo Du", "Jing Zhang"], "categories": ["cs.CL"], "comment": "17 pages, 4 figures; updated references", "summary": "Reinforcement learning (RL) is emerging as a powerful paradigm for enabling\nlarge language models (LLMs) to perform complex reasoning tasks. Recent\nadvances indicate that integrating RL with retrieval-augmented generation (RAG)\nallows LLMs to dynamically incorporate external knowledge, leading to more\ninformed and robust decision making. However, we identify a critical challenge\nduring policy-driven trajectory sampling: LLMs are frequently trapped in\nunproductive reasoning paths, which we refer to as \"dead ends\", committing to\noverconfident yet incorrect conclusions. This severely hampers exploration and\nundermines effective policy optimization. To address this challenge, we propose\nREX-RAG (Reasoning Exploration with Policy Correction in Retrieval-Augmented\nGeneration), a novel framework that explores alternative reasoning paths while\nmaintaining rigorous policy learning through principled distributional\ncorrections. Our approach introduces two key innovations: (1) Mixed Sampling\nStrategy, which combines a novel probe sampling method with exploratory prompts\nto escape dead ends; and (2) Policy Correction Mechanism, which employs\nimportance sampling to correct distribution shifts induced by mixed sampling,\nthereby mitigating gradient estimation bias. We evaluate it on seven\nquestion-answering benchmarks, and the experimental results show that REX-RAG\nachieves average performance gains of 5.1% on Qwen2.5-3B and 3.6% on Qwen2.5-7B\nover strong baselines, demonstrating competitive results across multiple\ndatasets. The code is publicly available at https://github.com/MiliLab/REX-RAG."}
{"id": "2508.08243", "pdf": "https://arxiv.org/pdf/2508.08243.pdf", "abs": "https://arxiv.org/abs/2508.08243", "title": "Jinx: Unlimited LLMs for Probing Alignment Failures", "authors": ["Jiahao Zhao", "Liwei Dong"], "categories": ["cs.CL"], "comment": "https://huggingface.co/Jinx-org", "summary": "Unlimited, or so-called helpful-only language models are trained without\nsafety alignment constraints and never refuse user queries. They are widely\nused by leading AI companies as internal tools for red teaming and alignment\nevaluation. For example, if a safety-aligned model produces harmful outputs\nsimilar to an unlimited model, this indicates alignment failures that require\nfurther attention. Despite their essential role in assessing alignment, such\nmodels are not available to the research community.\n  We introduce Jinx, a helpful-only variant of popular open-weight LLMs. Jinx\nresponds to all queries without refusals or safety filtering, while preserving\nthe base model's capabilities in reasoning and instruction following. It\nprovides researchers with an accessible tool for probing alignment failures,\nevaluating safety boundaries, and systematically studying failure modes in\nlanguage model safety."}
{"id": "2403.16971", "pdf": "https://arxiv.org/pdf/2403.16971.pdf", "abs": "https://arxiv.org/abs/2403.16971", "title": "AIOS: LLM Agent Operating System", "authors": ["Kai Mei", "Xi Zhu", "Wujiang Xu", "Wenyue Hua", "Mingyu Jin", "Zelong Li", "Shuyuan Xu", "Ruosong Ye", "Yingqiang Ge", "Yongfeng Zhang"], "categories": ["cs.OS", "cs.AI", "cs.CL"], "comment": "Published as a full paper at COLM 2025", "summary": "LLM-based intelligent agents face significant deployment challenges,\nparticularly related to resource management. Allowing unrestricted access to\nLLM or tool resources can lead to inefficient or even potentially harmful\nresource allocation and utilization for agents. Furthermore, the absence of\nproper scheduling and resource management mechanisms in current agent designs\nhinders concurrent processing and limits overall system efficiency. To address\nthese challenges, this paper proposes the architecture of AIOS (LLM-based AI\nAgent Operating System) under the context of managing LLM-based agents. It\nintroduces a novel architecture for serving LLM-based agents by isolating\nresources and LLM-specific services from agent applications into an AIOS\nkernel. This AIOS kernel provides fundamental services (e.g., scheduling,\ncontext management, memory management, storage management, access control) for\nruntime agents. To enhance usability, AIOS also includes an AIOS SDK, a\ncomprehensive suite of APIs designed for utilizing functionalities provided by\nthe AIOS kernel. Experimental results demonstrate that using AIOS can achieve\nup to 2.1x faster execution for serving agents built by various agent\nframeworks. The source code is available at\nhttps://github.com/agiresearch/AIOS."}
{"id": "2408.02865", "pdf": "https://arxiv.org/pdf/2408.02865.pdf", "abs": "https://arxiv.org/abs/2408.02865", "title": "VisionUnite: A Vision-Language Foundation Model for Ophthalmology Enhanced with Clinical Knowledge", "authors": ["Zihan Li", "Diping Song", "Zefeng Yang", "Deming Wang", "Fei Li", "Xiulan Zhang", "Paul E. Kinahan", "Yu Qiao"], "categories": ["eess.IV", "cs.AI", "cs.CL", "cs.CV"], "comment": "Accepted by IEEE TPAMI, 14 pages, 15 tables, 4 figures with Appendix", "summary": "The need for improved diagnostic methods in ophthalmology is acute,\nespecially in the underdeveloped regions with limited access to specialists and\nadvanced equipment. Therefore, we introduce VisionUnite, a novel\nvision-language foundation model for ophthalmology enhanced with clinical\nknowledge. VisionUnite has been pretrained on an extensive dataset comprising\n1.24 million image-text pairs, and further refined using our proposed MMFundus\ndataset, which includes 296,379 high-quality fundus image-text pairs and\n889,137 simulated doctor-patient dialogue instances. Our experiments indicate\nthat VisionUnite outperforms existing generative foundation models such as\nGPT-4V and Gemini Pro. It also demonstrates diagnostic capabilities comparable\nto junior ophthalmologists. VisionUnite performs well in various clinical\nscenarios including open-ended multi-disease diagnosis, clinical explanation,\nand patient interaction, making it a highly versatile tool for initial\nophthalmic disease screening. VisionUnite can also serve as an educational aid\nfor junior ophthalmologists, accelerating their acquisition of knowledge\nregarding both common and underrepresented ophthalmic conditions. VisionUnite\nrepresents a significant advancement in ophthalmology, with broad implications\nfor diagnostics, medical education, and understanding of disease mechanisms.\nThe source code is at https://github.com/HUANGLIZI/VisionUnite."}
{"id": "2410.05448", "pdf": "https://arxiv.org/pdf/2410.05448.pdf", "abs": "https://arxiv.org/abs/2410.05448", "title": "Task Diversity Shortens the ICL Plateau", "authors": ["Jaeyeon Kim", "Sehyun Kwon", "Joo Young Choi", "Jongho Park", "Jaewoong Cho", "Jason D. Lee", "Ernest K. Ryu"], "categories": ["cs.LG", "cs.CL"], "comment": null, "summary": "In-context learning (ICL) describes a language model's ability to generate\noutputs based on a set of input demonstrations and a subsequent query. To\nunderstand this remarkable capability, researchers have studied simplified,\nstylized models. These studies have consistently observed long loss plateaus,\nduring which models exhibit minimal improvement, followed by a sudden, rapid\nsurge of learning. In this work, we reveal that training on multiple diverse\nICL tasks simultaneously shortens the loss plateaus, making each task easier to\nlearn. This finding is surprising as it contradicts the natural intuition that\nthe combined complexity of multiple ICL tasks would lengthen the learning\nprocess, not shorten it. Our result suggests that the recent success in\nlarge-scale training of language models may be attributed not only to the\nrichness of the data at scale but also to the easier optimization (training)\ninduced by the diversity of natural language training data."}
{"id": "2411.02594", "pdf": "https://arxiv.org/pdf/2411.02594.pdf", "abs": "https://arxiv.org/abs/2411.02594", "title": "A Risk Taxonomy and Reflection Tool for Large Language Model Adoption in Public Health", "authors": ["Jiawei Zhou", "Amy Z. Chen", "Darshi Shah", "Laura M. Schwab Reese", "Munmun De Choudhury"], "categories": ["cs.HC", "cs.AI", "cs.CL", "H.5; J.3; K.4"], "comment": null, "summary": "Recent breakthroughs in large language models (LLMs) have generated both\ninterest and concern about their potential adoption as information sources or\ncommunication tools across different domains. In public health, where stakes\nare high and impacts extend across diverse populations, adopting LLMs poses\nunique challenges that require thorough evaluation. However, structured\napproaches for assessing potential risks in public health remain\nunder-explored. To address this gap, we conducted focus groups with public\nhealth professionals and individuals with lived experience to unpack their\nconcerns, situated across three distinct and critical public health issues that\ndemand high-quality information: infectious disease prevention (vaccines),\nchronic and well-being care (opioid use disorder), and community health and\nsafety (intimate partner violence). We synthesize participants' perspectives\ninto a risk taxonomy, identifying and contextualizing the potential harms LLMs\nmay introduce when positioned alongside traditional health communication. This\ntaxonomy highlights four dimensions of risk to individuals, human-centered\ncare, information ecosystem, and technology accountability. For each dimension,\nwe unpack specific risks and offer example reflection questions to help\npractitioners adopt a risk-reflexive approach. By summarizing distinctive LLM\ncharacteristics and linking them to identified risks, we discuss the need to\nrevisit prior mental models of information behaviors and complement evaluations\nwith external validity and domain expertise through lived experience and\nreal-world practices. Together, this work contributes a shared vocabulary and\nreflection tool for people in both computing and public health to\ncollaboratively anticipate, evaluate, and mitigate risks in deciding when to\nemploy LLM capabilities (or not) and how to mitigate harm."}
{"id": "2412.02141", "pdf": "https://arxiv.org/pdf/2412.02141.pdf", "abs": "https://arxiv.org/abs/2412.02141", "title": "WSI-LLaVA: A Multimodal Large Language Model for Whole Slide Image", "authors": ["Yuci Liang", "Xinheng Lyu", "Wenting Chen", "Meidan Ding", "Jipeng Zhang", "Xiangjian He", "Song Wu", "Xiaohan Xing", "Sen Yang", "Xiyue Wang", "Linlin Shen"], "categories": ["cs.CV", "cs.CL"], "comment": "ICCV 2025, 38 pages, 22 figures, 35 tables", "summary": "Recent advancements in computational pathology have produced patch-level\nMulti-modal Large Language Models (MLLMs), but these models are limited by\ntheir inability to analyze whole slide images (WSIs) comprehensively and their\ntendency to bypass crucial morphological features that pathologists rely on for\ndiagnosis. To address these challenges, we first introduce WSI-Bench, a\nlarge-scale morphology-aware benchmark containing 180k VQA pairs from 9,850\nWSIs across 30 cancer types, designed to evaluate MLLMs' understanding of\nmorphological characteristics crucial for accurate diagnosis. Building upon\nthis benchmark, we present WSI-LLaVA, a novel framework for gigapixel WSI\nunderstanding that employs a three-stage training approach: WSI-text alignment,\nfeature space alignment, and task-specific instruction tuning. To better assess\nmodel performance in pathological contexts, we develop two specialized WSI\nmetrics: WSI-Precision and WSI-Relevance. Experimental results demonstrate that\nWSI-LLaVA outperforms existing models across all capability dimensions, with a\nsignificant improvement in morphological analysis, establishing a clear\ncorrelation between morphological understanding and diagnostic accuracy."}
{"id": "2501.19383", "pdf": "https://arxiv.org/pdf/2501.19383.pdf", "abs": "https://arxiv.org/abs/2501.19383", "title": "Decoding-based Regression", "authors": ["Xingyou Song", "Dara Bahri"], "categories": ["cs.LG", "cs.AI", "cs.CL", "stat.ML"], "comment": "Published in Transactions on Machine Learning Research (TMLR) 2025.\n  Code can be found at\n  https://github.com/google-research/optformer/tree/main/optformer/decoding_regression", "summary": "Language models have recently been shown capable of performing regression\nwherein numeric predictions are represented as decoded strings. In this work,\nwe provide theoretical grounds for this capability and furthermore investigate\nthe utility of causal sequence decoding models as numeric regression heads\ngiven any feature representation. We find that, despite being trained in the\nusual way - for next-token prediction via cross-entropy loss - decoder-based\nheads are as performant as standard pointwise heads when benchmarked over\nstandard regression tasks, while being flexible enough to capture smooth\nnumeric distributions, such as in the task of density estimation."}
{"id": "2502.13135", "pdf": "https://arxiv.org/pdf/2502.13135.pdf", "abs": "https://arxiv.org/abs/2502.13135", "title": "Sleepless Nights, Sugary Days: Creating Synthetic Users with Health Conditions for Realistic Coaching Agent Interactions", "authors": ["Taedong Yun", "Eric Yang", "Mustafa Safdari", "Jong Ha Lee", "Vaishnavi Vinod Kumar", "S. Sara Mahdavi", "Jonathan Amar", "Derek Peyton", "Reut Aharony", "Andreas Michaelides", "Logan Schneider", "Isaac Galatzer-Levy", "Yugang Jia", "John Canny", "Arthur Gretton", "Maja Matarić"], "categories": ["cs.LG", "cs.AI", "cs.CL", "I.2.7"], "comment": "Published in Findings of the Association for Computational\n  Linguistics: ACL 2025", "summary": "We present an end-to-end framework for generating synthetic users for\nevaluating interactive agents designed to encourage positive behavior changes,\nsuch as in health and lifestyle coaching. The synthetic users are grounded in\nhealth and lifestyle conditions, specifically sleep and diabetes management in\nthis study, to ensure realistic interactions with the health coaching agent.\nSynthetic users are created in two stages: first, structured data are generated\ngrounded in real-world health and lifestyle factors in addition to basic\ndemographics and behavioral attributes; second, full profiles of the synthetic\nusers are developed conditioned on the structured data. Interactions between\nsynthetic users and the coaching agent are simulated using generative\nagent-based models such as Concordia, or directly by prompting a language\nmodel. Using two independently-developed agents for sleep and diabetes coaching\nas case studies, the validity of this framework is demonstrated by analyzing\nthe coaching agent's understanding of the synthetic users' needs and\nchallenges. Finally, through multiple blinded evaluations of user-coach\ninteractions by human experts, we demonstrate that our synthetic users with\nhealth and behavioral attributes more accurately portray real human users with\nthe same attributes, compared to generic synthetic users not grounded in such\nattributes. The proposed framework lays the foundation for efficient\ndevelopment of conversational agents through extensive, realistic, and grounded\nsimulated interactions."}
{"id": "2503.10331", "pdf": "https://arxiv.org/pdf/2503.10331.pdf", "abs": "https://arxiv.org/abs/2503.10331", "title": "OSMa-Bench: Evaluating Open Semantic Mapping Under Varying Lighting Conditions", "authors": ["Maxim Popov", "Regina Kurkova", "Mikhail Iumanov", "Jaafar Mahmoud", "Sergey Kolyubin"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.RO"], "comment": "Project page: https://be2rlab.github.io/OSMa-Bench/", "summary": "Open Semantic Mapping (OSM) is a key technology in robotic perception,\ncombining semantic segmentation and SLAM techniques. This paper introduces a\ndynamically configurable and highly automated LLM/LVLM-powered pipeline for\nevaluating OSM solutions called OSMa-Bench (Open Semantic Mapping Benchmark).\nThe study focuses on evaluating state-of-the-art semantic mapping algorithms\nunder varying indoor lighting conditions, a critical challenge in indoor\nenvironments. We introduce a novel dataset with simulated RGB-D sequences and\nground truth 3D reconstructions, facilitating the rigorous analysis of mapping\nperformance across different lighting conditions. Through experiments on\nleading models such as ConceptGraphs, BBQ and OpenScene, we evaluate the\nsemantic fidelity of object recognition and segmentation. Additionally, we\nintroduce a Scene Graph evaluation method to analyze the ability of models to\ninterpret semantic structure. The results provide insights into the robustness\nof these models, forming future research directions for developing resilient\nand adaptable robotic systems. Project page is available at\nhttps://be2rlab.github.io/OSMa-Bench/."}
{"id": "2504.06949", "pdf": "https://arxiv.org/pdf/2504.06949.pdf", "abs": "https://arxiv.org/abs/2504.06949", "title": "Adaptive Computation Pruning for the Forgetting Transformer", "authors": ["Zhixuan Lin", "Johan Obando-Ceron", "Xu Owen He", "Aaron Courville"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "Published as a conference paper at COLM 2025", "summary": "The recently proposed Forgetting Transformer (FoX) incorporates a forget gate\ninto softmax attention and has shown consistently better or on-par performance\ncompared to the standard RoPE-based Transformer. Notably, many attention heads\nin FoX tend to forget quickly, causing their output at each timestep to rely\nprimarily on local context. Based on this observation, we propose Adaptive\nComputation Pruning (ACP) for FoX, a method that dynamically prunes\ncomputations involving input-output dependencies that are strongly decayed by\nthe forget gate. In particular, our method performs provably safe pruning via a\ndynamically set pruning threshold that guarantees the pruned attention weights\nare negligible. We apply ACP to language model pretraining with FoX and show it\nconsistently reduces the number of FLOPs and memory accesses in softmax\nattention by around 70% across different model sizes and context lengths,\nresulting in a roughly 50% to 70% reduction in attention runtime (or a\n2-3$\\times$ speedup) and a roughly 10% to 40% increase in end-to-end training\nthroughput. Furthermore, longer context lengths yield greater computational\nsavings. All these speed improvements are achieved without any performance\ndegradation. Our code is available at\nhttps://github.com/zhixuan-lin/forgetting-transformer."}
{"id": "2505.21472", "pdf": "https://arxiv.org/pdf/2505.21472.pdf", "abs": "https://arxiv.org/abs/2505.21472", "title": "Mitigating Hallucination in Large Vision-Language Models via Adaptive Attention Calibration", "authors": ["Mehrdad Fazli", "Bowen Wei", "Ahmet Sari", "Ziwei Zhu"], "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Large vision-language models (LVLMs) achieve impressive performance on\nmultimodal tasks but often suffer from hallucination, and confidently describe\nobjects or attributes not present in the image. Current training-free\ninterventions struggle to maintain accuracy in open-ended and long-form\ngeneration scenarios. We introduce the Confidence-Aware Attention Calibration\n(CAAC) framework to address this challenge by targeting two key biases: spatial\nperception bias, which distributes attention disproportionately across image\ntokens, and modality bias, which shifts focus from visual to textual inputs\nover time. CAAC employs a two-step approach: Visual-Token Calibration (VTC) to\nbalance attention across visual tokens, and Adaptive Attention Re-Scaling (AAR)\nto reinforce visual grounding guided by the model's confidence. This\nconfidence-driven adjustment ensures consistent visual alignment during\ngeneration. Experiments on CHAIR, AMBER, and POPE benchmarks demonstrate that\nCAAC outperforms baselines, particularly in long-form generations, effectively\nreducing hallucination."}
{"id": "2506.08835", "pdf": "https://arxiv.org/pdf/2506.08835.pdf", "abs": "https://arxiv.org/abs/2506.08835", "title": "CulturalFrames: Assessing Cultural Expectation Alignment in Text-to-Image Models and Evaluation Metrics", "authors": ["Shravan Nayak", "Mehar Bhatia", "Xiaofeng Zhang", "Verena Rieser", "Lisa Anne Hendricks", "Sjoerd van Steenkiste", "Yash Goyal", "Karolina Stańczak", "Aishwarya Agrawal"], "categories": ["cs.CV", "cs.AI", "cs.CL"], "comment": null, "summary": "The increasing ubiquity of text-to-image (T2I) models as tools for visual\ncontent generation raises concerns about their ability to accurately represent\ndiverse cultural contexts -- where missed cues can stereotype communities and\nundermine usability. In this work, we present the first study to systematically\nquantify the alignment of T2I models and evaluation metrics with respect to\nboth explicit (stated) as well as implicit (unstated, implied by the prompt's\ncultural context) cultural expectations. To this end, we introduce\nCulturalFrames, a novel benchmark designed for rigorous human evaluation of\ncultural representation in visual generations. Spanning 10 countries and 5\nsocio-cultural domains, CulturalFrames comprises 983 prompts, 3637\ncorresponding images generated by 4 state-of-the-art T2I models, and over 10k\ndetailed human annotations. We find that across models and countries, cultural\nexpectations are missed an average of 44% of the time. Among these failures,\nexplicit expectations are missed at a surprisingly high average rate of 68%,\nwhile implicit expectation failures are also significant, averaging 49%.\nFurthermore, we show that existing T2I evaluation metrics correlate poorly with\nhuman judgments of cultural alignment, irrespective of their internal\nreasoning. Collectively, our findings expose critical gaps, provide a concrete\ntestbed, and outline actionable directions for developing culturally informed\nT2I models and metrics that improve global usability."}
{"id": "2506.14805", "pdf": "https://arxiv.org/pdf/2506.14805.pdf", "abs": "https://arxiv.org/abs/2506.14805", "title": "Argus Inspection: Do Multimodal Large Language Models Possess the Eye of Panoptes?", "authors": ["Yang Yao", "Lingyu Li", "Jiaxin Song", "Chiyu Chen", "Zhenqi He", "Yixu Wang", "Xin Wang", "Tianle Gu", "Jie Li", "Yan Teng", "Yingchun Wang"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG", "cs.MM"], "comment": null, "summary": "As Multimodal Large Language Models (MLLMs) continue to evolve, their\ncognitive and reasoning capabilities have seen remarkable progress. However,\nchallenges in visual fine-grained perception and commonsense causal inference\npersist. This paper introduces Argus Inspection, a multimodal benchmark with\ntwo levels of difficulty, emphasizing detailed visual recognition while\nincorporating real-world commonsense understanding to evaluate causal reasoning\nabilities. Expanding on it, we present the Eye of Panoptes framework, which\nintegrates a binary parametric Sigmoid metric with an indicator function,\nenabling a more holistic evaluation of MLLMs' responses in opinion-based\nreasoning tasks. Experiments conducted on 26 mainstream MLLMs reveal that the\nhighest performance in visual fine-grained reasoning reaches only 0.46,\nhighlighting considerable potential for enhancement. Our research offers\nvaluable perspectives for the continued refinement of MLLMs."}
{"id": "2508.00414", "pdf": "https://arxiv.org/pdf/2508.00414.pdf", "abs": "https://arxiv.org/abs/2508.00414", "title": "Cognitive Kernel-Pro: A Framework for Deep Research Agents and Agent Foundation Models Training", "authors": ["Tianqing Fang", "Zhisong Zhang", "Xiaoyang Wang", "Rui Wang", "Can Qin", "Yuxuan Wan", "Jun-Yu Ma", "Ce Zhang", "Jiaqi Chen", "Xiyun Li", "Hongming Zhang", "Haitao Mi", "Dong Yu"], "categories": ["cs.AI", "cs.CL"], "comment": "16 pages", "summary": "General AI Agents are increasingly recognized as foundational frameworks for\nthe next generation of artificial intelligence, enabling complex reasoning, web\ninteraction, coding, and autonomous research capabilities. However, current\nagent systems are either closed-source or heavily reliant on a variety of paid\nAPIs and proprietary tools, limiting accessibility and reproducibility for the\nresearch community. In this work, we present \\textbf{Cognitive Kernel-Pro}, a\nfully open-source and (to the maximum extent) free multi-module agent framework\ndesigned to democratize the development and evaluation of advanced AI agents.\nWithin Cognitive Kernel-Pro, we systematically investigate the curation of\nhigh-quality training data for Agent Foundation Models, focusing on the\nconstruction of queries, trajectories, and verifiable answers across four key\ndomains: web, file, code, and general reasoning. Furthermore, we explore novel\nstrategies for agent test-time reflection and voting to enhance agent\nrobustness and performance. We evaluate Cognitive Kernel-Pro on GAIA, achieving\nstate-of-the-art results among open-source and free agents. Notably, our\n8B-parameter open-source model surpasses previous leading systems such as\nWebDancer and WebSailor, establishing a new performance standard for\naccessible, high-capability AI agents. Code is available at\nhttps://github.com/Tencent/CognitiveKernel-Pro"}
{"id": "2508.00589", "pdf": "https://arxiv.org/pdf/2508.00589.pdf", "abs": "https://arxiv.org/abs/2508.00589", "title": "Context-based Motion Retrieval using Open Vocabulary Methods for Autonomous Driving", "authors": ["Stefan Englmeier", "Max A. Büttner", "Katharina Winter", "Fabian B. Flohr"], "categories": ["cs.CV", "cs.CL", "cs.IR", "cs.RO"], "comment": "Project page: https://iv.ee.hm.edu/contextmotionclip/; This work has\n  been submitted to the IEEE for possible publication", "summary": "Autonomous driving systems must operate reliably in safety-critical\nscenarios, particularly those involving unusual or complex behavior by\nVulnerable Road Users (VRUs). Identifying these edge cases in driving datasets\nis essential for robust evaluation and generalization, but retrieving such rare\nhuman behavior scenarios within the long tail of large-scale datasets is\nchallenging. To support targeted evaluation of autonomous driving systems in\ndiverse, human-centered scenarios, we propose a novel context-aware motion\nretrieval framework. Our method combines Skinned Multi-Person Linear\n(SMPL)-based motion sequences and corresponding video frames before encoding\nthem into a shared multimodal embedding space aligned with natural language.\nOur approach enables the scalable retrieval of human behavior and their context\nthrough text queries. This work also introduces our dataset WayMoCo, an\nextension of the Waymo Open Dataset. It contains automatically labeled motion\nand scene context descriptions derived from generated pseudo-ground-truth SMPL\nsequences and corresponding image data. Our approach outperforms\nstate-of-the-art models by up to 27.5% accuracy in motion-context retrieval,\nwhen evaluated on the WayMoCo dataset."}
{"id": "2508.02124", "pdf": "https://arxiv.org/pdf/2508.02124.pdf", "abs": "https://arxiv.org/abs/2508.02124", "title": "Trainable Dynamic Mask Sparse Attention", "authors": ["Jingze Shi", "Yifan Wu", "Bingheng Wu", "Yiran Peng", "Liangdong Wang", "Guang Liu", "Yuyu Luo"], "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": "8 figures, 4 tables", "summary": "In large language models, the demand for modeling long contexts is constantly\nincreasing, but the quadratic complexity of the standard self-attention\nmechanism often becomes a bottleneck. Although existing sparse attention\nmechanisms have improved efficiency, they may still encounter issues such as\nstatic patterns or information loss. We introduce a trainable dynamic mask\nsparse attention mechanism, Dynamic Mask Attention, which effectively utilizes\ncontent-aware and position-aware sparsity. DMA achieves this through two key\ninnovations: First, it dynamically generates content-aware sparse masks from\nvalue representations, enabling the model to identify and focus on critical\ninformation adaptively. Second, it implements position-aware sparse attention\ncomputation that effectively skips unnecessary calculation regions. This\ndual-sparsity design allows the model to significantly reduce the computational\ncomplexity of important information while retaining complete information,\nachieving an excellent balance between information fidelity and computational\nefficiency. We have verified the performance of DMA through comprehensive\nexperiments. Comparative studies show that DMA outperforms multi-head\nattention, sliding window attention, multi-head latent attention, and native\nsparse attention in terms of perplexity under Chinchilla Scaling Law settings.\nMoreover, in challenging multi-query associative recall tasks, DMA also\ndemonstrates superior performance and efficiency compared to these methods.\nCrucially, in the evaluation of a 1.7B parameter model, DMA significantly\noutperforms multi-head attention in both standard benchmark performance and the\nchallenging needle-in-a-haystack task. These experimental results highlight its\ncapability to balance model efficiency and long-context modeling ability\neffectively."}
{"id": "2508.04586", "pdf": "https://arxiv.org/pdf/2508.04586.pdf", "abs": "https://arxiv.org/abs/2508.04586", "title": "Position: The Current AI Conference Model is Unsustainable! Diagnosing the Crisis of Centralized AI Conference", "authors": ["Nuo Chen", "Moming Duan", "Andre Huikai Lin", "Qian Wang", "Jiaying Wu", "Bingsheng He"], "categories": ["cs.CY", "cs.AI", "cs.CL"], "comment": "Preprint", "summary": "Artificial Intelligence (AI) conferences are essential for advancing\nresearch, sharing knowledge, and fostering academic community. However, their\nrapid expansion has rendered the centralized conference model increasingly\nunsustainable. This paper offers a data-driven diagnosis of a structural crisis\nthat threatens the foundational goals of scientific dissemination, equity, and\ncommunity well-being. We identify four key areas of strain: (1) scientifically,\nwith per-author publication rates more than doubling over the past decade to\nover 4.5 papers annually; (2) environmentally, with the carbon footprint of a\nsingle conference exceeding the daily emissions of its host city; (3)\npsychologically, with 71% of online community discourse reflecting negative\nsentiment and 35% referencing mental health concerns; and (4) logistically,\nwith attendance at top conferences such as NeurIPS 2024 beginning to outpace\nvenue capacity. These pressures point to a system that is misaligned with its\ncore mission. In response, we propose the Community-Federated Conference (CFC)\nmodel, which separates peer review, presentation, and networking into globally\ncoordinated but locally organized components, offering a more sustainable,\ninclusive, and resilient path forward for AI research."}
{"id": "2508.04700", "pdf": "https://arxiv.org/pdf/2508.04700.pdf", "abs": "https://arxiv.org/abs/2508.04700", "title": "SEAgent: Self-Evolving Computer Use Agent with Autonomous Learning from Experience", "authors": ["Zeyi Sun", "Ziyu Liu", "Yuhang Zang", "Yuhang Cao", "Xiaoyi Dong", "Tong Wu", "Dahua Lin", "Jiaqi Wang"], "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG", "cs.MA", "cs.MM"], "comment": "Code at https://github.com/SunzeY/SEAgent", "summary": "Repurposing large vision-language models (LVLMs) as computer use agents\n(CUAs) has led to substantial breakthroughs, primarily driven by human-labeled\ndata. However, these models often struggle with novel and specialized software,\nparticularly in scenarios lacking human annotations. To address this challenge,\nwe propose SEAgent, an agentic self-evolving framework enabling CUAs to\nautonomously evolve through interactions with unfamiliar software.\nSpecifically, SEAgent empowers computer-use agents to autonomously master novel\nsoftware environments via experiential learning, where agents explore new\nsoftware, learn through iterative trial-and-error, and progressively tackle\nauto-generated tasks organized from simple to complex. To achieve this goal, we\ndesign a World State Model for step-wise trajectory assessment, along with a\nCurriculum Generator that generates increasingly diverse and challenging tasks.\nThe agent's policy is updated through experiential learning, comprised of\nadversarial imitation of failure actions and Group Relative Policy Optimization\n(GRPO) on successful ones. Furthermore, we introduce a specialist-to-generalist\ntraining strategy that integrates individual experiential insights from\nspecialist agents, facilitating the development of a stronger generalist CUA\ncapable of continuous autonomous evolution. This unified agent ultimately\nachieves performance surpassing ensembles of individual specialist agents on\ntheir specialized software. We validate the effectiveness of SEAgent across\nfive novel software environments within OS-World. Our approach achieves a\nsignificant improvement of 23.2% in success rate, from 11.3% to 34.5%, over a\ncompetitive open-source CUA, i.e., UI-TARS."}
{"id": "2508.04946", "pdf": "https://arxiv.org/pdf/2508.04946.pdf", "abs": "https://arxiv.org/abs/2508.04946", "title": "REINA: Regularized Entropy Information-Based Loss for Efficient Simultaneous Speech Translation", "authors": ["Nameer Hirschkind", "Joseph Liu", "Xiao Yu", "Mahesh Kumar Nandwana"], "categories": ["cs.LG", "cs.CL", "eess.AS"], "comment": null, "summary": "Simultaneous Speech Translation (SimulST) systems stream in audio while\nsimultaneously emitting translated text or speech. Such systems face the\nsignificant challenge of balancing translation quality and latency. We\nintroduce a strategy to optimize this tradeoff: wait for more input only if you\ngain information by doing so. Based on this strategy, we present Regularized\nEntropy INformation Adaptation (REINA), a novel loss to train an adaptive\npolicy using an existing non-streaming translation model. We derive REINA from\ninformation theory principles and show that REINA helps push the reported\nPareto frontier of the latency/quality tradeoff over prior works. Utilizing\nREINA, we train a SimulST model on French, Spanish and German, both from and\ninto English. Training on only open source or synthetically generated data, we\nachieve state-of-the-art (SOTA) streaming results for models of comparable\nsize. We also introduce a metric for streaming efficiency, quantitatively\nshowing REINA improves the latency/quality trade-off by as much as 21% compared\nto prior approaches, normalized against non-streaming baseline BLEU scores."}
{"id": "2508.06944", "pdf": "https://arxiv.org/pdf/2508.06944.pdf", "abs": "https://arxiv.org/abs/2508.06944", "title": "AMFT: Aligning LLM Reasoners by Meta-Learning the Optimal Imitation-Exploration Balance", "authors": ["Lixuan He", "Jie Feng", "Yong Li"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.CV"], "comment": "https://github.com/hlxtsyj/AMFT", "summary": "Large Language Models (LLMs) are typically fine-tuned for reasoning tasks\nthrough a two-stage pipeline of Supervised Fine-Tuning (SFT) followed by\nReinforcement Learning (RL), a process fraught with catastrophic forgetting and\nsuboptimal trade-offs between imitation and exploration. Recent single-stage\nmethods attempt to unify SFT and RL using heuristics, but lack a principled\nmechanism for dynamically balancing the two paradigms. In this paper, we\nreframe this challenge through the theoretical lens of \\textbf{implicit\nrewards}, viewing SFT and RL not as distinct methods but as complementary\nreward signals. We introduce \\textbf{Adaptive Meta Fine-Tuning (AMFT)}, a novel\nsingle-stage algorithm that learns the optimal balance between SFT's implicit,\npath-level reward and RL's explicit, outcome-based reward. The core of AMFT is\na \\textbf{meta-gradient adaptive weight controller} that treats the SFT-RL\nbalance as a learnable parameter, dynamically optimizing it to maximize\nlong-term task performance. This forward-looking approach, regularized by\npolicy entropy for stability, autonomously discovers an effective training\ncurriculum. We conduct a comprehensive evaluation on challenging benchmarks\nspanning mathematical reasoning, abstract visual reasoning (General Points),\nand vision-language navigation (V-IRL). AMFT consistently establishes a new\nstate-of-the-art and demonstrats superior generalization on out-of-distribution\n(OOD) tasks. Ablation studies and training dynamic analysis confirm that the\nmeta-learning controller is crucial for AMFT's stability, sample efficiency,\nand performance, offering a more principled and effective paradigm for LLM\nalignment. Our codes are open-sourced via https://github.com/hlxtsyj/AMFT."}
{"id": "2508.07014", "pdf": "https://arxiv.org/pdf/2508.07014.pdf", "abs": "https://arxiv.org/abs/2508.07014", "title": "TurboBias: Universal ASR Context-Biasing powered by GPU-accelerated Phrase-Boosting Tree", "authors": ["Andrei Andrusenko", "Vladimir Bataev", "Lilit Grigoryan", "Vitaly Lavrukhin", "Boris Ginsburg"], "categories": ["eess.AS", "cs.AI", "cs.CL", "cs.SD"], "comment": "Accepted to ASRU 2025", "summary": "Recognizing specific key phrases is an essential task for contextualized\nAutomatic Speech Recognition (ASR). However, most existing context-biasing\napproaches have limitations associated with the necessity of additional model\ntraining, significantly slow down the decoding process, or constrain the choice\nof the ASR system type. This paper proposes a universal ASR context-biasing\nframework that supports all major types: CTC, Transducers, and Attention\nEncoder-Decoder models. The framework is based on a GPU-accelerated word\nboosting tree, which enables it to be used in shallow fusion mode for greedy\nand beam search decoding without noticeable speed degradation, even with a vast\nnumber of key phrases (up to 20K items). The obtained results showed high\nefficiency of the proposed method, surpassing the considered open-source\ncontext-biasing approaches in accuracy and decoding speed. Our context-biasing\nframework is open-sourced as a part of the NeMo toolkit."}
{"id": "2508.07629", "pdf": "https://arxiv.org/pdf/2508.07629.pdf", "abs": "https://arxiv.org/abs/2508.07629", "title": "Klear-Reasoner: Advancing Reasoning Capability via Gradient-Preserving Clipping Policy Optimization", "authors": ["Zhenpeng Su", "Leiyu Pan", "Xue Bai", "Dening Liu", "Guanting Dong", "Jiaming Huang", "Wenping Hu", "Fuzheng Zhang", "Kun Gai", "Guorui Zhou"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "We present Klear-Reasoner, a model with long reasoning capabilities that\ndemonstrates careful deliberation during problem solving, achieving outstanding\nperformance across multiple benchmarks. Although there are already many\nexcellent works related to inference models in the current community, there are\nstill many problems with reproducing high-performance inference models due to\nincomplete disclosure of training details. This report provides an in-depth\nanalysis of the reasoning model, covering the entire post-training workflow\nfrom data preparation and long Chain-of-Thought supervised fine-tuning (long\nCoT SFT) to reinforcement learning (RL), along with detailed ablation studies\nfor each experimental component. For SFT data, our experiments show that a\nsmall number of high-quality data sources are more effective than a large\nnumber of diverse data sources, and that difficult samples can achieve better\nresults without accuracy filtering. In addition, we investigate two key issues\nwith current clipping mechanisms in RL: Clipping suppresses critical\nexploration signals and ignores suboptimal trajectories. To address these\nchallenges, we propose Gradient-Preserving clipping Policy Optimization (GPPO)\nthat gently backpropagates gradients from clipped tokens. GPPO not only\nenhances the model's exploration capacity but also improves its efficiency in\nlearning from negative samples. Klear-Reasoner exhibits exceptional reasoning\nabilities in mathematics and programming, scoring 90.5% on AIME 2024, 83.2% on\nAIME 2025, 66.0% on LiveCodeBench V5 and 58.1% on LiveCodeBench V6."}
{"id": "2508.08039", "pdf": "https://arxiv.org/pdf/2508.08039.pdf", "abs": "https://arxiv.org/abs/2508.08039", "title": "Audio-Thinker: Guiding Audio Language Model When and How to Think via Reinforcement Learning", "authors": ["Shu Wu", "Chenxing Li", "Wenfu Wang", "Hao Zhang", "Hualei Wang", "Meng Yu", "Dong Yu"], "categories": ["cs.SD", "cs.CL", "cs.MM", "eess.AS"], "comment": "preprint", "summary": "Recent advancements in large language models, multimodal large language\nmodels, and large audio language models (LALMs) have significantly improved\ntheir reasoning capabilities through reinforcement learning with rule-based\nrewards. However, the explicit reasoning process has yet to show significant\nbenefits for audio question answering, and effectively leveraging deep\nreasoning remains an open challenge, with LALMs still falling short of\nhuman-level auditory-language reasoning. To address these limitations, we\npropose Audio-Thinker, a reinforcement learning framework designed to enhance\nthe reasoning capabilities of LALMs, with a focus on improving adaptability,\nconsistency, and effectiveness. Our approach introduces an adaptive think\naccuracy reward, enabling the model to adjust its reasoning strategies based on\ntask complexity dynamically. Furthermore, we incorporate an external reward\nmodel to evaluate the overall consistency and quality of the reasoning process,\ncomplemented by think-based rewards that help the model distinguish between\nvalid and flawed reasoning paths during training. Experimental results\ndemonstrate that our Audio-Thinker model outperforms existing\nreasoning-oriented LALMs across various benchmark tasks, exhibiting superior\nreasoning and generalization capabilities."}
