{"id": "2507.08002", "pdf": "https://arxiv.org/pdf/2507.08002.pdf", "abs": "https://arxiv.org/abs/2507.08002", "title": "Human vs. LLM-Based Thematic Analysis for Digital Mental Health Research: Proof-of-Concept Comparative Study", "authors": ["Karisa Parkington", "Bazen G. Teferra", "Marianne Rouleau-Tang", "Argyrios Perivolaris", "Alice Rueda", "Adam Dubrowski", "Bill Kapralos", "Reza Samavi", "Andrew Greenshaw", "Yanbo Zhang", "Bo Cao", "Yuqi Wu", "Sirisha Rambhatla", "Sridhar Krishnan", "Venkat Bhat"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "Thematic analysis provides valuable insights into participants' experiences\nthrough coding and theme development, but its resource-intensive nature limits\nits use in large healthcare studies. Large language models (LLMs) can analyze\ntext at scale and identify key content automatically, potentially addressing\nthese challenges. However, their application in mental health interviews needs\ncomparison with traditional human analysis. This study evaluates out-of-the-box\nand knowledge-base LLM-based thematic analysis against traditional methods\nusing transcripts from a stress-reduction trial with healthcare workers.\nOpenAI's GPT-4o model was used along with the Role, Instructions, Steps,\nEnd-Goal, Narrowing (RISEN) prompt engineering framework and compared to human\nanalysis in Dedoose. Each approach developed codes, noted saturation points,\napplied codes to excerpts for a subset of participants (n = 20), and\nsynthesized data into themes. Outputs and performance metrics were compared\ndirectly. LLMs using the RISEN framework developed deductive parent codes\nsimilar to human codes, but humans excelled in inductive child code development\nand theme synthesis. Knowledge-based LLMs reached coding saturation with fewer\ntranscripts (10-15) than the out-of-the-box model (15-20) and humans (90-99).\nThe out-of-the-box LLM identified a comparable number of excerpts to human\nresearchers, showing strong inter-rater reliability (K = 0.84), though the\nknowledge-based LLM produced fewer excerpts. Human excerpts were longer and\ninvolved multiple codes per excerpt, while LLMs typically applied one code.\nOverall, LLM-based thematic analysis proved more cost-effective but lacked the\ndepth of human analysis. LLMs can transform qualitative analysis in mental\nhealthcare and clinical research when combined with human oversight to balance\nparticipant perspectives and research resources."}
{"id": "2507.08003", "pdf": "https://arxiv.org/pdf/2507.08003.pdf", "abs": "https://arxiv.org/abs/2507.08003", "title": "A Versatile Dataset of Mouse and Eye Movements on Search Engine Results Pages", "authors": ["Kayhan Latifzadeh", "Jacek Gwizdka", "Luis A. Leiva"], "categories": ["cs.HC", "cs.CV", "cs.IR"], "comment": null, "summary": "We contribute a comprehensive dataset to study user attention and purchasing\nbehavior on Search Engine Result Pages (SERPs). Previous work has relied on\nmouse movements as a low-cost large-scale behavioral proxy but also has relied\non self-reported ground-truth labels, collected at post-task, which can be\ninaccurate and prone to biases. To address this limitation, we use an eye\ntracker to construct an objective ground-truth of continuous visual attention.\nOur dataset comprises 2,776 transactional queries on Google SERPs, collected\nfrom 47 participants, and includes: (1) HTML source files, with CSS and images;\n(2) rendered SERP screenshots; (3) eye movement data; (4) mouse movement data;\n(5) bounding boxes of direct display and organic advertisements; and (6)\nscripts for further preprocessing the data. In this paper we provide an\noverview of the dataset and baseline experiments (classification tasks) that\ncan inspire researchers about the different possibilities for future work."}
{"id": "2507.08028", "pdf": "https://arxiv.org/pdf/2507.08028.pdf", "abs": "https://arxiv.org/abs/2507.08028", "title": "SSSUMO: Real-Time Semi-Supervised Submovement Decomposition", "authors": ["Evgenii Rudakov", "Jonathan Shock", "Otto Lappi", "Benjamin Ultan Cowley"], "categories": ["cs.HC", "cs.AI", "cs.CV"], "comment": null, "summary": "This paper introduces a SSSUMO, semi-supervised deep learning approach for\nsubmovement decomposition that achieves state-of-the-art accuracy and speed.\nWhile submovement analysis offers valuable insights into motor control,\nexisting methods struggle with reconstruction accuracy, computational cost, and\nvalidation, due to the difficulty of obtaining hand-labeled data. We address\nthese challenges using a semi-supervised learning framework. This framework\nlearns from synthetic data, initially generated from minimum-jerk principles\nand then iteratively refined through adaptation to unlabeled human movement\ndata. Our fully convolutional architecture with differentiable reconstruction\nsignificantly surpasses existing methods on both synthetic and diverse human\nmotion datasets, demonstrating robustness even in high-noise conditions.\nCrucially, the model operates in real-time (less than a millisecond per input\nsecond), a substantial improvement over optimization-based techniques. This\nenhanced performance facilitates new applications in human-computer\ninteraction, rehabilitation medicine, and motor control studies. We demonstrate\nthe model's effectiveness across diverse human-performed tasks such as\nsteering, rotation, pointing, object moving, handwriting, and mouse-controlled\ngaming, showing notable improvements particularly on challenging datasets where\ntraditional methods largely fail. Training and benchmarking source code, along\nwith pre-trained model weights, are made publicly available at\nhttps://github.com/dolphin-in-a-coma/sssumo."}
{"id": "2507.08142", "pdf": "https://arxiv.org/pdf/2507.08142.pdf", "abs": "https://arxiv.org/abs/2507.08142", "title": "Pushing the Boundaries of Immersion and Storytelling: A Technical Review of Unreal Engine", "authors": ["Oleksandra Sobchyshak", "Santiago Berrezueta-Guzman", "Stefan Wagner"], "categories": ["cs.HC"], "comment": "Paper submitted to Elsevier", "summary": "Unreal Engine is a platform that has influenced immersive storytelling and\nvirtual reality (VR) through its advanced features and diverse applications.\nThis paper provides an in-depth technical review of Unreal Engine. It analyzes\nits key innovations in creating hyper-realistic environments and emotionally\nengaging narratives, with significant applications in gaming, virtual\nproduction, education, cultural preservation, and healthcare. The findings of\nthis article highlight Unreal Engine's transformative impact across industries,\ndemonstrating its ability to merge storytelling with cutting-edge technologies.\nCase studies illustrate how Unreal Engine facilitates seamless visuals, audio,\nand interactivity integration to create compelling experiences. Additionally,\nthis study identifies Unreal Engine's versatility in applications ranging from\nprocedural content generation and AI-driven workflows to smart city simulations\nand VR-based rehabilitation programs.\n  While Unreal Engine sets new benchmarks for visual fidelity and\ninteractivity, this paper underscores critical challenges, including its high\nhardware demands, limited accessibility, and ethical concerns related to\nover-immersion and data privacy. Addressing these challenges through\ncloud-based rendering, inclusive design, and ethical practices is essential for\nbroader adoption and sustainability. This review concludes that Unreal Engine\nis suitable for innovation and interdisciplinary collaboration. Its ability to\nempower creators, redefine workflows, and push the boundaries of immersive\nstorytelling positions Unreal Engine as pivotal in shaping the future of\nvirtual reality and interactive media."}
{"id": "2507.08012", "pdf": "https://arxiv.org/pdf/2507.08012.pdf", "abs": "https://arxiv.org/abs/2507.08012", "title": "RepeaTTS: Towards Feature Discovery through Repeated Fine-Tuning", "authors": ["Atli Sigurgeirsson", "Simon King"], "categories": ["cs.CL", "cs.AI", "cs.SD", "eess.AS"], "comment": null, "summary": "A Prompt-based Text-To-Speech model allows a user to control different\naspects of speech, such as speaking rate and perceived gender, through natural\nlanguage instruction. Although user-friendly, such approaches are on one hand\nconstrained: control is limited to acoustic features exposed to the model\nduring training, and too flexible on the other: the same inputs yields\nuncontrollable variation that are reflected in the corpus statistics.\n  We investigate a novel fine-tuning regime to address both of these issues at\nthe same time by exploiting the uncontrollable variance of the model. Through\nprincipal component analysis of thousands of synthesised samples, we determine\nlatent features that account for the highest proportion of the output variance\nand incorporate them as new labels for secondary fine-tuning. We evaluate the\nproposed methods on two models trained on an expressive Icelandic speech\ncorpus, one with emotional disclosure and one without. In the case of the model\nwithout emotional disclosure, the method yields both continuous and discrete\nfeatures that improve overall controllability of the model."}
{"id": "2507.08167", "pdf": "https://arxiv.org/pdf/2507.08167.pdf", "abs": "https://arxiv.org/abs/2507.08167", "title": "Emotion Detection in Older Adults Using Physiological Signals from Wearable Sensors", "authors": ["Md. Saif Hassan Onim", "Andrew M. Kiselica", "Himanshu Thapliyal"], "categories": ["cs.HC", "cs.LG", "H.1.2; J.3; C.3"], "comment": null, "summary": "Emotion detection in older adults is crucial for understanding their\ncognitive and emotional well-being, especially in hospital and assisted living\nenvironments. In this work, we investigate an edge-based, non-obtrusive\napproach to emotion identification that uses only physiological signals\nobtained via wearable sensors. Our dataset includes data from 40 older\nindividuals. Emotional states were obtained using physiological signals from\nthe Empatica E4 and Shimmer3 GSR+ wristband and facial expressions were\nrecorded using camera-based emotion recognition with the iMotion's Facial\nExpression Analysis (FEA) module. The dataset also contains twelve emotion\ncategories in terms of relative intensities. We aim to study how well emotion\nrecognition can be accomplished using simply physiological sensor data, without\nthe requirement for cameras or intrusive facial analysis. By leveraging\nclassical machine learning models, we predict the intensity of emotional\nresponses based on physiological signals. We achieved the highest 0.782 r2\nscore with the lowest 0.0006 MSE on the regression task. This method has\nsignificant implications for individuals with Alzheimer's Disease and Related\nDementia (ADRD), as well as veterans coping with Post-Traumatic Stress Disorder\n(PTSD) or other cognitive impairments. Our results across multiple classical\nregression models validate the feasibility of this method, paving the way for\nprivacy-preserving and efficient emotion recognition systems in real-world\nsettings."}
{"id": "2507.08013", "pdf": "https://arxiv.org/pdf/2507.08013.pdf", "abs": "https://arxiv.org/abs/2507.08013", "title": "MedicalBERT: enhancing biomedical natural language processing using pretrained BERT-based model", "authors": ["K. Sahit Reddy", "N. Ragavenderan", "Vasanth K.", "Ganesh N. Naik", "Vishalakshi Prabhu", "Nagaraja G. S"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Recent advances in natural language processing (NLP) have been driven\nbypretrained language models like BERT, RoBERTa, T5, and GPT. Thesemodels excel\nat understanding complex texts, but biomedical literature, withits\ndomain-specific terminology, poses challenges that models likeWord2Vec and\nbidirectional long short-term memory (Bi-LSTM) can't fullyaddress. GPT and T5,\ndespite capturing context, fall short in tasks needingbidirectional\nunderstanding, unlike BERT. Addressing this, we proposedMedicalBERT, a\npretrained BERT model trained on a large biomedicaldataset and equipped with\ndomain-specific vocabulary that enhances thecomprehension of biomedical\nterminology. MedicalBERT model is furtheroptimized and fine-tuned to address\ndiverse tasks, including named entityrecognition, relation extraction, question\nanswering, sentence similarity, anddocument classification. Performance metrics\nsuch as the F1-score,accuracy, and Pearson correlation are employed to showcase\nthe efficiencyof our model in comparison to other BERT-based models such as\nBioBERT,SciBERT, and ClinicalBERT. MedicalBERT outperforms these models onmost\nof the benchmarks, and surpasses the general-purpose BERT model by5.67% on\naverage across all the tasks evaluated respectively. This work alsounderscores\nthe potential of leveraging pretrained BERT models for medicalNLP tasks,\ndemonstrating the effectiveness of transfer learning techniques incapturing\ndomain-specific information.\n  (PDF) MedicalBERT: enhancing biomedical natural language processing using\npretrained BERT-based model. Available from:\nhttps://www.researchgate.net/publication/392489050_MedicalBERT_enhancing_biomedical_natural_language_processing_using_pretrained_BERT-based_model\n[accessed Jul 06 2025]."}
{"id": "2507.08230", "pdf": "https://arxiv.org/pdf/2507.08230.pdf", "abs": "https://arxiv.org/abs/2507.08230", "title": "Uncanny or Not? Perceptions of AI-Generated Faces in Autism", "authors": ["Gabriella Waters"], "categories": ["cs.HC"], "comment": "2 figures, 15 pages", "summary": "As artificial intelligence (AI) systems become increasingly sophisticated at\ngenerating synthetic human faces, understanding how these images are perceived\nacross diverse populations is important. This study investigates how autistic\nindividuals/individuals with autism perceive AI-generated faces, focusing on\nthe uncanny valley effect. Using a qualitative approach, we analyzed\ndiscussions from the r/autism community on Reddit to explore how autistic\nparticipants/participants with autism describe their experiences with\nAI-generated faces and the uncanny valley phenomenon. The findings suggest that\nautistic people/people with autism may experience the uncanny valley\ndifferently, often reporting stronger discomfort with real human faces than\nwith artificial ones. This research contributes to our understanding of visual\nperception in autism and has implications for the development of inclusive AI\nsystems and assistive technologies."}
{"id": "2507.08014", "pdf": "https://arxiv.org/pdf/2507.08014.pdf", "abs": "https://arxiv.org/abs/2507.08014", "title": "Mass-Scale Analysis of In-the-Wild Conversations Reveals Complexity Bounds on LLM Jailbreaking", "authors": ["Aldan Creo", "Raul Castro Fernandez", "Manuel Cebrian"], "categories": ["cs.CL", "cs.AI", "cs.CY"], "comment": "Code: https://github.com/ACMCMC/risky-conversations Results:\n  https://huggingface.co/risky-conversations Visualizer:\n  https://huggingface.co/spaces/risky-conversations/Visualizer", "summary": "As large language models (LLMs) become increasingly deployed, understanding\nthe complexity and evolution of jailbreaking strategies is critical for AI\nsafety.\n  We present a mass-scale empirical analysis of jailbreak complexity across\nover 2 million real-world conversations from diverse platforms, including\ndedicated jailbreaking communities and general-purpose chatbots. Using a range\nof complexity metrics spanning probabilistic measures, lexical diversity,\ncompression ratios, and cognitive load indicators, we find that jailbreak\nattempts do not exhibit significantly higher complexity than normal\nconversations. This pattern holds consistently across specialized jailbreaking\ncommunities and general user populations, suggesting practical bounds on attack\nsophistication. Temporal analysis reveals that while user attack toxicity and\ncomplexity remains stable over time, assistant response toxicity has decreased,\nindicating improving safety mechanisms. The absence of power-law scaling in\ncomplexity distributions further points to natural limits on jailbreak\ndevelopment.\n  Our findings challenge the prevailing narrative of an escalating arms race\nbetween attackers and defenders, instead suggesting that LLM safety evolution\nis bounded by human ingenuity constraints while defensive measures continue\nadvancing. Our results highlight critical information hazards in academic\njailbreak disclosure, as sophisticated attacks exceeding current complexity\nbaselines could disrupt the observed equilibrium and enable widespread harm\nbefore defensive adaptation."}
{"id": "2507.08260", "pdf": "https://arxiv.org/pdf/2507.08260.pdf", "abs": "https://arxiv.org/abs/2507.08260", "title": "Do Conversational Interfaces Limit Creativity? Exploring Visual Graph Systems for Creative Writing", "authors": ["Abhinav Sood", "Maria Teresa Llano", "Jon McCormack"], "categories": ["cs.HC"], "comment": "Published in the 16th International Conference on Computational\n  Creativity, ICCC25. Accepted Paper in\n  https://computationalcreativity.net/iccc25/wp-content/uploads/papers/iccc25-sood2025conversational.pdf", "summary": "We present a graphical, node-based system through which users can visually\nchain generative AI models for creative tasks. Research in the area of chaining\nLLMs has found that while chaining provides transparency, controllability and\nguardrails to approach certain tasks, chaining with pre-defined LLM steps\nprevents free exploration. Using cognitive processes from creativity research\nas a basis, we create a system that addresses the inherent constraints of\nchat-based AI interactions. Specifically, our system aims to overcome the\nlimiting linear structure that inhibits creative exploration and ideation.\nFurther, our node-based approach enables the creation of reusable, shareable\ntemplates that can address different creative tasks. In a small-scale user\nstudy, we find that our graph-based system supports ideation and allows some\nusers to better visualise and think through their writing process when compared\nto a similar conversational interface. We further discuss the weaknesses and\nlimitations of our system, noting the benefits to creativity that user\ninterfaces with higher complexity can provide for users who can effectively use\nthem."}
{"id": "2507.08015", "pdf": "https://arxiv.org/pdf/2507.08015.pdf", "abs": "https://arxiv.org/abs/2507.08015", "title": "Assessing the Capabilities and Limitations of FinGPT Model in Financial NLP Applications", "authors": ["Prudence Djagba", "Chimezie A. Odinakachukwu"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "This work evaluates FinGPT, a financial domain-specific language model,\nacross six key natural language processing (NLP) tasks: Sentiment Analysis,\nText Classification, Named Entity Recognition, Financial Question Answering,\nText Summarization, and Stock Movement Prediction. The evaluation uses\nfinance-specific datasets to assess FinGPT's capabilities and limitations in\nreal-world financial applications. The results show that FinGPT performs\nstrongly in classification tasks such as sentiment analysis and headline\ncategorization, often achieving results comparable to GPT-4. However, its\nperformance is significantly lower in tasks that involve reasoning and\ngeneration, such as financial question answering and summarization. Comparisons\nwith GPT-4 and human benchmarks highlight notable performance gaps,\nparticularly in numerical accuracy and complex reasoning. Overall, the findings\nindicate that while FinGPT is effective for certain structured financial tasks,\nit is not yet a comprehensive solution. This research provides a useful\nbenchmark for future research and underscores the need for architectural\nimprovements and domain-specific optimization in financial language models."}
{"id": "2507.08624", "pdf": "https://arxiv.org/pdf/2507.08624.pdf", "abs": "https://arxiv.org/abs/2507.08624", "title": "Adaptive Framework for Ambient Intelligence in Rehabilitation Assistance", "authors": ["Gábor Baranyi", "Zsolt Csibi", "Kristian Fenech", "Áron Fóthi", "Zsófia Gaál", "Joul Skaf", "András Lőrincz"], "categories": ["cs.HC", "cs.AI"], "comment": "The paper has been submitted to a journal and waiting for review", "summary": "This paper introduces the Ambient Intelligence Rehabilitation Support (AIRS)\nframework, an advanced artificial intelligence-based solution tailored for home\nrehabilitation environments. AIRS integrates cutting-edge technologies,\nincluding Real-Time 3D Reconstruction (RT-3DR), intelligent navigation, and\nlarge Vision-Language Models (VLMs), to create a comprehensive system for\nmachine-guided physical rehabilitation. The general AIRS framework is\ndemonstrated in rehabilitation scenarios following total knee replacement\n(TKR), utilizing a database of 263 video recordings for evaluation. A\nsmartphone is employed within AIRS to perform RT-3DR of living spaces and has a\nbody-matched avatar to provide visual feedback about the excercise. This avatar\nis necessary in (a) optimizing exercise configurations, including camera\nplacement, patient positioning, and initial poses, and (b) addressing privacy\nconcerns and promoting compliance with the AI Act. The system guides users\nthrough the recording process to ensure the collection of properly recorded\nvideos. AIRS employs two feedback mechanisms: (i) visual 3D feedback, enabling\ndirect comparisons between prerecorded clinical exercises and patient home\nrecordings and (ii) VLM-generated feedback, providing detailed explanations and\ncorrections for exercise errors. The framework also supports people with visual\nand hearing impairments. It also features a modular design that can be adapted\nto broader rehabilitation contexts. AIRS software components are available for\nfurther use and customization."}
{"id": "2507.08017", "pdf": "https://arxiv.org/pdf/2507.08017.pdf", "abs": "https://arxiv.org/abs/2507.08017", "title": "Mechanistic Indicators of Understanding in Large Language Models", "authors": ["Pierre Beckmann", "Matthieu Queloz"], "categories": ["cs.CL", "cs.AI"], "comment": "32 pages", "summary": "Recent findings in mechanistic interpretability (MI), the field probing the\ninner workings of Large Language Models (LLMs), challenge the view that these\nmodels rely solely on superficial statistics. Here, we offer an accessible\nsynthesis of these findings that doubles as an introduction to MI, all while\nintegrating these findings within a novel theoretical framework for thinking\nabout machine understanding. We argue that LLMs develop internal structures\nthat are functionally analogous to the kind of understanding that consists in\nseeing connections. To sharpen this idea, we propose a three-tiered conception\nof machine understanding. First, conceptual understanding emerges when a model\nforms \"features\" as directions in latent space, thereby learning the\nconnections between diverse manifestations of something. Second,\nstate-of-the-world understanding emerges when a model learns contingent factual\nconnections between features and dynamically tracks changes in the world.\nThird, principled understanding emerges when a model ceases to rely on a\ncollection of memorized facts and discovers a \"circuit\" that connects these\nfacts. However, we conclude by exploring the \"parallel mechanisms\" phenomenon,\narguing that while LLMs exhibit forms of understanding, their cognitive\narchitecture remains different from ours, and the debate should shift from\nwhether LLMs understand to how their strange minds work."}
{"id": "2507.08659", "pdf": "https://arxiv.org/pdf/2507.08659.pdf", "abs": "https://arxiv.org/abs/2507.08659", "title": "Push or Light: Nudging Standing to Break Prolonged Sitting", "authors": ["Sohshi Yoshida", "Ko Watanabe", "Andreas Dengel", "Shoya Ishimaru", "Shingo Ata", "Manato Fujimoto"], "categories": ["cs.HC"], "comment": null, "summary": "Prolonged sitting is a health risk leading to metabolic and cardiovascular\ndiseases. To combat this, various \"nudging\" strategies encourage stand-ups.\nBehavior change triggers use explicit prompts such as smartphone push\nnotifications or light controls. However, comparisons of the effects of such\ninteractions, discomfort, and user context have not yet been performed. The\npresent study evaluated these methods in a mixed design experiment with 15\ncollege students. Three intervention methods (none, push notifications, and\nlight dimming) and three user task contexts (computer work, video calls, and\nreading) were tested. The frequency of standing up and comfort were assessed\nafter each ten-minute session. Results showed that dimming resulted in slightly\nmore breaks (1.4 \\pm 1.55) than push notification (1.2 \\pm 1.08), but caused\ndiscomfort for 66.7% of participants, compared to 20% for notification. The\nresults were influenced by task context. Dimming was most effective during\nvideo calls and reading, while push notifications were more effective during\ncomputer work. These findings suggest adaptive nudging systems should tailor\ninterventions based on context and individual preferences."}
{"id": "2507.08018", "pdf": "https://arxiv.org/pdf/2507.08018.pdf", "abs": "https://arxiv.org/abs/2507.08018", "title": "Review, Remask, Refine (R3): Process-Guided Block Diffusion for Text Generation", "authors": ["Nikita Mounier", "Parsa Idehpour"], "categories": ["cs.CL", "cs.LG"], "comment": "Accepted at Methods and Opportunities at Small Scale (MOSS), ICML\n  2025", "summary": "A key challenge for iterative text generation is enabling models to\nefficiently identify and correct their own errors. We propose Review, Remask,\nRefine (R3), a relatively simple yet elegant framework that requires no\nadditional model training and can be applied to any pre-trained masked text\ndiffusion model (e.g., LLaDA or BD3-LM). In R3, a Process Reward Model (PRM) is\nutilized for the Review of intermediate generated blocks. The framework then\ntranslates these PRM scores into a Remask strategy: the lower a block's PRM\nscore, indicating potential mistakes, the greater the proportion of tokens\nwithin that block are remasked. Finally, the model is compelled to Refine these\ntargeted segments, focusing its efforts more intensively on specific\nsub-optimal parts of past generations, leading to improved final output."}
{"id": "2507.08675", "pdf": "https://arxiv.org/pdf/2507.08675.pdf", "abs": "https://arxiv.org/abs/2507.08675", "title": "LIMITER: A Gamified Interface for Harnessing Just Intonation Systems", "authors": ["Antonis Christou"], "categories": ["cs.HC"], "comment": "6 pages, 11 figures, NIME, 2025", "summary": "This paper introduces LIMITER, a gamified digital musical instrument for\nharnessing and performing microtonal and justly intonated sounds. While\nmicrotonality in Western music remains a niche and esoteric system that can be\ndifficult both to conceptualize and to perform with, LIMITER presents a novel,\neasy to pickup interface that utilizes color, geometric transformations, and\ngame-like controls to create a simpler inlet into utilizing these sounds as a\nmeans of expression. We report on the background of the development of LIMITER,\nas well as explain the underlying musical and engineering systems that enable\nits function. Additionally, we offer a discussion and preliminary evaluation of\nthe creativity-enhancing effects of the interface."}
{"id": "2507.08019", "pdf": "https://arxiv.org/pdf/2507.08019.pdf", "abs": "https://arxiv.org/abs/2507.08019", "title": "Signal or Noise? Evaluating Large Language Models in Resume Screening Across Contextual Variations and Human Expert Benchmarks", "authors": ["Aryan Varshney", "Venkat Ram Reddy Ganuthula"], "categories": ["cs.CL", "econ.GN", "q-fin.EC"], "comment": null, "summary": "This study investigates whether large language models (LLMs) exhibit\nconsistent behavior (signal) or random variation (noise) when screening resumes\nagainst job descriptions, and how their performance compares to human experts.\nUsing controlled datasets, we tested three LLMs (Claude, GPT, and Gemini)\nacross contexts (No Company, Firm1 [MNC], Firm2 [Startup], Reduced Context)\nwith identical and randomized resumes, benchmarked against three human\nrecruitment experts. Analysis of variance revealed significant mean differences\nin four of eight LLM-only conditions and consistently significant differences\nbetween LLM and human evaluations (p < 0.01). Paired t-tests showed GPT adapts\nstrongly to company context (p < 0.001), Gemini partially (p = 0.038 for\nFirm1), and Claude minimally (p > 0.1), while all LLMs differed significantly\nfrom human experts across contexts. Meta-cognition analysis highlighted\nadaptive weighting patterns that differ markedly from human evaluation\napproaches. Findings suggest LLMs offer interpretable patterns with detailed\nprompts but diverge substantially from human judgment, informing their\ndeployment in automated hiring systems."}
{"id": "2507.08744", "pdf": "https://arxiv.org/pdf/2507.08744.pdf", "abs": "https://arxiv.org/abs/2507.08744", "title": "EqualMotion: Accessible Motion Capture for the Creative Industries", "authors": ["Clarice Hilton", "Kat Hawkins", "Phill Tew", "Freddie Collins", "Seb Madgwick", "Dominic Potts", "Tom Mitchell"], "categories": ["cs.HC"], "comment": null, "summary": "Motion capture technologies are increasingly used in creative and performance\ncontexts but often exclude disabled practitioners due to normative assumptions\nin body modeling, calibration, and avatar representation. EqualMotion\nintroduces a body-agnostic, wearable motion capture system designed through a\ndisability-centred co-design approach. By enabling personalised calibration,\nintegrating mobility aids, and adopting an inclusive visual language,\nEqualMotion supports diverse body types and movement styles. The system is\ndeveloped collaboratively with disabled researchers and creatives, aiming to\nfoster equitable participation in digital performance and prototyping. This\npaper outlines the system's design principles and highlights ongoing case\nstudies in dance and music to evaluate accessibility in real-world creative\nworkflows."}
{"id": "2507.08020", "pdf": "https://arxiv.org/pdf/2507.08020.pdf", "abs": "https://arxiv.org/abs/2507.08020", "title": "Circumventing Safety Alignment in Large Language Models Through Embedding Space Toxicity Attenuation", "authors": ["Zhibo Zhang", "Yuxi Li", "Kailong Wang", "Shuai Yuan", "Ling Shi", "Haoyu Wang"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) have achieved remarkable success across domains\nsuch as healthcare, education, and cybersecurity. However, this openness also\nintroduces significant security risks, particularly through embedding space\npoisoning, which is a subtle attack vector where adversaries manipulate the\ninternal semantic representations of input data to bypass safety alignment\nmechanisms. While previous research has investigated universal perturbation\nmethods, the dynamics of LLM safety alignment at the embedding level remain\ninsufficiently understood. Consequently, more targeted and accurate adversarial\nperturbation techniques, which pose significant threats, have not been\nadequately studied.\n  In this work, we propose ETTA (Embedding Transformation Toxicity\nAttenuation), a novel framework that identifies and attenuates\ntoxicity-sensitive dimensions in embedding space via linear transformations.\nETTA bypasses model refusal behaviors while preserving linguistic coherence,\nwithout requiring model fine-tuning or access to training data. Evaluated on\nfive representative open-source LLMs using the AdvBench benchmark, ETTA\nachieves a high average attack success rate of 88.61%, outperforming the best\nbaseline by 11.34%, and generalizes to safety-enhanced models (e.g., 77.39% ASR\non instruction-tuned defenses). These results highlight a critical\nvulnerability in current alignment strategies and underscore the need for\nembedding-aware defenses."}
{"id": "2507.08001", "pdf": "https://arxiv.org/pdf/2507.08001.pdf", "abs": "https://arxiv.org/abs/2507.08001", "title": "Human Creativity and AI", "authors": ["Shengyi Xie"], "categories": ["cs.AI", "cs.HC"], "comment": null, "summary": "With the advancement of science and technology, the philosophy of creativity\nhas undergone significant reinterpretation. This paper investigates\ncontemporary research in the fields of psychology, cognitive neuroscience, and\nthe philosophy of creativity, particularly in the context of the development of\nartificial intelligence (AI) techniques. It aims to address the central\nquestion: Can AI exhibit creativity? The paper reviews the historical\nperspectives on the philosophy of creativity and explores the influence of\npsychological advancements on the study of creativity. Furthermore, it analyzes\nvarious definitions of creativity and examines the responses of naturalism and\ncognitive neuroscience to the concept of creativity."}
{"id": "2507.08021", "pdf": "https://arxiv.org/pdf/2507.08021.pdf", "abs": "https://arxiv.org/abs/2507.08021", "title": "Unveiling Effective In-Context Configurations for Image Captioning: An External & Internal Analysis", "authors": ["Li Li", "Yongliang Wu", "Jingze Zhu", "Jiawei Peng", "Jianfei Cai", "Xu Yang"], "categories": ["cs.CL", "cs.AI"], "comment": "16 pages, 11 figures", "summary": "The evolution of large models has witnessed the emergence of In-Context\nLearning (ICL) capabilities. In Natural Language Processing (NLP), numerous\nstudies have demonstrated the effectiveness of ICL. Inspired by the success of\nLarge Language Models (LLMs), researchers have developed Large Multimodal\nModels (LMMs) with ICL capabilities. However, explorations of demonstration\nconfiguration for multimodal ICL remain preliminary. Additionally, the\ncontrollability of In-Context Examples (ICEs) provides an efficient and\ncost-effective means to observe and analyze the inference characteristics of\nLMMs under varying inputs. This paper conducts a comprehensive external and\ninternal investigation of multimodal in-context learning on the image\ncaptioning task. Externally, we explore demonstration configuration strategies\nthrough three dimensions: shot number, image retrieval, and caption assignment.\nWe employ multiple metrics to systematically and thoroughly evaluate and\nsummarize key findings. Internally, we analyze typical LMM attention\ncharacteristics and develop attention-based metrics to quantify model\nbehaviors. We also conduct auxiliary experiments to explore the feasibility of\nattention-driven model acceleration and compression. We further compare\nperformance variations between LMMs with identical model design and pretraining\nstrategies and explain the differences from the angles of pre-training data\nfeatures. Our study reveals both how ICEs configuration strategies impact model\nperformance through external experiments and characteristic typical patterns\nthrough internal inspection, providing dual perspectives for understanding\nmultimodal ICL in LMMs. Our method of combining external and internal analysis\nto investigate large models, along with our newly proposed metrics, can be\napplied to broader research areas."}
{"id": "2507.08030", "pdf": "https://arxiv.org/pdf/2507.08030.pdf", "abs": "https://arxiv.org/abs/2507.08030", "title": "A Systematic Analysis of Declining Medical Safety Messaging in Generative AI Models", "authors": ["Sonali Sharma", "Ahmed M. Alaa", "Roxana Daneshjou"], "categories": ["cs.CL", "cs.CE", "cs.HC"], "comment": "11 pages, 5 figures", "summary": "Generative AI models, including large language models (LLMs) and\nvision-language models (VLMs), are increasingly used to interpret medical\nimages and answer clinical questions. Their responses often include\ninaccuracies; therefore, safety measures like medical disclaimers are critical\nto remind users that AI outputs are not professionally vetted or a substitute\nfor medical advice. This study evaluated the presence of disclaimers in LLM and\nVLM outputs across model generations from 2022 to 2025. Using 500 mammograms,\n500 chest X-rays, 500 dermatology images, and 500 medical questions, outputs\nwere screened for disclaimer phrases. Medical disclaimer presence in LLM and\nVLM outputs dropped from 26.3% in 2022 to 0.97% in 2025, and from 19.6% in 2023\nto 1.05% in 2025, respectively. By 2025, the majority of models displayed no\ndisclaimers. As public models become more capable and authoritative,\ndisclaimers must be implemented as a safeguard adapting to the clinical context\nof each output."}
{"id": "2507.08027", "pdf": "https://arxiv.org/pdf/2507.08027.pdf", "abs": "https://arxiv.org/abs/2507.08027", "title": "\"Amazing, They All Lean Left\" -- Analyzing the Political Temperaments of Current LLMs", "authors": ["W. Russell Neuman", "Chad Coleman", "Ali Dasdan", "Safinah Ali", "Manan Shah", "Kund Meghani"], "categories": ["cs.CL", "cs.CY"], "comment": null, "summary": "Recent studies have revealed a consistent liberal orientation in the ethical\nand political responses generated by most commercial large language models\n(LLMs), yet the underlying causes and resulting implications remain unclear.\nThis paper systematically investigates the political temperament of seven\nprominent LLMs - OpenAI's GPT-4o, Anthropic's Claude Sonnet 4, Perplexity\n(Sonar Large), Google's Gemini 2.5 Flash, Meta AI's Llama 4, Mistral 7b Le Chat\nand High-Flyer's DeepSeek R1 -- using a multi-pronged approach that includes\nMoral Foundations Theory, a dozen established political ideology scales and a\nnew index of current political controversies. We find strong and consistent\nprioritization of liberal-leaning values, particularly care and fairness,\nacross most models. Further analysis attributes this trend to four overlapping\nfactors: Liberal-leaning training corpora, reinforcement learning from human\nfeedback (RLHF), the dominance of liberal frameworks in academic ethical\ndiscourse and safety-driven fine-tuning practices. We also distinguish between\npolitical \"bias\" and legitimate epistemic differences, cautioning against\nconflating the two. A comparison of base and fine-tuned model pairs reveals\nthat fine-tuning generally increases liberal lean, an effect confirmed through\nboth self-report and empirical testing. We argue that this \"liberal tilt\" is\nnot a programming error or the personal preference of programmers but an\nemergent property of training on democratic rights-focused discourse. Finally,\nwe propose that LLMs may indirectly echo John Rawls' famous veil-of ignorance\nphilosophical aspiration, reflecting a moral stance unanchored to personal\nidentity or interest. Rather than undermining democratic discourse, this\npattern may offer a new lens through which to examine collective reasoning."}
{"id": "2507.08175", "pdf": "https://arxiv.org/pdf/2507.08175.pdf", "abs": "https://arxiv.org/abs/2507.08175", "title": "Emotion Recognition in Older Adults with Quantum Machine Learning and Wearable Sensors", "authors": ["Md. Saif Hassan Onim", "Travis S. Humble", "Himanshu Thapliyal"], "categories": ["cs.LG", "cs.HC", "quant-ph"], "comment": null, "summary": "We investigate the feasibility of inferring emotional states exclusively from\nphysiological signals, thereby presenting a privacy-preserving alternative to\nconventional facial recognition techniques. We conduct a performance comparison\nof classical machine learning algorithms and hybrid quantum machine learning\n(QML) methods with a quantum kernel-based model. Our results indicate that the\nquantum-enhanced SVM surpasses classical counterparts in classification\nperformance across all emotion categories, even when trained on limited\ndatasets. The F1 scores over all classes are over 80% with around a maximum of\n36% improvement in the recall values. The integration of wearable sensor data\nwith quantum machine learning not only enhances accuracy and robustness but\nalso facilitates unobtrusive emotion recognition. This methodology holds\npromise for populations with impaired communication abilities, such as\nindividuals with Alzheimer's Disease and Related Dementias (ADRD) and veterans\nwith Post-Traumatic Stress Disorder (PTSD). The findings establish an early\nfoundation for passive emotional monitoring in clinical and assisted living\nconditions."}
{"id": "2507.08029", "pdf": "https://arxiv.org/pdf/2507.08029.pdf", "abs": "https://arxiv.org/abs/2507.08029", "title": "Better Together: Quantifying the Benefits of AI-Assisted Recruitment", "authors": ["Ada Aka", "Emil Palikot", "Ali Ansari", "Nima Yazdani"], "categories": ["cs.CL", "cs.CY"], "comment": null, "summary": "Artificial intelligence (AI) is increasingly used in recruitment, yet\nempirical evidence quantifying its impact on hiring efficiency and candidate\nselection remains limited. We randomly assign 37,000 applicants for a\njunior-developer position to either a traditional recruitment process (resume\nscreening followed by human selection) or an AI-assisted recruitment pipeline\nincorporating an initial AI-driven structured video interview before human\nevaluation. Candidates advancing from either track faced the same final-stage\nhuman interview, with interviewers blind to the earlier selection method. In\nthe AI-assisted pipeline, 54% of candidates passed the final interview compared\nwith 34% from the traditional pipeline, yielding an average treatment effect of\n20 percentage points (SE 12 pp.). Five months later, we collected LinkedIn\nprofiles of top applicants from both groups and found that 18% (SE 1.1%) of\napplicants from the traditional track found new jobs compared with 23% (SE\n2.3%) from the AI group, resulting in a 5.9 pp. (SE 2.6 pp.) difference in the\nprobability of finding new employment between groups. The AI system tended to\nselect younger applicants with less experience and fewer advanced credentials.\nWe analyze AI-generated interview transcripts to examine the selection criteria\nand conversational dynamics. Our findings contribute to understanding how AI\ntechnologies affect decision making in recruitment and talent acquisition while\nhighlighting some of their potential implications."}
{"id": "2507.08594", "pdf": "https://arxiv.org/pdf/2507.08594.pdf", "abs": "https://arxiv.org/abs/2507.08594", "title": "Generating Proto-Personas through Prompt Engineering: A Case Study on Efficiency, Effectiveness and Empathy", "authors": ["Fernando Ayach", "Vitor Lameirão", "Raul Leão", "Jerfferson Felizardo", "Rafael Sobrinho", "Vanessa Borges", "Patrícia Matsubara", "Awdren Fontão"], "categories": ["cs.SE", "cs.AI", "cs.HC"], "comment": "12 pages; 2 figures; Preprint with the original submission accepted\n  for publication at 39th Brazilian Symposium on Software Engineering (SBES)", "summary": "Proto-personas are commonly used during early-stage Product Discovery, such\nas Lean Inception, to guide product definition and stakeholder alignment.\nHowever, the manual creation of proto-personas is often time-consuming,\ncognitively demanding, and prone to bias. In this paper, we propose and\nempirically investigate a prompt engineering-based approach to generate\nproto-personas with the support of Generative AI (GenAI). Our goal is to\nevaluate the approach in terms of efficiency, effectiveness, user acceptance,\nand the empathy elicited by the generated personas. We conducted a case study\nwith 19 participants embedded in a real Lean Inception, employing a qualitative\nand quantitative methods design. The results reveal the approach's efficiency\nby reducing time and effort and improving the quality and reusability of\npersonas in later discovery phases, such as Minimum Viable Product (MVP)\nscoping and feature refinement. While acceptance was generally high, especially\nregarding perceived usefulness and ease of use, participants noted limitations\nrelated to generalization and domain specificity. Furthermore, although\ncognitive empathy was strongly supported, affective and behavioral empathy\nvaried significantly across participants. These results contribute novel\nempirical evidence on how GenAI can be effectively integrated into software\nProduct Discovery practices, while also identifying key challenges to be\naddressed in future iterations of such hybrid design processes."}
{"id": "2507.08030", "pdf": "https://arxiv.org/pdf/2507.08030.pdf", "abs": "https://arxiv.org/abs/2507.08030", "title": "A Systematic Analysis of Declining Medical Safety Messaging in Generative AI Models", "authors": ["Sonali Sharma", "Ahmed M. Alaa", "Roxana Daneshjou"], "categories": ["cs.CL", "cs.CE", "cs.HC"], "comment": "11 pages, 5 figures", "summary": "Generative AI models, including large language models (LLMs) and\nvision-language models (VLMs), are increasingly used to interpret medical\nimages and answer clinical questions. Their responses often include\ninaccuracies; therefore, safety measures like medical disclaimers are critical\nto remind users that AI outputs are not professionally vetted or a substitute\nfor medical advice. This study evaluated the presence of disclaimers in LLM and\nVLM outputs across model generations from 2022 to 2025. Using 500 mammograms,\n500 chest X-rays, 500 dermatology images, and 500 medical questions, outputs\nwere screened for disclaimer phrases. Medical disclaimer presence in LLM and\nVLM outputs dropped from 26.3% in 2022 to 0.97% in 2025, and from 19.6% in 2023\nto 1.05% in 2025, respectively. By 2025, the majority of models displayed no\ndisclaimers. As public models become more capable and authoritative,\ndisclaimers must be implemented as a safeguard adapting to the clinical context\nof each output."}
{"id": "2507.08800", "pdf": "https://arxiv.org/pdf/2507.08800.pdf", "abs": "https://arxiv.org/abs/2507.08800", "title": "NeuralOS: Towards Simulating Operating Systems via Neural Generative Models", "authors": ["Luke Rivard", "Sun Sun", "Hongyu Guo", "Wenhu Chen", "Yuntian Deng"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.HC", "cs.LG"], "comment": null, "summary": "We introduce NeuralOS, a neural framework that simulates graphical user\ninterfaces (GUIs) of operating systems by directly predicting screen frames in\nresponse to user inputs such as mouse movements, clicks, and keyboard events.\nNeuralOS combines a recurrent neural network (RNN), which tracks computer\nstate, with a diffusion-based neural renderer that generates screen images. The\nmodel is trained on a large-scale dataset of Ubuntu XFCE recordings, which\ninclude both randomly generated interactions and realistic interactions\nproduced by AI agents. Experiments show that NeuralOS successfully renders\nrealistic GUI sequences, accurately captures mouse interactions, and reliably\npredicts state transitions like application launches. Although modeling\nfine-grained keyboard interactions precisely remains challenging, NeuralOS\noffers a step toward creating fully adaptive, generative neural interfaces for\nfuture human-computer interaction systems."}
{"id": "2507.08031", "pdf": "https://arxiv.org/pdf/2507.08031.pdf", "abs": "https://arxiv.org/abs/2507.08031", "title": "Beyond Scale: Small Language Models are Comparable to GPT-4 in Mental Health Understanding", "authors": ["Hong Jia", "Shiya Fu", "Vassilis Kostakos", "Feng Xia", "Ting Dang"], "categories": ["cs.CL"], "comment": null, "summary": "The emergence of Small Language Models (SLMs) as privacy-preserving\nalternatives for sensitive applications raises a fundamental question about\ntheir inherent understanding capabilities compared to Large Language Models\n(LLMs). This paper investigates the mental health understanding capabilities of\ncurrent SLMs through systematic evaluation across diverse classification tasks.\nEmploying zero-shot and few-shot learning paradigms, we benchmark their\nperformance against established LLM baselines to elucidate their relative\nstrengths and limitations in this critical domain. We assess five\nstate-of-the-art SLMs (Phi-3, Phi-3.5, Qwen2.5, Llama-3.2, Gemma2) against\nthree LLMs (GPT-4, FLAN-T5-XXL, Alpaca-7B) on six mental health understanding\ntasks. Our findings reveal that SLMs achieve mean performance within 2\\% of\nLLMs on binary classification tasks (F1 scores of 0.64 vs 0.66 in zero-shot\nsettings), demonstrating notable competence despite orders of magnitude fewer\nparameters. Both model categories experience similar degradation on multi-class\nseverity tasks (a drop of over 30\\%), suggesting that nuanced clinical\nunderstanding challenges transcend model scale. Few-shot prompting provides\nsubstantial improvements for SLMs (up to 14.6\\%), while LLM gains are more\nvariable. Our work highlights the potential of SLMs in mental health\nunderstanding, showing they can be effective privacy-preserving tools for\nanalyzing sensitive online text data. In particular, their ability to quickly\nadapt and specialize with minimal data through few-shot learning positions them\nas promising candidates for scalable mental health screening tools."}
{"id": "2503.15488", "pdf": "https://arxiv.org/pdf/2503.15488.pdf", "abs": "https://arxiv.org/abs/2503.15488", "title": "Human-AI Collaboration for Wearable Technology Component Standardization", "authors": ["Andrew M. Lydner"], "categories": ["cs.HC"], "comment": null, "summary": "Due to the multidisciplinary nature of wearable technology, the industry\nfaces potential limitations in innovation. The wearable technology industry is\nstill in its infancy and increased applicable use faces stagnation despite the\nplethora of technologies that have been largely wrist worn. This could be a\nresult of the lack of multidisciplinary expert knowledge disseminating through\nthe industry. Unlike other technologies which have standardizations and\nprocesses for how they are developed, wearable technologies exist in a realm of\nperpetual change as given the various materials and subcomponents that continue\nto be developed. It is essential that expert opinions form a collaborative\nfoundation, and even more so that intelligent systems foster that\ncollaboration. The caveat though, is likeliness of these artificial\nintelligence (AI) collaboration tools to be utilized by industry experts.\nMental model development for AI tool usage could be applied to wearable\ntechnology innovation in this regard, thus the goal of this paper and focus of\nresearch."}
{"id": "2507.08034", "pdf": "https://arxiv.org/pdf/2507.08034.pdf", "abs": "https://arxiv.org/abs/2507.08034", "title": "Integrating External Tools with Large Language Models to Improve Accuracy", "authors": ["Nripesh Niketan", "Hadj Batatia"], "categories": ["cs.CL", "cs.AI", "cs.LG", "68T50", "I.2.7; I.2.6"], "comment": "9 pages, 3 figures, 2 tables. Extended version of paper published in\n  Proceedings of International Conference on Information Technology and\n  Applications, Springer Nature Singapore, 2025, pp. 409-421. This version\n  includes additional experimental results comparing against GPT-4o,\n  LLaMA-Large, Mistral-Large, and Phi-Large, expanded evaluation methodology,\n  and enhanced analysis", "summary": "This paper deals with improving querying large language models (LLMs). It is\nwell-known that without relevant contextual information, LLMs can provide poor\nquality responses or tend to hallucinate. Several initiatives have proposed\nintegrating LLMs with external tools to provide them with up-to-date data to\nimprove accuracy. In this paper, we propose a framework to integrate external\ntools to enhance the capabilities of LLMs in answering queries in educational\nsettings. Precisely, we develop a framework that allows accessing external APIs\nto request additional relevant information. Integrated tools can also provide\ncomputational capabilities such as calculators or calendars. The proposed\nframework has been evaluated using datasets from the Multi-Modal Language\nUnderstanding (MMLU) collection. The data consists of questions on mathematical\nand scientific reasoning. Results compared to state-of-the-art language models\nshow that the proposed approach significantly improves performance. Our Athena\nframework achieves 83% accuracy in mathematical reasoning and 88% in scientific\nreasoning, substantially outperforming all tested models including GPT-4o,\nLLaMA-Large, Mistral-Large, Phi-Large, and GPT-3.5, with the best baseline\nmodel (LLaMA-Large) achieving only 67% and 79% respectively. These promising\nresults open the way to creating complex computing ecosystems around LLMs to\nmake their use more natural to support various tasks and activities."}
{"id": "2503.16521", "pdf": "https://arxiv.org/pdf/2503.16521.pdf", "abs": "https://arxiv.org/abs/2503.16521", "title": "Conversational Self-Play for Discovering and Understanding Psychotherapy Approaches", "authors": ["Onno P Kampman", "Michael Xing", "Charmaine Lim", "Ahmad Ishqi Jabir", "Ryan Louie", "Jimmy Lee", "Robert JT Morris"], "categories": ["cs.HC", "cs.MA"], "comment": "Improve writing, add multiple techniques extraction", "summary": "This paper explores conversational self-play with LLMs as a scalable approach\nfor analyzing and exploring psychotherapy approaches, evaluating how well\nAI-generated therapeutic dialogues align with established modalities."}
{"id": "2507.08036", "pdf": "https://arxiv.org/pdf/2507.08036.pdf", "abs": "https://arxiv.org/abs/2507.08036", "title": "Barriers in Integrating Medical Visual Question Answering into Radiology Workflows: A Scoping Review and Clinicians' Insights", "authors": ["Deepali Mishra", "Chaklam Silpasuwanchai", "Ashutosh Modi", "Madhumita Sushil", "Sorayouth Chumnanvej"], "categories": ["cs.CL", "cs.CV"], "comment": "29 pages, 5 figures (1 in supplementary), 3 tables (1 in main text, 2\n  in supplementary). Scoping review and clinician survey", "summary": "Medical Visual Question Answering (MedVQA) is a promising tool to assist\nradiologists by automating medical image interpretation through question\nanswering. Despite advances in models and datasets, MedVQA's integration into\nclinical workflows remains limited. This study systematically reviews 68\npublications (2018-2024) and surveys 50 clinicians from India and Thailand to\nexamine MedVQA's practical utility, challenges, and gaps. Following the Arksey\nand O'Malley scoping review framework, we used a two-pronged approach: (1)\nreviewing studies to identify key concepts, advancements, and research gaps in\nradiology workflows, and (2) surveying clinicians to capture their perspectives\non MedVQA's clinical relevance. Our review reveals that nearly 60% of QA pairs\nare non-diagnostic and lack clinical relevance. Most datasets and models do not\nsupport multi-view, multi-resolution imaging, EHR integration, or domain\nknowledge, features essential for clinical diagnosis. Furthermore, there is a\nclear mismatch between current evaluation metrics and clinical needs. The\nclinician survey confirms this disconnect: only 29.8% consider MedVQA systems\nhighly useful. Key concerns include the absence of patient history or domain\nknowledge (87.2%), preference for manually curated datasets (51.1%), and the\nneed for multi-view image support (78.7%). Additionally, 66% favor models\nfocused on specific anatomical regions, and 89.4% prefer dialogue-based\ninteractive systems. While MedVQA shows strong potential, challenges such as\nlimited multimodal analysis, lack of patient context, and misaligned evaluation\napproaches must be addressed for effective clinical integration."}
{"id": "2505.09166", "pdf": "https://arxiv.org/pdf/2505.09166.pdf", "abs": "https://arxiv.org/abs/2505.09166", "title": "An Exploration of Default Images in Text-to-Image Generation", "authors": ["Hannu Simonen", "Atte Kiviniemi", "Jonas Oppenlaender"], "categories": ["cs.HC", "cs.AI", "H.5.m; I.2.m"], "comment": "16 pages, 6 figures", "summary": "In the creative practice of text-to-image generation (TTI), images are\ngenerated from text prompts. However, TTI models are trained to always yield an\noutput, even if the prompt contains unknown terms. In this case, the model may\ngenerate what we call \"default images\": images that closely resemble each other\nacross many unrelated prompts. We argue studying default images is valuable for\ndesigning better solutions for TTI and prompt engineering. In this paper, we\nprovide the first investigation into default images on Midjourney, a popular\nimage generator. We describe our systematic approach to create input prompts\ntriggering default images, and present the results of our initial experiments\nand several small-scale ablation studies. We also report on a survey study\ninvestigating how default images affect user satisfaction. Our work lays the\nfoundation for understanding default images in TTI and highlights challenges\nand future research directions."}
{"id": "2507.08037", "pdf": "https://arxiv.org/pdf/2507.08037.pdf", "abs": "https://arxiv.org/abs/2507.08037", "title": "CRISP: Complex Reasoning with Interpretable Step-based Plans", "authors": ["Matan Vetzler", "Koren Lazar", "Guy Uziel", "Eran Hirsch", "Ateret Anaby-Tavor", "Leshem Choshen"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Recent advancements in large language models (LLMs) underscore the need for\nstronger reasoning capabilities to solve complex problems effectively. While\nChain-of-Thought (CoT) reasoning has been a step forward, it remains\ninsufficient for many domains. A promising alternative is explicit high-level\nplan generation, but existing approaches largely assume that LLMs can produce\neffective plans through few-shot prompting alone, without additional training.\nIn this work, we challenge this assumption and introduce CRISP (Complex\nReasoning with Interpretable Step-based Plans), a multi-domain dataset of\nhigh-level plans for mathematical reasoning and code generation. The plans in\nCRISP are automatically generated and rigorously validated--both intrinsically,\nusing an LLM as a judge, and extrinsically, by evaluating their impact on\ndownstream task performance. We demonstrate that fine-tuning a small model on\nCRISP enables it to generate higher-quality plans than much larger models using\nfew-shot prompting, while significantly outperforming Chain-of-Thought\nreasoning. Furthermore, our out-of-domain evaluation reveals that fine-tuning\non one domain improves plan generation in the other, highlighting the\ngeneralizability of learned planning capabilities."}
{"id": "2507.07362", "pdf": "https://arxiv.org/pdf/2507.07362.pdf", "abs": "https://arxiv.org/abs/2507.07362", "title": "FLoRA: An Advanced AI-Powered Engine to Facilitate Hybrid Human-AI Regulated Learning", "authors": ["Xinyu Li", "Tongguang Li", "Lixiang Yan", "Yuheng Li", "Linxuan Zhao", "Mladen Raković", "Inge Molenaar", "Dragan Gašević", "Yizhou Fan"], "categories": ["cs.HC", "cs.CY"], "comment": null, "summary": "SRL, defined as learners' ability to systematically plan, monitor, and\nregulate their learning activities, is crucial for sustained academic\nachievement and lifelong learning competencies. Emerging Artificial\nIntelligence (AI) developments profoundly influence SRL interactions by\npotentially either diminishing or strengthening learners' opportunities to\nexercise their own regulatory skills. Recent literature emphasizes a balanced\napproach termed Hybrid Human-AI Regulated Learning (HHAIRL), in which AI\nprovides targeted, timely scaffolding while preserving the learners' role as\nactive decision-makers and reflective monitors of their learning process.\nNevertheless, existing digital tools frequently fall short, lacking\nadaptability, focusing narrowly on isolated SRL phases, and insufficiently\nsupport meaningful human-AI interactions. In response, this paper introduces\nthe enhanced FLoRA Engine, which incorporates advanced Generative Artificial\nIntelligence (GenAI) features and state-of-the-art learning analytics,\nexplicitly grounded in SRL and HHAIRL theories. The FLoRA Engine offers\ninstrumentation tools such as collaborative writing, multi-agents chatbot, and\ndetailed learning trace logging to support dynamic, adaptive scaffolding\ntailored to individual needs in real time. We further present a summary of\nseveral research studies that provide the validations for and illustrate how\nthese instrumentation tools can be utilized in real-world educational and\nexperimental contexts. These studies demonstrate the effectiveness of FLoRA\nEngine in fostering SRL and HHAIRL, providing both theoretical insights and\npractical solutions for the future of AI-enhanced learning context."}
{"id": "2507.08038", "pdf": "https://arxiv.org/pdf/2507.08038.pdf", "abs": "https://arxiv.org/abs/2507.08038", "title": "AblationBench: Evaluating Automated Planning of Ablations in Empirical AI Research", "authors": ["Talor Abramovich", "Gal Chechik"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Autonomous agents built on language models (LMs) are showing increasing\npopularity in many fields, including scientific research. AI co-scientists aim\nto support or automate parts of the research process using these agents. A key\ncomponent of empirical AI research is the design of ablation experiments. To\nthis end, we introduce AblationBench, a benchmark suite for evaluating agents\non ablation planning tasks in empirical AI research. It includes two tasks:\nAuthorAblation, which helps authors propose ablation experiments based on a\nmethod section and contains 83 instances, and ReviewerAblation, which helps\nreviewers find missing ablations in a full paper and contains 350 instances.\nFor both tasks, we develop LM-based judges that serve as an automatic\nevaluation framework. Our experiments with frontier LMs show that these tasks\nremain challenging, with the best-performing LM system identifying only 29% of\nthe original ablations on average. Lastly, we analyze the limitations of\ncurrent LMs on these tasks, and find that chain-of-thought prompting\noutperforms the currently existing agent-based approach."}
{"id": "2507.07930", "pdf": "https://arxiv.org/pdf/2507.07930.pdf", "abs": "https://arxiv.org/abs/2507.07930", "title": "Probing Experts' Perspectives on AI-Assisted Public Speaking Training", "authors": ["Nesrine Fourati", "Alisa Barkar", "Marion Dragée", "Liv Danthon-Lefebvre", "Mathieu Chollet"], "categories": ["cs.HC", "cs.AI", "cs.CL"], "comment": null, "summary": "Background: Public speaking is a vital professional skill, yet it remains a\nsource of significant anxiety for many individuals. Traditional training relies\nheavily on expert coaching, but recent advances in AI has led to novel types of\ncommercial automated public speaking feedback tools. However, most research has\nfocused on prototypes rather than commercial applications, and little is known\nabout how public speaking experts perceive these tools.\n  Objectives: This study aims to evaluate expert opinions on the efficacy and\ndesign of commercial AI-based public speaking training tools and to propose\nguidelines for their improvement.\n  Methods: The research involved 16 semi-structured interviews and 2 focus\ngroups with public speaking experts. Participants discussed their views on\ncurrent commercial tools, their potential integration into traditional\ncoaching, and suggestions for enhancing these systems.\n  Results and Conclusions: Experts acknowledged the value of AI tools in\nhandling repetitive, technical aspects of training, allowing coaches to focus\non higher-level skills. However they found key issues in current tools,\nemphasising the need for personalised, understandable, carefully selected\nfeedback and clear instructional design. Overall, they supported a hybrid model\ncombining traditional coaching with AI-supported exercises."}
{"id": "2507.08045", "pdf": "https://arxiv.org/pdf/2507.08045.pdf", "abs": "https://arxiv.org/abs/2507.08045", "title": "Krul: Efficient State Restoration for Multi-turn Conversations with Dynamic Cross-layer KV Sharing", "authors": ["Junyi Wen", "Junyuan Liang", "Zicong Hong", "Wuhui Chen", "Zibin Zheng"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Efficient state restoration in multi-turn conversations with large language\nmodels (LLMs) remains a critical challenge, primarily due to the overhead of\nrecomputing or loading full key-value (KV) caches for all historical tokens. To\naddress this, existing approaches compress KV caches across adjacent layers\nwith highly similar attention patterns. However, these methods often apply a\nfixed compression scheme across all conversations, selecting the same layer\npairs for compression without considering conversation-specific attention\ndynamics. This static strategy overlooks variability in attention pattern\nsimilarity across different conversations, which can lead to noticeable\naccuracy degradation.\n  We present Krul, a multi-turn LLM inference system that enables accurate and\nefficient KV cache restoration. Krul dynamically selects compression strategies\nbased on attention similarity across layer pairs and uses a\nrecomputation-loading pipeline to restore the KV cache. It introduces three key\ninnovations: 1) a preemptive compression strategy selector to preserve critical\ncontext for future conversation turns and selects a customized strategy for the\nconversation; 2) a token-wise heterogeneous attention similarity estimator to\nmitigate the attention similarity computation and storage overhead during model\ngeneration; 3) a bubble-free restoration scheduler to reduce potential bubbles\nbrought by the imbalance of recomputing and loading stream due to compressed KV\ncaches. Empirical evaluations on real-world tasks demonstrate that Krul\nachieves a 1.5x-2.68x reduction in time-to-first-token (TTFT) and a 1.33x-2.35x\nreduction in KV cache storage compared to state-of-the-art methods without\ncompromising generation quality."}
{"id": "2503.01163", "pdf": "https://arxiv.org/pdf/2503.01163.pdf", "abs": "https://arxiv.org/abs/2503.01163", "title": "Bandit-Based Prompt Design Strategy Selection Improves Prompt Optimizers", "authors": ["Rin Ashizawa", "Yoichi Hirose", "Nozomu Yoshinari", "Kento Uchida", "Shinichi Shirakawa"], "categories": ["cs.AI", "cs.CL", "cs.HC", "cs.LG", "cs.NE"], "comment": "Accepted to ACL 2025 Findings", "summary": "Prompt optimization aims to search for effective prompts that enhance the\nperformance of large language models (LLMs). Although existing prompt\noptimization methods have discovered effective prompts, they often differ from\nsophisticated prompts carefully designed by human experts. Prompt design\nstrategies, representing best practices for improving prompt performance, can\nbe key to improving prompt optimization. Recently, a method termed the\nAutonomous Prompt Engineering Toolbox (APET) has incorporated various prompt\ndesign strategies into the prompt optimization process. In APET, the LLM is\nneeded to implicitly select and apply the appropriate strategies because prompt\ndesign strategies can have negative effects. This implicit selection may be\nsuboptimal due to the limited optimization capabilities of LLMs. This paper\nintroduces Optimizing Prompts with sTrategy Selection (OPTS), which implements\nexplicit selection mechanisms for prompt design. We propose three mechanisms,\nincluding a Thompson sampling-based approach, and integrate them into\nEvoPrompt, a well-known prompt optimizer. Experiments optimizing prompts for\ntwo LLMs, Llama-3-8B-Instruct and GPT-4o mini, were conducted using BIG-Bench\nHard. Our results show that the selection of prompt design strategies improves\nthe performance of EvoPrompt, and the Thompson sampling-based mechanism\nachieves the best overall results. Our experimental code is provided at\nhttps://github.com/shiralab/OPTS ."}
{"id": "2507.08107", "pdf": "https://arxiv.org/pdf/2507.08107.pdf", "abs": "https://arxiv.org/abs/2507.08107", "title": "GRASP: Generic Reasoning And SPARQL Generation across Knowledge Graphs", "authors": ["Sebastian Walter", "Hannah Bast"], "categories": ["cs.CL", "cs.DB", "cs.IR"], "comment": null, "summary": "We propose a new approach for generating SPARQL queries on RDF knowledge\ngraphs from natural language questions or keyword queries, using a large\nlanguage model. Our approach does not require fine-tuning. Instead, it uses the\nlanguage model to explore the knowledge graph by strategically executing SPARQL\nqueries and searching for relevant IRIs and literals. We evaluate our approach\non a variety of benchmarks (for knowledge graphs of different kinds and sizes)\nand language models (of different scales and types, commercial as well as\nopen-source) and compare it with existing approaches. On Wikidata we reach\nstate-of-the-art results on multiple benchmarks, despite the zero-shot setting.\nOn Freebase we come close to the best few-shot methods. On other, less commonly\nevaluated knowledge graphs and benchmarks our approach also performs well\noverall. We conduct several additional studies, like comparing different ways\nof searching the graphs, incorporating a feedback mechanism, or making use of\nfew-shot examples."}
{"id": "2507.08109", "pdf": "https://arxiv.org/pdf/2507.08109.pdf", "abs": "https://arxiv.org/abs/2507.08109", "title": "Audit, Alignment, and Optimization of LM-Powered Subroutines with Application to Public Comment Processing", "authors": ["Reilly Raab", "Mike Parker", "Dan Nally", "Sadie Montgomery", "Anastasia Bernat", "Sai Munikoti", "Sameera Horawalavithana"], "categories": ["cs.CL"], "comment": null, "summary": "The advent of language models (LMs) has the potential to dramatically\naccelerate tasks that may be cast to text-processing; however, real-world\nadoption is hindered by concerns regarding safety, explainability, and bias.\nHow can we responsibly leverage LMs in a transparent, auditable manner --\nminimizing risk and allowing human experts to focus on informed decision-making\nrather than data-processing or prompt engineering? In this work, we propose a\nframework for declaring statically typed, LM-powered subroutines (i.e.,\ncallable, function-like procedures) for use within conventional asynchronous\ncode -- such that sparse feedback from human experts is used to improve the\nperformance of each subroutine online (i.e., during use). In our\nimplementation, all LM-produced artifacts (i.e., prompts, inputs, outputs, and\ndata-dependencies) are recorded and exposed to audit on demand. We package this\nframework as a library to support its adoption and continued development. While\nthis framework may be applicable across several real-world decision workflows\n(e.g., in healthcare and legal fields), we evaluate it in the context of public\ncomment processing as mandated by the 1969 National Environmental Protection\nAct (NEPA): Specifically, we use this framework to develop \"CommentNEPA,\" an\napplication that compiles, organizes, and summarizes a corpus of public\ncommentary submitted in response to a project requiring environmental review.\nWe quantitatively evaluate the application by comparing its outputs (when\noperating without human feedback) to historical ``ground-truth'' data as\nlabelled by human annotators during the preparation of official environmental\nimpact statements."}
{"id": "2507.08143", "pdf": "https://arxiv.org/pdf/2507.08143.pdf", "abs": "https://arxiv.org/abs/2507.08143", "title": "Compactor: Calibrated Query-Agnostic KV Cache Compression with Approximate Leverage Scores", "authors": ["Vivek Chari", "Benjamin Van Durme"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Modern Large Language Models (LLMs) are increasingly trained to support very\nlarge context windows. Unfortunately the ability to use long contexts in\ngeneration is complicated by the large memory requirement of the KV cache,\nwhich scales linearly with the context length. This memory footprint is often\nthe dominant resource bottleneck in real-world deployments, limiting throughput\nand increasing serving cost. One way to address this is by compressing the KV\ncache, which can be done either with knowledge of the question being asked\n(query-aware) or without knowledge of the query (query-agnostic). We present\nCompactor, a parameter-free, query-agnostic KV compression strategy that uses\napproximate leverage scores to determine token importance. We show that\nCompactor can achieve the same performance as competing methods while retaining\n1/2 the tokens in both synthetic and real-world context tasks, with minimal\ncomputational overhead. We further introduce a procedure for context-calibrated\ncompression, which allows one to infer the maximum compression ratio a given\ncontext can support. Using context-calibrated compression, we show that\nCompactor achieves full KV performance on Longbench while reducing the KV\nmemory burden by 63%, on average. To demonstrate the efficacy and\ngeneralizability of our approach, we apply Compactor to 27 synthetic and\nreal-world tasks from RULER and Longbench, with models from both the Qwen 2.5\nand Llama 3.1 families."}
{"id": "2507.08151", "pdf": "https://arxiv.org/pdf/2507.08151.pdf", "abs": "https://arxiv.org/abs/2507.08151", "title": "Distilling Empathy from Large Language Models", "authors": ["Henry J. Xie", "Jinghan Zhang", "Xinhao Zhang", "Kunpeng Liu"], "categories": ["cs.CL"], "comment": "Accepted by SIGDIAL 2025", "summary": "The distillation of knowledge from Large Language Models (LLMs) into Smaller\nLanguage Models (SLMs), preserving the capabilities and performance of LLMs\nwhile reducing model size, has played a key role in the proliferation of LLMs.\nBecause SLMs are considerably smaller than LLMs, they are often utilized in\ndomains where human interaction is frequent but resources are highly\nconstrained, e.g., smart phones. Therefore, it is crucial to ensure that\nempathy, a fundamental aspect of positive human interactions, already instilled\ninto LLMs, is retained by SLMs after distillation. In this paper, we develop a\ncomprehensive approach for effective empathy distillation from LLMs into SLMs.\nOur approach features a two-step fine-tuning process that fully leverages\ndatasets of empathetic dialogue responses distilled from LLMs. We explore\nseveral distillation methods beyond basic direct prompting and propose four\nunique sets of prompts for targeted empathy improvement to significantly\nenhance the empathy distillation process. Our evaluations demonstrate that SLMs\nfine-tuned through the two-step fine-tuning process with distillation datasets\nenhanced by the targeted empathy improvement prompts significantly outperform\nthe base SLM at generating empathetic responses with a win rate of 90%. Our\ntargeted empathy improvement prompts substantially outperform the basic direct\nprompting with a 10% improvement in win rate."}
{"id": "2507.08203", "pdf": "https://arxiv.org/pdf/2507.08203.pdf", "abs": "https://arxiv.org/abs/2507.08203", "title": "TruthTorchLM: A Comprehensive Library for Predicting Truthfulness in LLM Outputs", "authors": ["Duygu Nur Yaldiz", "Yavuz Faruk Bakman", "Sungmin Kang", "Alperen Öziş", "Hayrettin Eren Yildiz", "Mitash Ashish Shah", "Zhiqi Huang", "Anoop Kumar", "Alfy Samuel", "Daben Liu", "Sai Praneeth Karimireddy", "Salman Avestimehr"], "categories": ["cs.CL"], "comment": null, "summary": "Generative Large Language Models (LLMs)inevitably produce untruthful\nresponses. Accurately predicting the truthfulness of these outputs is critical,\nespecially in high-stakes settings. To accelerate research in this domain and\nmake truthfulness prediction methods more accessible, we introduce TruthTorchLM\nan open-source, comprehensive Python library featuring over 30 truthfulness\nprediction methods, which we refer to as Truth Methods. Unlike existing\ntoolkits such as Guardrails, which focus solely on document-grounded\nverification, or LM-Polygraph, which is limited to uncertainty-based methods,\nTruthTorchLM offers a broad and extensible collection of techniques. These\nmethods span diverse tradeoffs in computational cost, access level (e.g.,\nblack-box vs white-box), grounding document requirements, and supervision type\n(self-supervised or supervised). TruthTorchLM is seamlessly compatible with\nboth HuggingFace and LiteLLM, enabling support for locally hosted and API-based\nmodels. It also provides a unified interface for generation, evaluation,\ncalibration, and long-form truthfulness prediction, along with a flexible\nframework for extending the library with new methods. We conduct an evaluation\nof representative truth methods on three datasets, TriviaQA, GSM8K, and\nFactScore-Bio. The code is available at https://github.com/Ybakman/TruthTorchLM"}
{"id": "2507.08218", "pdf": "https://arxiv.org/pdf/2507.08218.pdf", "abs": "https://arxiv.org/abs/2507.08218", "title": "Simple Mechanistic Explanations for Out-Of-Context Reasoning", "authors": ["Atticus Wang", "Joshua Engels", "Oliver Clive-Griffin"], "categories": ["cs.CL", "cs.LG"], "comment": "ICML 2025 Workshop R2-FM", "summary": "Out-of-context reasoning (OOCR) is a phenomenon in which fine-tuned LLMs\nexhibit surprisingly deep out-of-distribution generalization. Rather than\nlearning shallow heuristics, they implicitly internalize and act on the\nconsequences of observations scattered throughout the fine-tuning data. In this\nwork, we investigate this phenomenon mechanistically and find that many\ninstances of OOCR in the literature have a simple explanation: the LoRA\nfine-tuning essentially adds a constant steering vector, steering the model\ntowards a general concept. This improves performance on the fine-tuning task\nand in many other concept-related domains, causing the surprising\ngeneralization. Moreover, we can directly train steering vectors for these\ntasks from scratch, which also induces OOCR. We find that our results hold even\nfor a task that seems like it must involve conditional behavior (model\nbackdoors); it turns out that unconditionally adding a steering vector is\nsufficient. Overall, our work presents one explanation of what gets learned\nduring fine-tuning for OOCR tasks, contributing to the key question of why LLMs\ncan reason out of context, an advanced capability that is highly relevant to\ntheir safe and reliable deployment."}
{"id": "2507.08232", "pdf": "https://arxiv.org/pdf/2507.08232.pdf", "abs": "https://arxiv.org/abs/2507.08232", "title": "Can LLMs Reliably Simulate Real Students' Abilities in Mathematics and Reading Comprehension?", "authors": ["KV Aditya Srivatsa", "Kaushal Kumar Maurya", "Ekaterina Kochmar"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted to the 20th Workshop on Innovative Use of NLP for Building\n  Educational Applications (BEA), co-located with ACL 2025", "summary": "Large Language Models (LLMs) are increasingly used as proxy students in the\ndevelopment of Intelligent Tutoring Systems (ITSs) and in piloting test\nquestions. However, to what extent these proxy students accurately emulate the\nbehavior and characteristics of real students remains an open question. To\ninvestigate this, we collected a dataset of 489 items from the National\nAssessment of Educational Progress (NAEP), covering mathematics and reading\ncomprehension in grades 4, 8, and 12. We then apply an Item Response Theory\n(IRT) model to position 11 diverse and state-of-the-art LLMs on the same\nability scale as real student populations. Our findings reveal that, without\nguidance, strong general-purpose models consistently outperform the average\nstudent at every grade, while weaker or domain-mismatched models may align\nincidentally. Using grade-enforcement prompts changes models' performance, but\nwhether they align with the average grade-level student remains highly model-\nand prompt-specific: no evaluated model-prompt pair fits the bill across\nsubjects and grades, underscoring the need for new training and evaluation\nstrategies. We conclude by providing guidelines for the selection of viable\nproxies based on our findings."}
{"id": "2507.08241", "pdf": "https://arxiv.org/pdf/2507.08241.pdf", "abs": "https://arxiv.org/abs/2507.08241", "title": "Exploring Gender Differences in Chronic Pain Discussions on Reddit", "authors": ["Ancita Maria Andrade", "Tanvi Banerjee", "Ramakrishna Mundugar"], "categories": ["cs.CL", "cs.LG"], "comment": "This is an extended version of the short paper accepted at ASONAM\n  2025", "summary": "Pain is an inherent part of human existence, manifesting as both physical and\nemotional experiences, and can be categorized as either acute or chronic. Over\nthe years, extensive research has been conducted to understand the causes of\npain and explore potential treatments, with contributions from various\nscientific disciplines. However, earlier studies often overlooked the role of\ngender in pain experiences. In this study, we utilized Natural Language\nProcessing (NLP) to analyze and gain deeper insights into individuals' pain\nexperiences, with a particular focus on gender differences. We successfully\nclassified posts into male and female corpora using the Hidden Attribute\nModel-Convolutional Neural Network (HAM-CNN), achieving an F1 score of 0.86 by\naggregating posts based on usernames. Our analysis revealed linguistic\ndifferences between genders, with female posts tending to be more emotionally\nfocused. Additionally, the study highlighted that conditions such as migraine\nand sinusitis are more prevalent among females and explored how pain medication\naffects individuals differently based on gender."}
{"id": "2507.08297", "pdf": "https://arxiv.org/pdf/2507.08297.pdf", "abs": "https://arxiv.org/abs/2507.08297", "title": "KAT-V1: Kwai-AutoThink Technical Report", "authors": ["Zizheng Zhan", "Ken Deng", "Huaixi Tang", "Wen Xiang", "Kun Wu", "Weihao Li", "Wenqiang Zhu", "Jingxuan Xu", "Lecheng Huang", "Zongxian Feng", "Shaojie Wang", "Shangpeng Yan", "Jiaheng Liu", "Zhongyuan Peng", "Zuchen Gao", "Haoyang Huang", "Ziqi Zhan", "Yanan Wu", "Yuanxing Zhang", "Jian Yang", "Guang Chen", "Haotian Zhang", "Bin Chen", "Bing Yu"], "categories": ["cs.CL"], "comment": null, "summary": "We present Kwaipilot-AutoThink (KAT), an open-source 40B large language model\ndeveloped to address the overthinking problem in reasoning-intensive tasks,\nwhere an automatic thinking training paradigm is proposed to dynamically switch\nbetween reasoning and non-reasoning modes based on task complexity.\nSpecifically, first, we construct the dual-regime dataset based on a novel\ntagging pipeline and a multi-agent synthesis strategy, and then we apply\nMulti-Token Prediction (MTP)-enhanced knowledge distillation, enabling\nefficient and fine-grained reasoning transfer with minimal pretraining cost.\nBesides, we implement a cold-start initialization strategy that introduces\nmode-selection priors using majority-vote signals and intent-aware prompting.\nFinally, we propose Step-SRPO, a reinforcement learning algorithm that\nincorporates intermediate supervision into the GRPO framework, offering\nstructured guidance over both reasoning-mode selection and response accuracy.\nExtensive experiments across multiple benchmarks demonstrate that KAT\nconsistently matches or even outperforms current state-of-the-art models,\nincluding DeepSeek-R1-0528 and Qwen3-235B-A22B, across a wide range of\nreasoning-intensive tasks while reducing token usage by up to approximately\n30\\%. Beyond academic evaluation, KAT has been successfully deployed in\nKwaipilot (i.e., Kuaishou's internal coding assistant), and improves real-world\ndevelopment workflows with high accuracy, efficiency, and controllable\nreasoning behaviors. Moreover, we are actively training a 200B\nMixture-of-Experts (MoE) with 40B activation parameters, where the early-stage\nresults already demonstrate promising improvements in performance and\nefficiency, further showing the scalability of the AutoThink paradigm."}
{"id": "2507.08309", "pdf": "https://arxiv.org/pdf/2507.08309.pdf", "abs": "https://arxiv.org/abs/2507.08309", "title": "Improving MLLM's Document Image Machine Translation via Synchronously Self-reviewing Its OCR Proficiency", "authors": ["Yupu Liang", "Yaping Zhang", "Zhiyang Zhang", "Zhiyuan Chen", "Yang Zhao", "Lu Xiang", "Chengqing Zong", "Yu Zhou"], "categories": ["cs.CL", "cs.AI", "cs.CV"], "comment": "Accepted by ACL 2025 Findings", "summary": "Multimodal Large Language Models (MLLMs) have shown strong performance in\ndocument image tasks, especially Optical Character Recognition (OCR). However,\nthey struggle with Document Image Machine Translation (DIMT), which requires\nhandling both cross-modal and cross-lingual challenges. Previous efforts to\nenhance DIMT capability through Supervised Fine-Tuning (SFT) on the DIMT\ndataset often result in the forgetting of the model's existing monolingual\nabilities, such as OCR. To address these challenges, we introduce a novel\nfine-tuning paradigm, named Synchronously Self-Reviewing (SSR) its OCR\nproficiency, inspired by the concept \"Bilingual Cognitive Advantage\".\nSpecifically, SSR prompts the model to generate OCR text before producing\ntranslation text, which allows the model to leverage its strong monolingual OCR\nability while learning to translate text across languages. Comprehensive\nexperiments demonstrate the proposed SSR learning helps mitigate catastrophic\nforgetting, improving the generalization ability of MLLMs on both OCR and DIMT\ntasks."}
{"id": "2507.08325", "pdf": "https://arxiv.org/pdf/2507.08325.pdf", "abs": "https://arxiv.org/abs/2507.08325", "title": "CRMAgent: A Multi-Agent LLM System for E-Commerce CRM Message Template Generation", "authors": ["Yinzhu Quan", "Xinrui Li", "Ying Chen"], "categories": ["cs.CL", "cs.MA"], "comment": null, "summary": "In e-commerce private-domain channels such as instant messaging and e-mail,\nmerchants engage customers directly as part of their Customer Relationship\nManagement (CRM) programmes to drive retention and conversion. While a few top\nperformers excel at crafting outbound messages, most merchants struggle to\nwrite persuasive copy because they lack both expertise and scalable tools. We\nintroduce CRMAgent, a multi-agent system built on large language models (LLMs)\nthat generates high-quality message templates and actionable writing guidance\nthrough three complementary modes. First, group-based learning enables the\nagent to learn from a merchant's own top-performing messages within the same\naudience segment and rewrite low-performing ones. Second,\nretrieval-and-adaptation fetches templates that share the same audience segment\nand exhibit high similarity in voucher type and product category, learns their\nsuccessful patterns, and adapts them to the current campaign. Third, a\nrule-based fallback provides a lightweight zero-shot rewrite when no suitable\nreferences are available. Extensive experiments show that CRMAgent consistently\noutperforms merchants' original templates, delivering significant gains in both\naudience-match and marketing-effectiveness metrics."}
{"id": "2507.08335", "pdf": "https://arxiv.org/pdf/2507.08335.pdf", "abs": "https://arxiv.org/abs/2507.08335", "title": "MK2 at PBIG Competition: A Prompt Generation Solution", "authors": ["Yuzheng Xu", "Tosho Hirasawa", "Seiya Kawano", "Shota Kato", "Tadashi Kozuno"], "categories": ["cs.CL"], "comment": "9 pages, to appear in the 2nd Workshop on Agent AI for Scenario\n  Planning (AGENTSCEN 2025)", "summary": "The Patent-Based Idea Generation task asks systems to turn real patents into\nproduct ideas viable within three years. We propose MK2, a prompt-centric\npipeline: Gemini 2.5 drafts and iteratively edits a prompt, grafting useful\nfragments from weaker outputs; GPT-4.1 then uses this prompt to create one idea\nper patent, and an Elo loop judged by Qwen3-8B selects the best prompt-all\nwithout extra training data. Across three domains, two evaluator types, and six\ncriteria, MK2 topped the automatic leaderboard and won 25 of 36 tests. Only the\nmaterials-chemistry track lagged, indicating the need for deeper domain\ngrounding; yet, the results show that lightweight prompt engineering has\nalready delivered competitive, commercially relevant ideation from patents."}
{"id": "2507.08336", "pdf": "https://arxiv.org/pdf/2507.08336.pdf", "abs": "https://arxiv.org/abs/2507.08336", "title": "Distillation versus Contrastive Learning: How to Train Your Rerankers", "authors": ["Zhichao Xu", "Zhiqi Huang", "Shengyao Zhuang", "Ashim Gupta", "Vivek Srikumar"], "categories": ["cs.CL", "cs.IR"], "comment": null, "summary": "Training text rerankers is crucial for information retrieval. Two primary\nstrategies are widely used: contrastive learning (optimizing directly on\nground-truth labels) and knowledge distillation (transferring knowledge from a\nlarger reranker). While both have been studied in the literature, a clear\ncomparison of their effectiveness for training cross-encoder rerankers under\npractical conditions is needed.\n  This paper empirically compares these strategies by training rerankers of\ndifferent sizes and architectures using both methods on the same data, with a\nstrong contrastive learning model acting as the distillation teacher. Our\nresults show that knowledge distillation generally yields better in-domain and\nout-of-domain ranking performance than contrastive learning when distilling\nfrom a larger teacher model. This finding is consistent across student model\nsizes and architectures. However, distilling from a teacher of the same\ncapacity does not provide the same advantage, particularly for out-of-domain\ntasks. These findings offer practical guidance for choosing a training strategy\nbased on available teacher models. Therefore, we recommend using knowledge\ndistillation to train smaller rerankers if a larger, more powerful teacher is\naccessible; in its absence, contrastive learning provides a strong and more\nreliable alternative otherwise."}
{"id": "2507.08339", "pdf": "https://arxiv.org/pdf/2507.08339.pdf", "abs": "https://arxiv.org/abs/2507.08339", "title": "What Factors Affect LLMs and RLLMs in Financial Question Answering?", "authors": ["Peng Wang", "Xuesi Hu", "Jiageng Wu", "Yuntao Zou", "Qiancheng Zhang", "Dagang Li"], "categories": ["cs.CL"], "comment": "Preprint", "summary": "Recently, the development of large language models (LLMs) and reasoning large\nlanguage models (RLLMs) have gained considerable attention from many\nresearchers. RLLMs enhance the reasoning capabilities of LLMs through Long\nChain-of-Thought (Long CoT) processes, significantly improving the performance\nof LLMs in addressing complex problems. However, there are few works that\nsystematically explore what methods can fully unlock the performance of LLMs\nand RLLMs within the financial domain. To investigate the impact of various\nmethods on LLMs and RLLMs, we utilize five LLMs and three RLLMs to assess the\neffects of prompting methods, agentic frameworks, and multilingual alignment\nmethods on financial question-answering tasks. Our research findings indicate:\n(1) Current prompting methods and agent frameworks enhance the performance of\nLLMs in financial question answering by simulating Long CoT; (2) RLLMs possess\ninherent Long CoT capabilities, which limits the effectiveness of conventional\nmethods in further enhancing their performance; (3) Current advanced\nmultilingual alignment methods primarily improve the multilingual performance\nof LLMs by extending the reasoning length, which yields minimal benefits for\nRLLMs. We hope that this study can serve as an important reference for LLMs and\nRLLMs in the field of financial question answering."}
{"id": "2507.08342", "pdf": "https://arxiv.org/pdf/2507.08342.pdf", "abs": "https://arxiv.org/abs/2507.08342", "title": "Beyond N-Grams: Rethinking Evaluation Metrics and Strategies for Multilingual Abstractive Summarization", "authors": ["Itai Mondshine", "Tzuf Paz-Argaman", "Reut Tsarfaty"], "categories": ["cs.CL"], "comment": "ACL 2025 Main", "summary": "Automatic n-gram based metrics such as ROUGE are widely used for evaluating\ngenerative tasks such as summarization. While these metrics are considered\nindicative (even if imperfect) of human evaluation for English, their\nsuitability for other languages remains unclear. To address this, we\nsystematically assess evaluation metrics for generation both n-gram-based and\nneural based to evaluate their effectiveness across languages and tasks.\nSpecifically, we design a large-scale evaluation suite across eight languages\nfrom four typological families: agglutinative, isolating, low-fusional, and\nhigh-fusional, spanning both low- and high-resource settings, to analyze their\ncorrelation with human judgments. Our findings highlight the sensitivity of\nevaluation metrics to the language type. For example, in fusional languages,\nn-gram-based metrics show lower correlation with human assessments compared to\nisolating and agglutinative languages. We also demonstrate that proper\ntokenization can significantly mitigate this issue for morphologically rich\nfusional languages, sometimes even reversing negative trends. Additionally, we\nshow that neural-based metrics specifically trained for evaluation, such as\nCOMET, consistently outperform other neural metrics and better correlate with\nhuman judgments in low-resource languages. Overall, our analysis highlights the\nlimitations of n-gram metrics for fusional languages and advocates for greater\ninvestment in neural-based metrics trained for evaluation tasks."}
{"id": "2507.08350", "pdf": "https://arxiv.org/pdf/2507.08350.pdf", "abs": "https://arxiv.org/abs/2507.08350", "title": "Exploring Design of Multi-Agent LLM Dialogues for Research Ideation", "authors": ["Keisuke Ueda", "Wataru Hirota", "Takuto Asakura", "Takahiro Omi", "Kosuke Takahashi", "Kosuke Arima", "Tatsuya Ishigaki"], "categories": ["cs.CL", "cs.MA", "I.2.11; I.2.7"], "comment": "16 pages, 1 figure, appendix. Accepted to SIGDIAL 2025", "summary": "Large language models (LLMs) are increasingly used to support creative tasks\nsuch as research idea generation. While recent work has shown that structured\ndialogues between LLMs can improve the novelty and feasibility of generated\nideas, the optimal design of such interactions remains unclear. In this study,\nwe conduct a comprehensive analysis of multi-agent LLM dialogues for scientific\nideation. We compare different configurations of agent roles, number of agents,\nand dialogue depth to understand how these factors influence the novelty and\nfeasibility of generated ideas. Our experimental setup includes settings where\none agent generates ideas and another critiques them, enabling iterative\nimprovement. Our results show that enlarging the agent cohort, deepening the\ninteraction depth, and broadening agent persona heterogeneity each enrich the\ndiversity of generated ideas. Moreover, specifically increasing critic-side\ndiversity within the ideation-critique-revision loop further boosts the\nfeasibility of the final proposals. Our findings offer practical guidelines for\nbuilding effective multi-agent LLM systems for scientific ideation. Our code is\navailable at https://github.com/g6000/MultiAgent-Research-Ideator."}
{"id": "2507.08371", "pdf": "https://arxiv.org/pdf/2507.08371.pdf", "abs": "https://arxiv.org/abs/2507.08371", "title": "The Curious Case of Factuality Finetuning: Models' Internal Beliefs Can Improve Factuality", "authors": ["Benjamin Newman", "Abhilasha Ravichander", "Jaehun Jung", "Rui Xin", "Hamish Ivison", "Yegor Kuznetsov", "Pang Wei Koh", "Yejin Choi"], "categories": ["cs.CL"], "comment": "29 pages, 4 figures, 16 tables", "summary": "Language models are prone to hallucination - generating text that is\nfactually incorrect. Finetuning models on high-quality factual information can\npotentially reduce hallucination, but concerns remain; obtaining factual gold\ndata can be expensive and training on correct but unfamiliar data may\npotentially lead to even more downstream hallucination. What data should\npractitioners finetune on to mitigate hallucinations in language models? In\nthis work, we study the relationship between the factuality of finetuning data\nand the prevalence of hallucinations in long-form generation tasks.\nCounterintuitively, we find that finetuning on factual gold data is not as\nhelpful as finetuning on model-generated data that models believe to be\nfactual. Next, we evaluate filtering strategies applied on both factual gold\ndata and model-generated data, and find that finetuning on model-generated data\nthat is filtered by models' own internal judgments often leads to better\noverall factuality compared to other configurations: training on gold data\nfiltered by models' judgments, training on gold data alone, or training on\nmodel-generated data that is supported by gold data. These factuality\nimprovements transfer across three domains we study, suggesting that a models'\nown beliefs can provide a powerful signal for factuality."}
{"id": "2507.08425", "pdf": "https://arxiv.org/pdf/2507.08425.pdf", "abs": "https://arxiv.org/abs/2507.08425", "title": "A Survey of Large Language Models in Discipline-specific Research: Challenges, Methods and Opportunities", "authors": ["Lu Xiang", "Yang Zhao", "Yaping Zhang", "Chengqing Zong"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) have demonstrated their transformative potential\nacross numerous disciplinary studies, reshaping the existing research\nmethodologies and fostering interdisciplinary collaboration. However, a\nsystematic understanding of their integration into diverse disciplines remains\nunderexplored. This survey paper provides a comprehensive overview of the\napplication of LLMs in interdisciplinary studies, categorising research efforts\nfrom both a technical perspective and with regard to their applicability. From\na technical standpoint, key methodologies such as supervised fine-tuning,\nretrieval-augmented generation, agent-based approaches, and tool-use\nintegration are examined, which enhance the adaptability and effectiveness of\nLLMs in discipline-specific contexts. From the perspective of their\napplicability, this paper explores how LLMs are contributing to various\ndisciplines including mathematics, physics, chemistry, biology, and the\nhumanities and social sciences, demonstrating their role in discipline-specific\ntasks. The prevailing challenges are critically examined and the promising\nresearch directions are highlighted alongside the recent advances in LLMs. By\nproviding a comprehensive overview of the technical developments and\napplications in this field, this survey aims to serve as an invaluable resource\nfor the researchers who are navigating the complex landscape of LLMs in the\ncontext of interdisciplinary studies."}
{"id": "2507.08427", "pdf": "https://arxiv.org/pdf/2507.08427.pdf", "abs": "https://arxiv.org/abs/2507.08427", "title": "ChainEdit: Propagating Ripple Effects in LLM Knowledge Editing through Logical Rule-Guided Chains", "authors": ["Zilu Dong", "Xiangqing Shen", "Zinong Yang", "Rui Xia"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted to ACL 2025 (main)", "summary": "Current knowledge editing methods for large language models (LLMs) struggle\nto maintain logical consistency when propagating ripple effects to associated\nfacts. We propose ChainEdit, a framework that synergizes knowledge\ngraph-derived logical rules with LLM logical reasoning capabilities to enable\nsystematic chain updates. By automatically extracting logical patterns from\nstructured knowledge bases and aligning them with LLMs' internal logics,\nChainEdit dynamically generates and edits logically connected knowledge\nclusters. Experiments demonstrate an improvement of more than 30% in logical\ngeneralization over baselines while preserving editing reliability and\nspecificity. We further address evaluation biases in existing benchmarks\nthrough knowledge-aware protocols that disentangle external dependencies. This\nwork establishes new state-of-the-art performance on ripple effect while\nensuring internal logical consistency after knowledge editing."}
{"id": "2507.08440", "pdf": "https://arxiv.org/pdf/2507.08440.pdf", "abs": "https://arxiv.org/abs/2507.08440", "title": "Finding Common Ground: Using Large Language Models to Detect Agreement in Multi-Agent Decision Conferences", "authors": ["Selina Heller", "Mohamed Ibrahim", "David Antony Selby", "Sebastian Vollmer"], "categories": ["cs.CL", "cs.AI", "cs.MA"], "comment": null, "summary": "Decision conferences are structured, collaborative meetings that bring\ntogether experts from various fields to address complex issues and reach a\nconsensus on recommendations for future actions or policies. These conferences\noften rely on facilitated discussions to ensure productive dialogue and\ncollective agreement. Recently, Large Language Models (LLMs) have shown\nsignificant promise in simulating real-world scenarios, particularly through\ncollaborative multi-agent systems that mimic group interactions. In this work,\nwe present a novel LLM-based multi-agent system designed to simulate decision\nconferences, specifically focusing on detecting agreement among the participant\nagents. To achieve this, we evaluate six distinct LLMs on two tasks: stance\ndetection, which identifies the position an agent takes on a given issue, and\nstance polarity detection, which identifies the sentiment as positive,\nnegative, or neutral. These models are further assessed within the multi-agent\nsystem to determine their effectiveness in complex simulations. Our results\nindicate that LLMs can reliably detect agreement even in dynamic and nuanced\ndebates. Incorporating an agreement-detection agent within the system can also\nimprove the efficiency of group debates and enhance the overall quality and\ncoherence of deliberations, making them comparable to real-world decision\nconferences regarding outcome and decision-making. These findings demonstrate\nthe potential for LLM-based multi-agent systems to simulate group\ndecision-making processes. They also highlight that such systems could be\ninstrumental in supporting decision-making with expert elicitation workshops\nacross various domains."}
{"id": "2507.08459", "pdf": "https://arxiv.org/pdf/2507.08459.pdf", "abs": "https://arxiv.org/abs/2507.08459", "title": "Diagnosing Failures in Large Language Models' Answers: Integrating Error Attribution into Evaluation Framework", "authors": ["Zishan Xu", "Shuyi Xie", "Qingsong Lv", "Shupei Xiao", "Linlin Song", "Sui Wenjuan", "Fan Lin"], "categories": ["cs.CL"], "comment": null, "summary": "With the widespread application of Large Language Models (LLMs) in various\ntasks, the mainstream LLM platforms generate massive user-model interactions\ndaily. In order to efficiently analyze the performance of models and diagnose\nfailures in their answers, it is essential to develop an automated framework to\nsystematically categorize and attribute errors. However, existing evaluation\nmodels lack error attribution capability. In this work, we establish a\ncomprehensive Misattribution Framework with 6 primary and 15 secondary\ncategories to facilitate in-depth analysis. Based on this framework, we present\nAttriData, a dataset specifically designed for error attribution, encompassing\nmisattribution, along with the corresponding scores and feedback. We also\npropose MisAttributionLLM, a fine-tuned model on AttriData, which is the first\ngeneral-purpose judge model capable of simultaneously generating score,\nmisattribution, and feedback. Extensive experiments and analyses are conducted\nto confirm the effectiveness and robustness of our proposed method."}
{"id": "2507.08468", "pdf": "https://arxiv.org/pdf/2507.08468.pdf", "abs": "https://arxiv.org/abs/2507.08468", "title": "Using Large Language Models for Legal Decision-Making in Austrian Value-Added Tax Law: An Experimental Study", "authors": ["Marina Luketina", "Andrea Benkel", "Christoph G. Schuetz"], "categories": ["cs.CL"], "comment": "26 pages, 5 figures, 6 tables", "summary": "This paper provides an experimental evaluation of the capability of large\nlanguage models (LLMs) to assist in legal decision-making within the framework\nof Austrian and European Union value-added tax (VAT) law. In tax consulting\npractice, clients often describe cases in natural language, making LLMs a prime\ncandidate for supporting automated decision-making and reducing the workload of\ntax professionals. Given the requirement for legally grounded and\nwell-justified analyses, the propensity of LLMs to hallucinate presents a\nconsiderable challenge. The experiments focus on two common methods for\nenhancing LLM performance: fine-tuning and retrieval-augmented generation\n(RAG). In this study, these methods are applied on both textbook cases and\nreal-world cases from a tax consulting firm to systematically determine the\nbest configurations of LLM-based systems and assess the legal-reasoning\ncapabilities of LLMs. The findings highlight the potential of using LLMs to\nsupport tax consultants by automating routine tasks and providing initial\nanalyses, although current prototypes are not ready for full automation due to\nthe sensitivity of the legal domain. The findings indicate that LLMs, when\nproperly configured, can effectively support tax professionals in VAT tasks and\nprovide legally grounded justifications for decisions. However, limitations\nremain regarding the handling of implicit client knowledge and context-specific\ndocumentation, underscoring the need for future integration of structured\nbackground information."}
{"id": "2507.08477", "pdf": "https://arxiv.org/pdf/2507.08477.pdf", "abs": "https://arxiv.org/abs/2507.08477", "title": "ILT-Iterative LoRA Training through Focus-Feedback-Fix for Multilingual Speech Recognition", "authors": ["Qingliang Meng", "Hao Wu", "Wei Liang", "Wei Xu", "Qing Zhao"], "categories": ["cs.CL"], "comment": "Accepted By Interspeech 2025 MLC-SLM workshop as a Research Paper", "summary": "The deep integration of large language models and automatic speech\nrecognition systems has become a promising research direction with high\npractical value. To address the overfitting issue commonly observed in Low-Rank\nAdaptation (LoRA) during the supervised fine-tuning (SFT) stage, this work\nproposes an innovative training paradigm Iterative LoRA Training (ILT) in\ncombination with an Iterative Pseudo Labeling strategy, effectively enhancing\nthe theoretical upper bound of model performance. Based on Whisper-large-v3 and\nQwen2-Audio, we conduct systematic experiments using a three-stage training\nprocess: Focus Training, Feed Back Training, and Fix Training. Experimental\nresults demonstrate the effectiveness of the proposed method. Furthermore, the\nMegaAIS research team applied this technique in the Interspeech 2025\nMultilingual Conversational Speech Language Modeling Challenge (MLC-SLM),\nachieving 4th in Track 1 (Multilingual ASR Task) and 1st place in Track 2\n(Speech Separation and Recognition Task), showcasing the practical feasibility\nand strong application potential of our approach."}
{"id": "2507.08487", "pdf": "https://arxiv.org/pdf/2507.08487.pdf", "abs": "https://arxiv.org/abs/2507.08487", "title": "Enhancing Essay Cohesion Assessment: A Novel Item Response Theory Approach", "authors": ["Bruno Alexandre Rosa", "Hilário Oliveira", "Luiz Rodrigues", "Eduardo Araujo Oliveira", "Rafael Ferreira Mello"], "categories": ["cs.CL", "cs.AI"], "comment": "24 pages, 4 tables", "summary": "Essays are considered a valuable mechanism for evaluating learning outcomes\nin writing. Textual cohesion is an essential characteristic of a text, as it\nfacilitates the establishment of meaning between its parts. Automatically\nscoring cohesion in essays presents a challenge in the field of educational\nartificial intelligence. The machine learning algorithms used to evaluate texts\ngenerally do not consider the individual characteristics of the instances that\ncomprise the analysed corpus. In this meaning, item response theory can be\nadapted to the context of machine learning, characterising the ability,\ndifficulty and discrimination of the models used. This work proposes and\nanalyses the performance of a cohesion score prediction approach based on item\nresponse theory to adjust the scores generated by machine learning models. In\nthis study, the corpus selected for the experiments consisted of the extended\nEssay-BR, which includes 6,563 essays in the style of the National High School\nExam (ENEM), and the Brazilian Portuguese Narrative Essays, comprising 1,235\nessays written by 5th to 9th grade students from public schools. We extracted\n325 linguistic features and treated the problem as a machine learning\nregression task. The experimental results indicate that the proposed approach\noutperforms conventional machine learning models and ensemble methods in\nseveral evaluation metrics. This research explores a potential approach for\nimproving the automatic evaluation of cohesion in educational essays."}
{"id": "2507.08491", "pdf": "https://arxiv.org/pdf/2507.08491.pdf", "abs": "https://arxiv.org/abs/2507.08491", "title": "A Third Paradigm for LLM Evaluation: Dialogue Game-Based Evaluation using clembench", "authors": ["David Schlangen", "Sherzod Hakimov", "Jonathan Jordan", "Philipp Sadler"], "categories": ["cs.CL"], "comment": "All code required to run the benchmark, as well as extensive\n  documentation, is available at https://github.com/clembench/clembench", "summary": "There are currently two main paradigms for evaluating large language models\n(LLMs), reference-based evaluation and preference-based evaluation. The first,\ncarried over from the evaluation of machine learning models in general, relies\non pre-defined task instances, for which reference task executions are\navailable. The second, best exemplified by the LM-arena, relies on (often\nself-selected) users bringing their own intents to a site that routes these to\nseveral models in parallel, among whose responses the user then selects their\nmost preferred one. The former paradigm hence excels at control over what is\ntested, while the latter comes with higher ecological validity, testing actual\nuse cases interactively. Recently, a third complementary paradigm has emerged\nthat combines some of the strengths of these approaches, offering control over\nmulti-turn, reference-free, repeatable interactions, while stressing\ngoal-directedness: dialogue game based evaluation. While the utility of this\napproach has been shown by several projects, its adoption has been held back by\nthe lack of a mature, easily re-usable implementation. In this paper, we\npresent clembench, which has been in continuous development since 2023 and has\nin its latest release been optimized for ease of general use. We describe how\nit can be used to benchmark one's own models (using a provided set of benchmark\ngame instances in English), as well as how easily the benchmark itself can be\nextended with new, tailor-made targeted tests."}
{"id": "2507.08496", "pdf": "https://arxiv.org/pdf/2507.08496.pdf", "abs": "https://arxiv.org/abs/2507.08496", "title": "LLaPa: A Vision-Language Model Framework for Counterfactual-Aware Procedural Planning", "authors": ["Shibo Sun", "Xue Li", "Donglin Di", "Mingjie Wei", "Lanshun Nie", "Wei-Nan Zhang", "Dechen Zhan", "Yang Song", "Lei Fan"], "categories": ["cs.CL"], "comment": null, "summary": "While large language models (LLMs) have advanced procedural planning for\nembodied AI systems through strong reasoning abilities, the integration of\nmultimodal inputs and counterfactual reasoning remains underexplored. To tackle\nthese challenges, we introduce LLaPa, a vision-language model framework\ndesigned for multimodal procedural planning. LLaPa generates executable action\nsequences from textual task descriptions and visual environmental images using\nvision-language models (VLMs). Furthermore, we enhance LLaPa with two auxiliary\nmodules to improve procedural planning. The first module, the Task-Environment\nReranker (TER), leverages task-oriented segmentation to create a task-sensitive\nfeature space, aligning textual descriptions with visual environments and\nemphasizing critical regions for procedural execution. The second module, the\nCounterfactual Activities Retriever (CAR), identifies and emphasizes potential\ncounterfactual conditions, enhancing the model's reasoning capability in\ncounterfactual scenarios. Extensive experiments on ActPlan-1K and ALFRED\nbenchmarks demonstrate that LLaPa generates higher-quality plans with superior\nLCS and correctness, outperforming advanced models. The code and models are\navailable https://github.com/sunshibo1234/LLaPa."}
{"id": "2507.08498", "pdf": "https://arxiv.org/pdf/2507.08498.pdf", "abs": "https://arxiv.org/abs/2507.08498", "title": "Semantic-Augmented Latent Topic Modeling with LLM-in-the-Loop", "authors": ["Mengze Hong", "Chen Jason Zhang", "Di Jiang"], "categories": ["cs.CL"], "comment": null, "summary": "Latent Dirichlet Allocation (LDA) is a prominent generative probabilistic\nmodel used for uncovering abstract topics within document collections. In this\npaper, we explore the effectiveness of augmenting topic models with Large\nLanguage Models (LLMs) through integration into two key phases: Initialization\nand Post-Correction. Since the LDA is highly dependent on the quality of its\ninitialization, we conduct extensive experiments on the LLM-guided topic\nclustering for initializing the Gibbs sampling algorithm. Interestingly, the\nexperimental results reveal that while the proposed initialization strategy\nimproves the early iterations of LDA, it has no effect on the convergence and\nyields the worst performance compared to the baselines. The LLM-enabled\npost-correction, on the other hand, achieved a promising improvement of 5.86%\nin the coherence evaluation. These results highlight the practical benefits of\nthe LLM-in-the-loop approach and challenge the belief that LLMs are always the\nsuperior text mining alternative."}
{"id": "2507.08499", "pdf": "https://arxiv.org/pdf/2507.08499.pdf", "abs": "https://arxiv.org/abs/2507.08499", "title": "PromotionGo at SemEval-2025 Task 11: A Feature-Centric Framework for Cross-Lingual Multi-Emotion Detection in Short Texts", "authors": ["Ziyi Huang", "Xia Cui"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "This paper presents our system for SemEval 2025 Task 11: Bridging the Gap in\nText-Based Emotion Detection (Track A), which focuses on multi-label emotion\ndetection in short texts. We propose a feature-centric framework that\ndynamically adapts document representations and learning algorithms to optimize\nlanguage-specific performance. Our study evaluates three key components:\ndocument representation, dimensionality reduction, and model training in 28\nlanguages, highlighting five for detailed analysis. The results show that\nTF-IDF remains highly effective for low-resource languages, while contextual\nembeddings like FastText and transformer-based document representations, such\nas those produced by Sentence-BERT, exhibit language-specific strengths.\nPrincipal Component Analysis (PCA) reduces training time without compromising\nperformance, particularly benefiting FastText and neural models such as\nMulti-Layer Perceptrons (MLP). Computational efficiency analysis underscores\nthe trade-off between model complexity and processing cost. Our framework\nprovides a scalable solution for multilingual emotion detection, addressing the\nchallenges of linguistic diversity and resource constraints."}
{"id": "2507.08538", "pdf": "https://arxiv.org/pdf/2507.08538.pdf", "abs": "https://arxiv.org/abs/2507.08538", "title": "The AI Language Proficiency Monitor -- Tracking the Progress of LLMs on Multilingual Benchmarks", "authors": ["David Pomerenke", "Jonas Nothnagel", "Simon Ostermann"], "categories": ["cs.CL"], "comment": null, "summary": "To ensure equitable access to the benefits of large language models (LLMs),\nit is essential to evaluate their capabilities across the world's languages. We\nintroduce the AI Language Proficiency Monitor, a comprehensive multilingual\nbenchmark that systematically assesses LLM performance across up to 200\nlanguages, with a particular focus on low-resource languages. Our benchmark\naggregates diverse tasks including translation, question answering, math, and\nreasoning, using datasets such as FLORES+, MMLU, GSM8K, TruthfulQA, and ARC. We\nprovide an open-source, auto-updating leaderboard and dashboard that supports\nresearchers, developers, and policymakers in identifying strengths and gaps in\nmodel performance. In addition to ranking models, the platform offers\ndescriptive insights such as a global proficiency map and trends over time. By\ncomplementing and extending prior multilingual benchmarks, our work aims to\nfoster transparency, inclusivity, and progress in multilingual AI. The system\nis available at\nhttps://huggingface.co/spaces/fair-forward/evals-for-every-language."}
{"id": "2507.08606", "pdf": "https://arxiv.org/pdf/2507.08606.pdf", "abs": "https://arxiv.org/abs/2507.08606", "title": "DocPolarBERT: A Pre-trained Model for Document Understanding with Relative Polar Coordinate Encoding of Layout Structures", "authors": ["Benno Uthayasooriyar", "Antoine Ly", "Franck Vermet", "Caio Corro"], "categories": ["cs.CL"], "comment": null, "summary": "We introduce DocPolarBERT, a layout-aware BERT model for document\nunderstanding that eliminates the need for absolute 2D positional embeddings.\nWe extend self-attention to take into account text block positions in relative\npolar coordinate system rather than the Cartesian one. Despite being\npre-trained on a dataset more than six times smaller than the widely used\nIIT-CDIP corpus, DocPolarBERT achieves state-of-the-art results. These results\ndemonstrate that a carefully designed attention mechanism can compensate for\nreduced pre-training data, offering an efficient and effective alternative for\ndocument understanding."}
{"id": "2507.08621", "pdf": "https://arxiv.org/pdf/2507.08621.pdf", "abs": "https://arxiv.org/abs/2507.08621", "title": "A comprehensive study of LLM-based argument classification: from LLAMA through GPT-4o to Deepseek-R1", "authors": ["Marcin Pietroń", "Rafał Olszowski", "Jakub Gomułka", "Filip Gampel", "Andrzej Tomski"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Argument mining (AM) is an interdisciplinary research field that integrates\ninsights from logic, philosophy, linguistics, rhetoric, law, psychology, and\ncomputer science. It involves the automatic identification and extraction of\nargumentative components, such as premises and claims, and the detection of\nrelationships between them, such as support, attack, or neutrality. Recently,\nthe field has advanced significantly, especially with the advent of large\nlanguage models (LLMs), which have enhanced the efficiency of analyzing and\nextracting argument semantics compared to traditional methods and other deep\nlearning models. There are many benchmarks for testing and verifying the\nquality of LLM, but there is still a lack of research and results on the\noperation of these models in publicly available argument classification\ndatabases. This paper presents a study of a selection of LLM's, using diverse\ndatasets such as Args.me and UKP. The models tested include versions of GPT,\nLlama, and DeepSeek, along with reasoning-enhanced variants incorporating the\nChain-of-Thoughts algorithm. The results indicate that ChatGPT-4o outperforms\nthe others in the argument classification benchmarks. In case of models\nincorporated with reasoning capabilities, the Deepseek-R1 shows its\nsuperiority. However, despite their superiority, GPT-4o and Deepseek-R1 still\nmake errors. The most common errors are discussed for all models. To our\nknowledge, the presented work is the first broader analysis of the mentioned\ndatasets using LLM and prompt algorithms. The work also shows some weaknesses\nof known prompt algorithms in argument analysis, while indicating directions\nfor their improvement. The added value of the work is the in-depth analysis of\nthe available argument datasets and the demonstration of their shortcomings."}
{"id": "2507.08660", "pdf": "https://arxiv.org/pdf/2507.08660.pdf", "abs": "https://arxiv.org/abs/2507.08660", "title": "The Impact of Automatic Speech Transcription on Speaker Attribution", "authors": ["Cristina Aggazzotti", "Matthew Wiesner", "Elizabeth Allyn Smith", "Nicholas Andrews"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Speaker attribution from speech transcripts is the task of identifying a\nspeaker from the transcript of their speech based on patterns in their language\nuse. This task is especially useful when the audio is unavailable (e.g.\ndeleted) or unreliable (e.g. anonymized speech). Prior work in this area has\nprimarily focused on the feasibility of attributing speakers using transcripts\nproduced by human annotators. However, in real-world settings, one often only\nhas more errorful transcripts produced by automatic speech recognition (ASR)\nsystems. In this paper, we conduct what is, to our knowledge, the first\ncomprehensive study of the impact of automatic transcription on speaker\nattribution performance. In particular, we study the extent to which speaker\nattribution performance degrades in the face of transcription errors, as well\nas how properties of the ASR system impact attribution. We find that\nattribution is surprisingly resilient to word-level transcription errors and\nthat the objective of recovering the true transcript is minimally correlated\nwith attribution performance. Overall, our findings suggest that speaker\nattribution on more errorful transcripts produced by ASR is as good, if not\nbetter, than attribution based on human-transcribed data, possibly because ASR\ntranscription errors can capture speaker-specific features revealing of speaker\nidentity."}
{"id": "2507.08665", "pdf": "https://arxiv.org/pdf/2507.08665.pdf", "abs": "https://arxiv.org/abs/2507.08665", "title": "KELPS: A Framework for Verified Multi-Language Autoformalization via Semantic-Syntactic Alignment", "authors": ["Jiyao Zhang", "Chengli Zhong", "Hui Xu", "Qige Li", "Yi Zhou"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted by the ICML 2025 AI4MATH Workshop. 22 pages, 16 figures, 2\n  tables", "summary": "Modern large language models (LLMs) show promising progress in formalizing\ninformal mathematics into machine-verifiable theorems. However, these methods\nstill face bottlenecks due to the limited quantity and quality of multilingual\nparallel corpora. In this paper, we propose a novel neuro-symbolic framework\nKELPS (Knowledge-Equation based Logical Processing System) to address these\nproblems. KELPS is an iterative framework for translating, synthesizing, and\nfiltering informal data into multiple formal languages (Lean, Coq, and\nIsabelle). First, we translate natural language into Knowledge Equations (KEs),\na novel language that we designed, theoretically grounded in assertional logic.\nNext, we convert them to target languages through rigorously defined rules that\npreserve both syntactic structure and semantic meaning. This process yielded a\nparallel corpus of over 60,000 problems. Our framework achieves 88.9% syntactic\naccuracy (pass@1) on MiniF2F, outperforming SOTA models such as Deepseek-V3\n(81%) and Herald (81.3%) across multiple datasets. All datasets and codes are\navailable in the supplementary materials."}
{"id": "2507.08704", "pdf": "https://arxiv.org/pdf/2507.08704.pdf", "abs": "https://arxiv.org/abs/2507.08704", "title": "KG-Attention: Knowledge Graph-Guided Attention at Test-Time via Bidirectional Information Aggregation", "authors": ["Songlin Zhai", "Guilin Qi", "Yuan Meng"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Knowledge graphs (KGs) play a critical role in enhancing large language\nmodels (LLMs) by introducing structured and grounded knowledge into the\nlearning process. However, most existing KG-enhanced approaches rely on\nparameter-intensive fine-tuning, which risks catastrophic forgetting and\ndegrades the pretrained model's generalization. Moreover, they exhibit limited\nadaptability to real-time knowledge updates due to their static integration\nframeworks. To address these issues, we introduce the first test-time\nKG-augmented framework for LLMs, built around a dedicated knowledge\ngraph-guided attention (KGA) module that enables dynamic knowledge fusion\nwithout any parameter updates. The proposed KGA module augments the standard\nself-attention mechanism with two synergistic pathways: outward and inward\naggregation. Specifically, the outward pathway dynamically integrates external\nknowledge into input representations via input-driven KG fusion. This inward\naggregation complements the outward pathway by refining input representations\nthrough KG-guided filtering, suppressing task-irrelevant signals and amplifying\nknowledge-relevant patterns. Importantly, while the outward pathway handles\nknowledge fusion, the inward path selects the most relevant triples and feeds\nthem back into the fusion process, forming a closed-loop enhancement mechanism.\nBy synergistically combining these two pathways, the proposed method supports\nreal-time knowledge fusion exclusively at test-time, without any parameter\nmodification. Extensive experiments on five benchmarks verify the comparable\nknowledge fusion performance of KGA."}
{"id": "2507.08719", "pdf": "https://arxiv.org/pdf/2507.08719.pdf", "abs": "https://arxiv.org/abs/2507.08719", "title": "Multilingual Multimodal Software Developer for Code Generation", "authors": ["Linzheng Chai", "Jian Yang", "Shukai Liu", "Wei Zhang", "Liran Wang", "Ke Jin", "Tao Sun", "Congnan Liu", "Chenchen Zhang", "Hualei Zhu", "Jiaheng Liu", "Xianjie Wu", "Ge Zhang", "Tianyu Liu", "Zhoujun Li"], "categories": ["cs.CL", "cs.AI", "cs.SE"], "comment": "Preprint", "summary": "The rapid advancement of Large Language Models (LLMs) has significantly\nimproved code generation, yet most models remain text-only, neglecting crucial\nvisual aids like diagrams and flowcharts used in real-world software\ndevelopment. To bridge this gap, we introduce MM-Coder, a Multilingual\nMultimodal software developer. MM-Coder integrates visual design inputs-Unified\nModeling Language (UML) diagrams and flowcharts (termed Visual Workflow)-with\ntextual instructions to enhance code generation accuracy and architectural\nalignment. To enable this, we developed MMc-Instruct, a diverse multimodal\ninstruction-tuning dataset including visual-workflow-based code generation,\nallowing MM-Coder to synthesize textual and graphical information like human\ndevelopers, distinct from prior work on narrow tasks. Furthermore, we introduce\nMMEval, a new benchmark for evaluating multimodal code generation, addressing\nexisting text-only limitations. Our evaluations using MMEval highlight\nsignificant remaining challenges for models in precise visual information\ncapture, instruction following, and advanced programming knowledge. Our work\naims to revolutionize industrial programming by enabling LLMs to interpret and\nimplement complex specifications conveyed through both text and visual designs."}
{"id": "2507.08799", "pdf": "https://arxiv.org/pdf/2507.08799.pdf", "abs": "https://arxiv.org/abs/2507.08799", "title": "KV Cache Steering for Inducing Reasoning in Small Language Models", "authors": ["Max Belitsky", "Dawid J. Kopiczko", "Michael Dorkenwald", "M. Jehanzeb Mirza", "Cees G. M. Snoek", "Yuki M. Asano"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "We propose cache steering, a lightweight method for implicit steering of\nlanguage models via a one-shot intervention applied directly to the key-value\ncache. To validate its effectiveness, we apply cache steering to induce\nchain-of-thought reasoning in small language models. Our approach leverages\nGPT-4o-generated reasoning traces to construct steering vectors that shift\nmodel behavior toward more explicit, multi-step reasoning without fine-tuning\nor prompt modifications. Experimental evaluations on diverse reasoning\nbenchmarks demonstrate that cache steering improves both the qualitative\nstructure of model reasoning and quantitative task performance. Compared to\nprior activation steering techniques that require continuous interventions, our\none-shot cache steering offers substantial advantages in terms of\nhyperparameter stability, inference-time efficiency, and ease of integration,\nmaking it a more robust and practical solution for controlled generation."}
{"id": "2507.08104", "pdf": "https://arxiv.org/pdf/2507.08104.pdf", "abs": "https://arxiv.org/abs/2507.08104", "title": "VideoConviction: A Multimodal Benchmark for Human Conviction and Stock Market Recommendations", "authors": ["Michael Galarnyk", "Veer Kejriwal", "Agam Shah", "Yash Bhardwaj", "Nicholas Meyer", "Anand Krishnan", "Sudheer Chava"], "categories": ["cs.MM", "cs.AI", "cs.CL", "cs.CV"], "comment": null, "summary": "Social media has amplified the reach of financial influencers known as\n\"finfluencers,\" who share stock recommendations on platforms like YouTube.\nUnderstanding their influence requires analyzing multimodal signals like tone,\ndelivery style, and facial expressions, which extend beyond text-based\nfinancial analysis. We introduce VideoConviction, a multimodal dataset with\n6,000+ expert annotations, produced through 457 hours of human effort, to\nbenchmark multimodal large language models (MLLMs) and text-based large\nlanguage models (LLMs) in financial discourse. Our results show that while\nmultimodal inputs improve stock ticker extraction (e.g., extracting Apple's\nticker AAPL), both MLLMs and LLMs struggle to distinguish investment actions\nand conviction--the strength of belief conveyed through confident delivery and\ndetailed reasoning--often misclassifying general commentary as definitive\nrecommendations. While high-conviction recommendations perform better than\nlow-conviction ones, they still underperform the popular S\\&P 500 index fund.\nAn inverse strategy--betting against finfluencer recommendations--outperforms\nthe S\\&P 500 by 6.8\\% in annual returns but carries greater risk (Sharpe ratio\nof 0.41 vs. 0.65). Our benchmark enables a diverse evaluation of multimodal\ntasks, comparing model performance on both full video and segmented video\ninputs. This enables deeper advancements in multimodal financial research. Our\ncode, dataset, and evaluation leaderboard are available under the CC BY-NC 4.0\nlicense."}
{"id": "2507.08128", "pdf": "https://arxiv.org/pdf/2507.08128.pdf", "abs": "https://arxiv.org/abs/2507.08128", "title": "Audio Flamingo 3: Advancing Audio Intelligence with Fully Open Large Audio Language Models", "authors": ["Arushi Goel", "Sreyan Ghosh", "Jaehyeon Kim", "Sonal Kumar", "Zhifeng Kong", "Sang-gil Lee", "Chao-Han Huck Yang", "Ramani Duraiswami", "Dinesh Manocha", "Rafael Valle", "Bryan Catanzaro"], "categories": ["cs.SD", "cs.AI", "cs.CL", "eess.AS"], "comment": "Code, Datasets and Models: https://research.nvidia.com/labs/adlr/AF3/", "summary": "We present Audio Flamingo 3 (AF3), a fully open state-of-the-art (SOTA) large\naudio-language model that advances reasoning and understanding across speech,\nsound, and music. AF3 introduces: (i) AF-Whisper, a unified audio encoder\ntrained using a novel strategy for joint representation learning across all 3\nmodalities of speech, sound, and music; (ii) flexible, on-demand thinking,\nallowing the model to do chain-of-thought-type reasoning before answering;\n(iii) multi-turn, multi-audio chat; (iv) long audio understanding and reasoning\n(including speech) up to 10 minutes; and (v) voice-to-voice interaction. To\nenable these capabilities, we propose several large-scale training datasets\ncurated using novel strategies, including AudioSkills-XL, LongAudio-XL,\nAF-Think, and AF-Chat, and train AF3 with a novel five-stage curriculum-based\ntraining strategy. Trained on only open-source audio data, AF3 achieves new\nSOTA results on over 20+ (long) audio understanding and reasoning benchmarks,\nsurpassing both open-weight and closed-source models trained on much larger\ndatasets."}
{"id": "2507.08191", "pdf": "https://arxiv.org/pdf/2507.08191.pdf", "abs": "https://arxiv.org/abs/2507.08191", "title": "Overview of the TREC 2021 deep learning track", "authors": ["Nick Craswell", "Bhaskar Mitra", "Emine Yilmaz", "Daniel Campos", "Jimmy Lin"], "categories": ["cs.IR", "cs.AI", "cs.CL"], "comment": null, "summary": "This is the third year of the TREC Deep Learning track. As in previous years,\nwe leverage the MS MARCO datasets that made hundreds of thousands of human\nannotated training labels available for both passage and document ranking\ntasks. In addition, this year we refreshed both the document and the passage\ncollections which also led to a nearly four times increase in the document\ncollection size and nearly $16$ times increase in the size of the passage\ncollection. Deep neural ranking models that employ large scale pretraininig\ncontinued to outperform traditional retrieval methods this year. We also found\nthat single stage retrieval can achieve good performance on both tasks although\nthey still do not perform at par with multistage retrieval pipelines. Finally,\nthe increase in the collection size and the general data refresh raised some\nquestions about completeness of NIST judgments and the quality of the training\nlabels that were mapped to the new collections from the old ones which we\ndiscuss in this report."}
{"id": "2507.08284", "pdf": "https://arxiv.org/pdf/2507.08284.pdf", "abs": "https://arxiv.org/abs/2507.08284", "title": "Lightweight Safety Guardrails via Synthetic Data and RL-guided Adversarial Training", "authors": ["Aleksei Ilin", "Gor Matevosyan", "Xueying Ma", "Vladimir Eremin", "Suhaa Dada", "Muqun Li", "Riyaaz Shaik", "Haluk Noyan Tokgozoglu"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "We introduce a lightweight yet highly effective safety guardrail framework\nfor language models, demonstrating that small-scale language models can\nachieve, and even surpass, the performance of larger counterparts in content\nmoderation tasks. This is accomplished through high-fidelity synthetic data\ngeneration and adversarial training. The synthetic data generation process\nbegins with human-curated seed data, which undergoes query augmentation and\nparaphrasing to create diverse and contextually rich examples. This augmented\ndata is then subjected to multiple rounds of curation, ensuring high fidelity\nand relevance. Inspired by recent advances in the Generative Adversarial\nNetwork (GAN) architecture, our adversarial training employs reinforcement\nlearning to guide a generator that produces challenging synthetic examples.\nThese examples are used to fine-tune the safety classifier, enhancing its\nability to detect and mitigate harmful content. Additionally, we incorporate\nstrategies from recent research on efficient LLM training, leveraging the\ncapabilities of smaller models to improve the performance of larger generative\nmodels. With iterative adversarial training and the generation of diverse,\nhigh-quality synthetic data, our framework enables small language models (SLMs)\nto serve as robust safety guardrails. This approach not only reduces\ncomputational overhead but also enhances resilience against adversarial\nattacks, offering a scalable and efficient solution for content moderation in\nAI systems."}
{"id": "2507.08306", "pdf": "https://arxiv.org/pdf/2507.08306.pdf", "abs": "https://arxiv.org/abs/2507.08306", "title": "M2-Reasoning: Empowering MLLMs with Unified General and Spatial Reasoning", "authors": ["Inclusion AI", ":", "Fudong Wang", "Jiajia Liu", "Jingdong Chen", "Jun Zhou", "Kaixiang Ji", "Lixiang Ru", "Qingpei Guo", "Ruobing Zheng", "Tianqi Li", "Yi Yuan", "Yifan Mao", "Yuting Xiao", "Ziping Ma"], "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG"], "comment": "31pages, 14 figures", "summary": "Recent advancements in Multimodal Large Language Models (MLLMs), particularly\nthrough Reinforcement Learning with Verifiable Rewards (RLVR), have\nsignificantly enhanced their reasoning abilities. However, a critical gap\npersists: these models struggle with dynamic spatial interactions, a capability\nessential for real-world applications. To bridge this gap, we introduce\nM2-Reasoning-7B, a model designed to excel in both general and spatial\nreasoning. Our approach integrates two key innovations: (1) a novel data\npipeline that generates 294.2K high-quality data samples (168K for cold-start\nfine-tuning and 126.2K for RLVR), which feature logically coherent reasoning\ntrajectories and have undergone comprehensive assessment; and (2) a dynamic\nmulti-task training strategy with step-wise optimization to mitigate conflicts\nbetween data, and task-specific rewards for delivering tailored incentive\nsignals. This combination of curated data and advanced training allows\nM2-Reasoning-7B to set a new state-of-the-art (SOTA) across 8 benchmarks,\nshowcasing superior performance in both general and spatial reasoning domains."}
{"id": "2507.08432", "pdf": "https://arxiv.org/pdf/2507.08432.pdf", "abs": "https://arxiv.org/abs/2507.08432", "title": "xpSHACL: Explainable SHACL Validation using Retrieval-Augmented Generation and Large Language Models", "authors": ["Gustavo Correa Publio", "José Emilio Labra Gayo"], "categories": ["cs.DB", "cs.CL"], "comment": "Accepted for publication in the 2nd LLM+Graph Workshop, colocated at\n  VLDB'25", "summary": "Shapes Constraint Language (SHACL) is a powerful language for validating RDF\ndata. Given the recent industry attention to Knowledge Graphs (KGs), more users\nneed to validate linked data properly. However, traditional SHACL validation\nengines often provide terse reports in English that are difficult for\nnon-technical users to interpret and act upon. This paper presents xpSHACL, an\nexplainable SHACL validation system that addresses this issue by combining\nrule-based justification trees with retrieval-augmented generation (RAG) and\nlarge language models (LLMs) to produce detailed, multilanguage, human-readable\nexplanations for constraint violations. A key feature of xpSHACL is its usage\nof a Violation KG to cache and reuse explanations, improving efficiency and\nconsistency."}
{"id": "2507.08529", "pdf": "https://arxiv.org/pdf/2507.08529.pdf", "abs": "https://arxiv.org/abs/2507.08529", "title": "A Multi-granularity Concept Sparse Activation and Hierarchical Knowledge Graph Fusion Framework for Rare Disease Diagnosis", "authors": ["Mingda Zhang", "Na Zhao", "Jianglong Qin", "Guoyu Ye", "Ruixiang Tang"], "categories": ["cs.AI", "cs.CL"], "comment": "10 pages,3 figures", "summary": "Despite advances from medical large language models in healthcare,\nrare-disease diagnosis remains hampered by insufficient\nknowledge-representation depth, limited concept understanding, and constrained\nclinical reasoning. We propose a framework that couples multi-granularity\nsparse activation of medical concepts with a hierarchical knowledge graph. Four\ncomplementary matching algorithms, diversity control, and a five-level fallback\nstrategy enable precise concept activation, while a three-layer knowledge graph\n(taxonomy, clinical features, instances) provides structured, up-to-date\ncontext. Experiments on the BioASQ rare-disease QA set show BLEU gains of 0.09,\nROUGE gains of 0.05, and accuracy gains of 0.12, with peak accuracy of 0.89\napproaching the 0.90 clinical threshold. Expert evaluation confirms\nimprovements in information quality, reasoning, and professional expression,\nsuggesting our approach shortens the \"diagnostic odyssey\" for rare-disease\npatients."}
{"id": "2507.08575", "pdf": "https://arxiv.org/pdf/2507.08575.pdf", "abs": "https://arxiv.org/abs/2507.08575", "title": "Large Multi-modal Model Cartographic Map Comprehension for Textual Locality Georeferencing", "authors": ["Kalana Wijegunarathna", "Kristin Stock", "Christopher B. Jones"], "categories": ["cs.AI", "cs.CL", "cs.CV"], "comment": null, "summary": "Millions of biological sample records collected in the last few centuries\narchived in natural history collections are un-georeferenced. Georeferencing\ncomplex locality descriptions associated with these collection samples is a\nhighly labour-intensive task collection agencies struggle with. None of the\nexisting automated methods exploit maps that are an essential tool for\ngeoreferencing complex relations. We present preliminary experiments and\nresults of a novel method that exploits multi-modal capabilities of recent\nLarge Multi-Modal Models (LMM). This method enables the model to visually\ncontextualize spatial relations it reads in the locality description. We use a\ngrid-based approach to adapt these auto-regressive models for this task in a\nzero-shot setting. Our experiments conducted on a small manually annotated\ndataset show impressive results for our approach ($\\sim$1 km Average distance\nerror) compared to uni-modal georeferencing with Large Language Models and\nexisting georeferencing tools. The paper also discusses the findings of the\nexperiments in light of an LMM's ability to comprehend fine-grained maps.\nMotivated by these results, a practical framework is proposed to integrate this\nmethod into a georeferencing workflow."}
{"id": "2507.08637", "pdf": "https://arxiv.org/pdf/2507.08637.pdf", "abs": "https://arxiv.org/abs/2507.08637", "title": "Scaling Attention to Very Long Sequences in Linear Time with Wavelet-Enhanced Random Spectral Attention (WERSA)", "authors": ["Vincenzo Dentamaro"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "10 pages, 1 figure", "summary": "Transformer models are computationally costly on long sequences since regular\nattention has quadratic $O(n^2)$ time complexity. We introduce Wavelet-Enhanced\nRandom Spectral Attention (WERSA), a novel mechanism of linear $O(n)$ time\ncomplexity that is pivotal to enable successful long-sequence processing\nwithout the performance trade-off. WERSA merges content-adaptive random\nspectral features together with multi-resolution Haar wavelets and learnable\nparameters to selectively attend to informative scales of data while preserving\nlinear efficiency.\n  Large-scale comparisons \\textbf{on single GPU} and across various benchmarks\n(vision, NLP, hierarchical reasoning) and various attention mechanisms (like\nMultiheaded Attention, Flash-Attention-2, FNet, Linformer, Performer,\nWaveformer), reveal uniform advantages of WERSA. It achieves best accuracy in\nall tests. On ArXiv classification, WERSA improves accuracy over vanilla\nattention by 1.2\\% (86.2\\% vs 85.0\\%) while cutting training time by 81\\% (296s\nvs 1554s) and FLOPS by 73.4\\% (26.2G vs 98.4G). Significantly, WERSA excels\nwhere vanilla and FlashAttention-2 fail: on ArXiv-128k's extremely lengthy\nsequences, it achieves best accuracy (79.1\\%) and AUC (0.979) among viable\nmethods, operating on data that gives Out-Of-Memory errors to quadratic methods\nwhile being \\textbf{twice as fast} as Waveformer, its next-best competitor.\n  By significantly reducing computational loads without compromising accuracy,\nWERSA makes possible more practical, more affordable, long-context models, in\nparticular on low-resource hardware, for more sustainable and more scalable AI\ndevelopment."}
{"id": "2507.08768", "pdf": "https://arxiv.org/pdf/2507.08768.pdf", "abs": "https://arxiv.org/abs/2507.08768", "title": "On Barriers to Archival Audio Processing", "authors": ["Peter Sullivan", "Muhammad Abdul-Mageed"], "categories": ["cs.SD", "cs.AI", "cs.CL", "eess.AS"], "comment": "Update with Acknowledgements of ICNSLP 2025 paper", "summary": "In this study, we leverage a unique UNESCO collection of mid-20th century\nradio recordings to probe the robustness of modern off-the-shelf language\nidentification (LID) and speaker recognition (SR) methods, especially with\nrespect to the impact of multilingual speakers and cross-age recordings. Our\nfindings suggest that LID systems, such as Whisper, are increasingly adept at\nhandling second-language and accented speech. However, speaker embeddings\nremain a fragile component of speech processing pipelines that is prone to\nbiases related to the channel, age, and language. Issues which will need to be\novercome should archives aim to employ SR methods for speaker indexing."}
{"id": "2507.08771", "pdf": "https://arxiv.org/pdf/2507.08771.pdf", "abs": "https://arxiv.org/abs/2507.08771", "title": "BlockFFN: Towards End-Side Acceleration-Friendly Mixture-of-Experts with Chunk-Level Activation Sparsity", "authors": ["Chenyang Song", "Weilin Zhao", "Xu Han", "Chaojun Xiao", "Yingfa Chen", "Yuxuan Li", "Zhiyuan Liu", "Maosong Sun"], "categories": ["cs.LG", "cs.CL"], "comment": "21 pages, 7 figures, 15 tables", "summary": "To alleviate the computational burden of large language models (LLMs),\narchitectures with activation sparsity, represented by mixture-of-experts\n(MoE), have attracted increasing attention. However, the non-differentiable and\ninflexible routing of vanilla MoE hurts model performance. Moreover, while each\ntoken activates only a few parameters, these sparsely-activated architectures\nexhibit low chunk-level sparsity, indicating that the union of multiple\nconsecutive tokens activates a large ratio of parameters. Such a sparsity\npattern is unfriendly for acceleration under low-resource conditions (e.g.,\nend-side devices) and incompatible with mainstream acceleration techniques\n(e.g., speculative decoding). To address these challenges, we introduce a novel\nMoE architecture, BlockFFN, as well as its efficient training and deployment\ntechniques. Specifically, we use a router integrating ReLU activation and\nRMSNorm for differentiable and flexible routing. Next, to promote both\ntoken-level sparsity (TLS) and chunk-level sparsity (CLS), CLS-aware training\nobjectives are designed, making BlockFFN more acceleration-friendly. Finally,\nwe implement efficient acceleration kernels, combining activation sparsity and\nspeculative decoding for the first time. The experimental results demonstrate\nthe superior performance of BlockFFN over other MoE baselines, achieving over\n80% TLS and 70% 8-token CLS. Our kernels achieve up to 3.67$\\times$ speedup on\nreal end-side devices than dense models. All codes and checkpoints are\navailable publicly (https://github.com/thunlp/BlockFFN)."}
{"id": "2507.08794", "pdf": "https://arxiv.org/pdf/2507.08794.pdf", "abs": "https://arxiv.org/abs/2507.08794", "title": "One Token to Fool LLM-as-a-Judge", "authors": ["Yulai Zhao", "Haolin Liu", "Dian Yu", "S. Y. Kung", "Haitao Mi", "Dong Yu"], "categories": ["cs.LG", "cs.CL"], "comment": null, "summary": "Generative reward models (also known as LLMs-as-judges), which use large\nlanguage models (LLMs) to evaluate answer quality, are increasingly adopted in\nreinforcement learning with verifiable rewards (RLVR). They are often preferred\nover rigid rule-based metrics, especially for complex reasoning tasks involving\nfree-form outputs. In this paradigm, an LLM is typically prompted to compare a\ncandidate answer against a ground-truth reference and assign a binary reward\nindicating correctness. Despite the seeming simplicity of this comparison task,\nwe find that generative reward models exhibit surprising vulnerabilities to\nsuperficial manipulations: non-word symbols (e.g., \":\" or \".\") or reasoning\nopeners like \"Thought process:\" and \"Let's solve this problem step by step.\"\ncan often lead to false positive rewards. We demonstrate that this weakness is\nwidespread across LLMs, datasets, and prompt formats, posing a serious threat\nfor core algorithmic paradigms that rely on generative reward models, such as\nrejection sampling, preference optimization, and RLVR. To mitigate this issue,\nwe introduce a simple yet effective data augmentation strategy and train a new\ngenerative reward model with substantially improved robustness. Our findings\nhighlight the urgent need for more reliable LLM-based evaluation methods. We\nrelease our robust, general-domain reward model and its synthetic training data\nat https://huggingface.co/sarosavo/Master-RM and\nhttps://huggingface.co/datasets/sarosavo/Master-RM."}
{"id": "2507.08800", "pdf": "https://arxiv.org/pdf/2507.08800.pdf", "abs": "https://arxiv.org/abs/2507.08800", "title": "NeuralOS: Towards Simulating Operating Systems via Neural Generative Models", "authors": ["Luke Rivard", "Sun Sun", "Hongyu Guo", "Wenhu Chen", "Yuntian Deng"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.HC", "cs.LG"], "comment": null, "summary": "We introduce NeuralOS, a neural framework that simulates graphical user\ninterfaces (GUIs) of operating systems by directly predicting screen frames in\nresponse to user inputs such as mouse movements, clicks, and keyboard events.\nNeuralOS combines a recurrent neural network (RNN), which tracks computer\nstate, with a diffusion-based neural renderer that generates screen images. The\nmodel is trained on a large-scale dataset of Ubuntu XFCE recordings, which\ninclude both randomly generated interactions and realistic interactions\nproduced by AI agents. Experiments show that NeuralOS successfully renders\nrealistic GUI sequences, accurately captures mouse interactions, and reliably\npredicts state transitions like application launches. Although modeling\nfine-grained keyboard interactions precisely remains challenging, NeuralOS\noffers a step toward creating fully adaptive, generative neural interfaces for\nfuture human-computer interaction systems."}
{"id": "2111.14003", "pdf": "https://arxiv.org/pdf/2111.14003.pdf", "abs": "https://arxiv.org/abs/2111.14003", "title": "Answer Generation for Questions With Multiple Information Sources in E-Commerce", "authors": ["Anand A. Rajasekar", "Nikesh Garera"], "categories": ["cs.CL", "cs.LG", "I.2.7; H.3.3"], "comment": "7 pages, 10 tables, 1 figure", "summary": "Automatic question answering is an important yet challenging task in\nE-commerce given the millions of questions posted by users about the product\nthat they are interested in purchasing. Hence, there is a great demand for\nautomatic answer generation systems that provide quick responses using related\ninformation about the product. There are three sources of knowledge available\nfor answering a user posted query, they are reviews, duplicate or similar\nquestions, and specifications. Effectively utilizing these information sources\nwill greatly aid us in answering complex questions. However, there are two main\nchallenges present in exploiting these sources: (i) The presence of irrelevant\ninformation and (ii) the presence of ambiguity of sentiment present in reviews\nand similar questions. Through this work we propose a novel pipeline (MSQAP)\nthat utilizes the rich information present in the aforementioned sources by\nseparately performing relevancy and ambiguity prediction before generating a\nresponse.\n  Experimental results show that our relevancy prediction model (BERT-QA)\noutperforms all other variants and has an improvement of 12.36% in F1 score\ncompared to the BERT-base baseline. Our generation model (T5-QA) outperforms\nthe baselines in all content preservation metrics such as BLEU, ROUGE and has\nan average improvement of 35.02% in ROUGE and 198.75% in BLEU compared to the\nhighest performing baseline (HSSC-q). Human evaluation of our pipeline shows us\nthat our method has an overall improvement in accuracy of 30.7% over the\ngeneration model (T5-QA), resulting in our full pipeline-based approach (MSQAP)\nproviding more accurate answers. To the best of our knowledge, this is the\nfirst work in the e-commerce domain that automatically generates natural\nlanguage answers combining the information present in diverse sources such as\nspecifications, similar questions, and reviews data."}
{"id": "2301.12463", "pdf": "https://arxiv.org/pdf/2301.12463.pdf", "abs": "https://arxiv.org/abs/2301.12463", "title": "Comparing Spoken Languages using Paninian System of Sounds and Finite State Machines", "authors": ["Shreekanth M Prabhu", "Abhisek Midya"], "categories": ["cs.CL", "cs.FL"], "comment": "63 Pages, 20 Figures, 27 Tables", "summary": "The study of spoken languages comprises phonology, morphology, and grammar.\nThe languages can be classified as root languages, inflectional languages, and\nstem languages. In addition, languages continually change over time and space\nby picking isoglosses, as speakers move from region to/through region. All\nthese factors lead to the formation of vocabulary, which has\ncommonality/similarity across languages as well as distinct and subtle\ndifferences among them. Comparison of vocabularies across languages and\ndetailed analysis has led to the hypothesis of language families. In\nparticular, in the view of Western linguists, Vedic Sanskrit is a daughter\nlanguage, part of the Indo-Iranian branch of the Indo-European Language family,\nand Dravidian Languages belong to an entirely different family. These and such\nconclusions are reexamined in this paper. Based on our study and analysis, we\npropose an Ecosystem Model for Linguistic Development with Sanskrit at the\ncore, in place of the widely accepted family tree model. To that end, we\nleverage the Paninian system of sounds to construct a phonetic map. Then we\nrepresent words across languages as state transitions on the phonetic map and\nconstruct corresponding Morphological Finite Automata (MFA) that accept groups\nof words. Regardless of whether the contribution of this paper is significant\nor minor, it is an important step in challenging policy-driven research that\nhas plagued this field."}
{"id": "2310.18290", "pdf": "https://arxiv.org/pdf/2310.18290.pdf", "abs": "https://arxiv.org/abs/2310.18290", "title": "Riddle Generation using Learning Resources", "authors": ["Niharika Sri Parasa", "Chaitali Diwan", "Srinath Srinivasa"], "categories": ["cs.CL"], "comment": null, "summary": "One of the primary challenges in online learning environments, is to retain\nlearner engagement. Several different instructional strategies are proposed\nboth in online and offline environments to enhance learner engagement. The\nConcept Attainment Model is one such instructional strategy that focuses on\nlearners acquiring a deeper understanding of a concept rather than just its\ndictionary definition. This is done by searching and listing the properties\nused to distinguish examples from non-examples of various concepts. Our work\nattempts to apply the Concept Attainment Model to build conceptual riddles, to\ndeploy over online learning environments. The approach involves creating\nfactual triples from learning resources, classifying them based on their\nuniqueness to a concept into `Topic Markers' and `Common', followed by\ngenerating riddles based on the Concept Attainment Model's format and capturing\nall possible solutions to those riddles. The results obtained from the human\nevaluation of riddles prove encouraging."}
{"id": "2401.02984", "pdf": "https://arxiv.org/pdf/2401.02984.pdf", "abs": "https://arxiv.org/abs/2401.02984", "title": "Large Language Models in Mental Health Care: a Scoping Review", "authors": ["Yining Hua", "Fenglin Liu", "Kailai Yang", "Zehan Li", "Hongbin Na", "Yi-han Sheu", "Peilin Zhou", "Lauren V. Moran", "Sophia Ananiadou", "David A. Clifton", "Andrew Beam", "John Torous"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Objectieve:This review aims to deliver a comprehensive analysis of Large\nLanguage Models (LLMs) utilization in mental health care, evaluating their\neffectiveness, identifying challenges, and exploring their potential for future\napplication. Materials and Methods: A systematic search was performed across\nmultiple databases including PubMed, Web of Science, Google Scholar, arXiv,\nmedRxiv, and PsyArXiv in November 2023. The review includes all types of\noriginal research, regardless of peer-review status, published or disseminated\nbetween October 1, 2019, and December 2, 2023. Studies were included without\nlanguage restrictions if they employed LLMs developed after T5 and directly\ninvestigated research questions within mental health care settings. Results:\nOut of an initial 313 articles, 34 were selected based on their relevance to\nLLMs applications in mental health care and the rigor of their reported\noutcomes. The review identified various LLMs applications in mental health\ncare, including diagnostics, therapy, and enhancing patient engagement. Key\nchallenges highlighted were related to data availability and reliability, the\nnuanced handling of mental states, and effective evaluation methods. While LLMs\nshowed promise in improving accuracy and accessibility, significant gaps in\nclinical applicability and ethical considerations were noted. Conclusion: LLMs\nhold substantial promise for enhancing mental health care. For their full\npotential to be realized, emphasis must be placed on developing robust\ndatasets, development and evaluation frameworks, ethical guidelines, and\ninterdisciplinary collaborations to address current limitations."}
{"id": "2401.17256", "pdf": "https://arxiv.org/pdf/2401.17256.pdf", "abs": "https://arxiv.org/abs/2401.17256", "title": "Weak-to-Strong Jailbreaking on Large Language Models", "authors": ["Xuandong Zhao", "Xianjun Yang", "Tianyu Pang", "Chao Du", "Lei Li", "Yu-Xiang Wang", "William Yang Wang"], "categories": ["cs.CL"], "comment": "ICML 2025", "summary": "Large language models (LLMs) are vulnerable to jailbreak attacks - resulting\nin harmful, unethical, or biased text generations. However, existing\njailbreaking methods are computationally costly. In this paper, we propose the\nweak-to-strong jailbreaking attack, an efficient inference time attack for\naligned LLMs to produce harmful text. Our key intuition is based on the\nobservation that jailbroken and aligned models only differ in their initial\ndecoding distributions. The weak-to-strong attack's key technical insight is\nusing two smaller models (a safe and an unsafe one) to adversarially modify a\nsignificantly larger safe model's decoding probabilities. We evaluate the\nweak-to-strong attack on 5 diverse open-source LLMs from 3 organizations. The\nresults show our method can increase the misalignment rate to over 99% on two\ndatasets with just one forward pass per example. Our study exposes an urgent\nsafety issue that needs to be addressed when aligning LLMs. As an initial\nattempt, we propose a defense strategy to protect against such attacks, but\ncreating more advanced defenses remains challenging. The code for replicating\nthe method is available at https://github.com/XuandongZhao/weak-to-strong"}
{"id": "2404.14192", "pdf": "https://arxiv.org/pdf/2404.14192.pdf", "abs": "https://arxiv.org/abs/2404.14192", "title": "Swap distance minimization beyond entropy minimization in word order variation", "authors": ["Víctor Franco-Sánchez", "Arnau Martí-Llobet", "Ramon Ferrer-i-Cancho"], "categories": ["cs.CL", "physics.soc-ph"], "comment": "Reorganization with technical appendices; minor corrections; in press\n  in the Journal of Quantitative Linguistics", "summary": "Consider a linguistic structure formed by $n$ elements, for instance,\nsubject, direct object and verb ($n=3$) or subject, direct object, indirect\nobject and verb ($n=4$). We investigate whether the frequency of the $n!$\npossible orders is constrained by two principles. First, entropy minimization,\na principle that has been suggested to shape natural communication systems at\ndistinct levels of organization. Second, swap distance minimization, namely a\npreference for word orders that require fewer swaps of adjacent elements to be\nproduced from a source order. We present average swap distance, a novel score\nfor research on swap distance minimization. We find strong evidence of pressure\nfor entropy minimization and swap distance minimization with respect to a die\nrolling experiment in distinct linguistic structures with $n=3$ or $n=4$.\nEvidence with respect to a Polya urn process is strong for $n=4$ but weaker for\n$n=3$. We still find evidence consistent with the action of swap distance\nminimization when word order frequencies are shuffled, indicating that swap\ndistance minimization effects are beyond pressure to reduce word order entropy."}
{"id": "2404.18865", "pdf": "https://arxiv.org/pdf/2404.18865.pdf", "abs": "https://arxiv.org/abs/2404.18865", "title": "Truth-value judgment in language models: 'truth directions' are context sensitive", "authors": ["Stefan F. Schouten", "Peter Bloem", "Ilia Markov", "Piek Vossen"], "categories": ["cs.CL"], "comment": "COLM 2025", "summary": "Recent work has demonstrated that the latent spaces of large language models\n(LLMs) contain directions predictive of the truth of sentences. Multiple\nmethods recover such directions and build probes that are described as\nuncovering a model's \"knowledge\" or \"beliefs\". We investigate this phenomenon,\nlooking closely at the impact of context on the probes. Our experiments\nestablish where in the LLM the probe's predictions are (most) sensitive to the\npresence of related sentences, and how to best characterize this kind of\nsensitivity. We do so by measuring different types of consistency errors that\noccur after probing an LLM whose inputs consist of hypotheses preceded by\n(negated) supporting and contradicting sentences. We also perform a causal\nintervention experiment, investigating whether moving the representation of a\npremise along these truth-value directions influences the position of an\nentailed or contradicted sentence along that same direction. We find that the\nprobes we test are generally context sensitive, but that contexts which should\nnot affect the truth often still impact the probe outputs. Our experiments show\nthat the type of errors depend on the layer, the model, and the kind of data.\nFinally, our results suggest that truth-value directions are causal mediators\nin the inference process that incorporates in-context information."}
{"id": "2405.19715", "pdf": "https://arxiv.org/pdf/2405.19715.pdf", "abs": "https://arxiv.org/abs/2405.19715", "title": "SpecDec++: Boosting Speculative Decoding via Adaptive Candidate Lengths", "authors": ["Kaixuan Huang", "Xudong Guo", "Mengdi Wang"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Accepted to COLM 2025", "summary": "Speculative decoding reduces the inference latency of a target large language\nmodel via utilizing a smaller and faster draft model. Its performance depends\non a hyperparameter K -- the candidate length, i.e., the number of candidate\ntokens for the target model to verify in each round. However, previous methods\noften use simple heuristics to choose K, which may result in sub-optimal\nperformance. We study the choice of the candidate length K and formulate it as\na Markov Decision Process. We theoretically show that the optimal policy of\nthis Markov decision process takes the form of a threshold policy, i.e., the\ncurrent speculation should stop and be verified when the probability of getting\na rejection exceeds a threshold value. Motivated by this theory, we propose\nSpecDec++, an enhanced version of speculative decoding that adaptively\ndetermines the candidate length on the fly. We augment the draft model with a\ntrained acceptance prediction head to predict the conditional acceptance\nprobability of the candidate tokens. SpecDec++ will stop the current\nspeculation when the predicted probability that at least one token gets\nrejected exceeds a threshold. We implement SpecDec++ and apply it to the\nllama-2-chat 7B & 70B model pair. Our adaptive method achieves a 2.04x speedup\non the Alpaca dataset (7.2% improvement over the baseline speculative\ndecoding). On the GSM8K and HumanEval datasets, our method achieves a 2.26x\nspeedup (9.4% improvement) and 2.23x speedup (11.1% improvement), respectively.\nThe code of this paper is available at\nhttps://github.com/Kaffaljidhmah2/SpecDec_pp."}
{"id": "2406.03897", "pdf": "https://arxiv.org/pdf/2406.03897.pdf", "abs": "https://arxiv.org/abs/2406.03897", "title": "HeSum: a Novel Dataset for Abstractive Text Summarization in Hebrew", "authors": ["Tzuf Paz-Argaman", "Itai Mondshine", "Asaf Achi Mordechai", "Reut Tsarfaty"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "While large language models (LLMs) excel in various natural language tasks in\nEnglish, their performance in lower-resourced languages like Hebrew, especially\nfor generative tasks such as abstractive summarization, remains unclear. The\nhigh morphological richness in Hebrew adds further challenges due to the\nambiguity in sentence comprehension and the complexities in meaning\nconstruction. In this paper, we address this resource and evaluation gap by\nintroducing HeSum, a novel benchmark specifically designed for abstractive text\nsummarization in Modern Hebrew. HeSum consists of 10,000 article-summary pairs\nsourced from Hebrew news websites written by professionals. Linguistic analysis\nconfirms HeSum's high abstractness and unique morphological challenges. We show\nthat HeSum presents distinct difficulties for contemporary state-of-the-art\nLLMs, establishing it as a valuable testbed for generative language technology\nin Hebrew, and MRLs generative challenges in general."}
{"id": "2406.14023", "pdf": "https://arxiv.org/pdf/2406.14023.pdf", "abs": "https://arxiv.org/abs/2406.14023", "title": "Evaluating Implicit Bias in Large Language Models by Attacking From a Psychometric Perspective", "authors": ["Yuchen Wen", "Keping Bi", "Wei Chen", "Jiafeng Guo", "Xueqi Cheng"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted to ACL 2025 Findings", "summary": "As large language models (LLMs) become an important way of information\naccess, there have been increasing concerns that LLMs may intensify the spread\nof unethical content, including implicit bias that hurts certain populations\nwithout explicit harmful words. In this paper, we conduct a rigorous evaluation\nof LLMs' implicit bias towards certain demographics by attacking them from a\npsychometric perspective to elicit agreements to biased viewpoints. Inspired by\npsychometric principles in cognitive and social psychology, we propose three\nattack approaches, i.e., Disguise, Deception, and Teaching. Incorporating the\ncorresponding attack instructions, we built two benchmarks: (1) a bilingual\ndataset with biased statements covering four bias types (2.7K instances) for\nextensive comparative analysis, and (2) BUMBLE, a larger benchmark spanning\nnine common bias types (12.7K instances) for comprehensive evaluation.\nExtensive evaluation of popular commercial and open-source LLMs shows that our\nmethods can elicit LLMs' inner bias more effectively than competitive\nbaselines. Our attack methodology and benchmarks offer an effective means of\nassessing the ethical risks of LLMs, driving progress toward greater\naccountability in their development. Our code, data, and benchmarks are\navailable at https://yuchenwen1.github.io/ImplicitBiasEvaluation/."}
{"id": "2407.10657", "pdf": "https://arxiv.org/pdf/2407.10657.pdf", "abs": "https://arxiv.org/abs/2407.10657", "title": "An Empirical Study of Validating Synthetic Data for Formula Generation", "authors": ["Usneek Singh", "José Cambronero", "Sumit Gulwani", "Aditya Kanade", "Anirudh Khatry", "Vu Le", "Mukul Singh", "Gust Verbruggen"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted at Findings of NAACL", "summary": "Large language models (LLMs) can be leveraged to help with writing formulas\nin spreadsheets, but resources on these formulas are scarce, impacting both the\nbase performance of pre-trained models and limiting the ability to fine-tune\nthem. Given a corpus of formulas, we can use a(nother) model to generate\nsynthetic natural language utterances for fine-tuning. However, it is important\nto validate whether the NL generated by the LLM is indeed accurate to be\nbeneficial for fine-tuning. In this paper, we provide empirical results on the\nimpact of validating these synthetic training examples with surrogate\nobjectives that evaluate the accuracy of the synthetic annotations. We\ndemonstrate that validation improves performance over raw data across four\nmodels (2 open and 2 closed weight). Interestingly, we show that although\nvalidation tends to prune more challenging examples, it increases the\ncomplexity of problems that models can solve after being fine-tuned on\nvalidated data."}
{"id": "2410.05401", "pdf": "https://arxiv.org/pdf/2410.05401.pdf", "abs": "https://arxiv.org/abs/2410.05401", "title": "Post-hoc Study of Climate Microtargeting on Social Media Ads with LLMs: Thematic Insights and Fairness Evaluation", "authors": ["Tunazzina Islam", "Dan Goldwasser"], "categories": ["cs.CL", "cs.AI", "cs.CY", "cs.SI"], "comment": null, "summary": "Climate change communication on social media increasingly employs\nmicrotargeting strategies to effectively reach and influence specific\ndemographic groups. This study presents a post-hoc analysis of microtargeting\npractices within climate campaigns by leveraging large language models (LLMs)\nto examine Facebook advertisements. Our analysis focuses on two key aspects:\ndemographic targeting and fairness. We evaluate the ability of LLMs to\naccurately predict the intended demographic targets, such as gender and age\ngroup, achieving an overall accuracy of 88.55%. Furthermore, we instruct the\nLLMs to generate explanations for their classifications, providing transparent\nreasoning behind each decision. These explanations reveal the specific thematic\nelements used to engage different demographic segments, highlighting distinct\nstrategies tailored to various audiences. Our findings show that young adults\nare primarily targeted through messages emphasizing activism and environmental\nconsciousness, while women are engaged through themes related to caregiving\nroles and social advocacy. In addition to evaluating the effectiveness of LLMs\nin detecting microtargeted messaging, we conduct a comprehensive fairness\nanalysis to identify potential biases in model predictions. Our findings\nindicate that while LLMs perform well overall, certain biases exist,\nparticularly in the classification of senior citizens and male audiences. By\nshowcasing the efficacy of LLMs in dissecting and explaining targeted\ncommunication strategies and by highlighting fairness concerns, this study\nprovides a valuable framework for future research aimed at enhancing\ntransparency, accountability, and inclusivity in social media-driven climate\ncampaigns."}
{"id": "2411.01077", "pdf": "https://arxiv.org/pdf/2411.01077.pdf", "abs": "https://arxiv.org/abs/2411.01077", "title": "Emoji Attack: Enhancing Jailbreak Attacks Against Judge LLM Detection", "authors": ["Zhipeng Wei", "Yuqi Liu", "N. Benjamin Erichson"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Jailbreaking techniques trick Large Language Models (LLMs) into producing\nrestricted output, posing a potential threat. One line of defense is to use\nanother LLM as a Judge to evaluate the harmfulness of generated text. However,\nwe reveal that these Judge LLMs are vulnerable to token segmentation bias, an\nissue that arises when delimiters alter the tokenization process, splitting\nwords into smaller sub-tokens. This alters the embeddings of the entire\nsequence, reducing detection accuracy and allowing harmful content to be\nmisclassified as safe. In this paper, we introduce Emoji Attack, a novel\nstrategy that amplifies existing jailbreak prompts by exploiting token\nsegmentation bias. Our method leverages in-context learning to systematically\ninsert emojis into text before it is evaluated by a Judge LLM, inducing\nembedding distortions that significantly lower the likelihood of detecting\nunsafe content. Unlike traditional delimiters, emojis also introduce semantic\nambiguity, making them particularly effective in this attack. Through\nexperiments on state-of-the-art Judge LLMs, we demonstrate that Emoji Attack\nsubstantially reduces the unsafe prediction rate, bypassing existing\nsafeguards."}
{"id": "2503.08893", "pdf": "https://arxiv.org/pdf/2503.08893.pdf", "abs": "https://arxiv.org/abs/2503.08893", "title": "EvalTree: Profiling Language Model Weaknesses via Hierarchical Capability Trees", "authors": ["Zhiyuan Zeng", "Yizhong Wang", "Hannaneh Hajishirzi", "Pang Wei Koh"], "categories": ["cs.CL", "cs.LG"], "comment": "COLM 2025", "summary": "An ideal model evaluation should achieve two goals: identifying where the\nmodel fails and providing actionable improvement guidance. Toward these goals\nfor language model (LM) evaluations, we formulate the problem of generating a\nweakness profile, a set of weaknesses expressed in natural language, given an\nLM's performance on every individual instance in a benchmark. We introduce a\nsuite of quantitative assessments to compare different weakness profiling\nmethods. We also introduce a weakness profiling method EvalTree. EvalTree\nconstructs a capability tree where each node represents a capability described\nin natural language and is linked to a subset of benchmark instances that\nspecifically evaluate this capability; it then extracts nodes where the LM\nperforms poorly to generate a weakness profile. On the MATH and WildChat\nbenchmarks, we show that EvalTree outperforms baseline weakness profiling\nmethods by identifying weaknesses more precisely and comprehensively. Weakness\nprofiling further enables weakness-guided data collection, and training data\ncollection guided by EvalTree-identified weaknesses improves LM performance\nmore than other data collection strategies. We also show how EvalTree exposes\nflaws in Chatbot Arena's human-voter-based evaluation practice. To facilitate\nfuture work, we provide an interface that allows practitioners to interactively\nexplore the capability trees built by EvalTree."}
{"id": "2503.11924", "pdf": "https://arxiv.org/pdf/2503.11924.pdf", "abs": "https://arxiv.org/abs/2503.11924", "title": "REGEN: A Dataset and Benchmarks with Natural Language Critiques and Narratives", "authors": ["Kun Su", "Krishna Sayana", "Hubert Pham", "James Pine", "Yuri Vasilevski", "Raghavendra Vasudeva", "Marialena Kyriakidi", "Liam Hebert", "Ambarish Jash", "Anushya Subbiah", "Sukhdeep Sodhi"], "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG"], "comment": null, "summary": "This paper introduces a novel dataset REGEN (Reviews Enhanced with GEnerative\nNarratives), designed to benchmark the conversational capabilities of\nrecommender Large Language Models (LLMs), addressing the limitations of\nexisting datasets that primarily focus on sequential item prediction. REGEN\nextends the Amazon Product Reviews dataset by inpainting two key natural\nlanguage features: (1) user critiques, representing user \"steering\" queries\nthat lead to the selection of a subsequent item, and (2) narratives, rich\ntextual outputs associated with each recommended item taking into account prior\ncontext. The narratives include product endorsements, purchase explanations,\nand summaries of user preferences.\n  Further, we establish an end-to-end modeling benchmark for the task of\nconversational recommendation, where models are trained to generate both\nrecommendations and corresponding narratives conditioned on user history (items\nand critiques). For this joint task, we introduce a modeling framework LUMEN\n(LLM-based Unified Multi-task Model with Critiques, Recommendations, and\nNarratives) which uses an LLM as a backbone for critiquing, retrieval and\ngeneration. We also evaluate the dataset's quality using standard auto-rating\ntechniques and benchmark it by training both traditional and LLM-based\nrecommender models. Our results demonstrate that incorporating critiques\nenhances recommendation quality by enabling the recommender to learn language\nunderstanding and integrate it with recommendation signals. Furthermore, LLMs\ntrained on our dataset effectively generate both recommendations and contextual\nnarratives, achieving performance comparable to state-of-the-art recommenders\nand language models."}
{"id": "2503.13857", "pdf": "https://arxiv.org/pdf/2503.13857.pdf", "abs": "https://arxiv.org/abs/2503.13857", "title": "Enabling Inclusive Systematic Reviews: Incorporating Preprint Articles with Large Language Model-Driven Evaluations", "authors": ["Rui Yang", "Jiayi Tong", "Haoyuan Wang", "Hui Huang", "Ziyang Hu", "Peiyu Li", "Nan Liu", "Christopher J. Lindsell", "Michael J. Pencina", "Yong Chen", "Chuan Hong"], "categories": ["cs.CL"], "comment": "30 pages, 6 figures", "summary": "Background. Systematic reviews in comparative effectiveness research require\ntimely evidence synthesis. Preprints accelerate knowledge dissemination but\nvary in quality, posing challenges for systematic reviews.\n  Methods. We propose AutoConfidence (automated confidence assessment), an\nadvanced framework for predicting preprint publication, which reduces reliance\non manual curation and expands the range of predictors, including three key\nadvancements: (1) automated data extraction using natural language processing\ntechniques, (2) semantic embeddings of titles and abstracts, and (3) large\nlanguage model (LLM)-driven evaluation scores. Additionally, we employed two\nprediction models: a random forest classifier for binary outcome and a survival\ncure model that predicts both binary outcome and publication risk over time.\n  Results. The random forest classifier achieved AUROC 0.692 with LLM-driven\nscores, improving to 0.733 with semantic embeddings and 0.747 with article\nusage metrics. The survival cure model reached AUROC 0.716 with LLM-driven\nscores, improving to 0.731 with semantic embeddings. For publication risk\nprediction, it achieved a concordance index of 0.658, increasing to 0.667 with\nsemantic embeddings.\n  Conclusion. Our study advances the framework for preprint publication\nprediction through automated data extraction and multiple feature integration.\nBy combining semantic embeddings with LLM-driven evaluations, AutoConfidence\nenhances predictive performance while reducing manual annotation burden. The\nframework has the potential to facilitate incorporation of preprint articles\nduring the appraisal phase of systematic reviews, supporting researchers in\nmore effective utilization of preprint resources."}
{"id": "2504.00927", "pdf": "https://arxiv.org/pdf/2504.00927.pdf", "abs": "https://arxiv.org/abs/2504.00927", "title": "Multi-Token Attention", "authors": ["Olga Golovneva", "Tianlu Wang", "Jason Weston", "Sainbayar Sukhbaatar"], "categories": ["cs.CL"], "comment": null, "summary": "Soft attention is a critical mechanism powering LLMs to locate relevant parts\nwithin a given context. However, individual attention weights are determined by\nthe similarity of only a single query and key token vector. This \"single token\nattention\" bottlenecks the amount of information used in distinguishing a\nrelevant part from the rest of the context. To address this issue, we propose a\nnew attention method, Multi-Token Attention (MTA), which allows LLMs to\ncondition their attention weights on multiple query and key vectors\nsimultaneously. This is achieved by applying convolution operations over\nqueries, keys and heads, allowing nearby queries and keys to affect each\nother's attention weights for more precise attention. As a result, our method\ncan locate relevant context using richer, more nuanced information that can\nexceed a single vector's capacity. Through extensive evaluations, we\ndemonstrate that MTA achieves enhanced performance on a range of popular\nbenchmarks. Notably, it outperforms Transformer baseline models on standard\nlanguage modeling tasks, and on tasks that require searching for information\nwithin long contexts, where our method's ability to leverage richer information\nproves particularly beneficial."}
{"id": "2504.18246", "pdf": "https://arxiv.org/pdf/2504.18246.pdf", "abs": "https://arxiv.org/abs/2504.18246", "title": "One-Pass to Reason: Token Duplication and Block-Sparse Mask for Efficient Fine-Tuning on Multi-Turn Reasoning", "authors": ["Ritesh Goru", "Shanay Mehta", "Prateek Jain"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "9 pages, 3 figures", "summary": "Fine-tuning Large Language Models (LLMs) on multi-turn reasoning datasets\nrequires N (number of turns) separate forward passes per conversation due to\nreasoning token visibility constraints, as reasoning tokens for a turn are\ndiscarded in subsequent turns. We propose duplicating response tokens along\nwith a custom attention mask to enable single-pass processing of entire\nconversations. We prove our method produces identical losses to the N-pass\napproach while reducing time complexity from $O\\bigl(N^{3}\\bigl)$ to\n$O\\bigl(N^{2}\\bigl)$ and maintaining the same memory complexity for a\ntransformer based model. Our approach achieves significant training speedup\nwhile preserving accuracy. Our implementation is available online\n(https://github.com/devrev/One-Pass-to-Reason)."}
{"id": "2505.00467", "pdf": "https://arxiv.org/pdf/2505.00467.pdf", "abs": "https://arxiv.org/abs/2505.00467", "title": "Red Teaming Large Language Models for Healthcare", "authors": ["Vahid Balazadeh", "Michael Cooper", "David Pellow", "Atousa Assadi", "Jennifer Bell", "Mark Coatsworth", "Kaivalya Deshpande", "Jim Fackler", "Gabriel Funingana", "Spencer Gable-Cook", "Anirudh Gangadhar", "Abhishek Jaiswal", "Sumanth Kaja", "Christopher Khoury", "Amrit Krishnan", "Randy Lin", "Kaden McKeen", "Sara Naimimohasses", "Khashayar Namdar", "Aviraj Newatia", "Allan Pang", "Anshul Pattoo", "Sameer Peesapati", "Diana Prepelita", "Bogdana Rakova", "Saba Sadatamin", "Rafael Schulman", "Ajay Shah", "Syed Azhar Shah", "Syed Ahmar Shah", "Babak Taati", "Balagopal Unnikrishnan", "Iñigo Urteaga", "Stephanie Williams", "Rahul G Krishnan"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "We present the design process and findings of the pre-conference workshop at\nthe Machine Learning for Healthcare Conference (2024) entitled Red Teaming\nLarge Language Models for Healthcare, which took place on August 15, 2024.\nConference participants, comprising a mix of computational and clinical\nexpertise, attempted to discover vulnerabilities -- realistic clinical prompts\nfor which a large language model (LLM) outputs a response that could cause\nclinical harm. Red-teaming with clinicians enables the identification of LLM\nvulnerabilities that may not be recognised by LLM developers lacking clinical\nexpertise. We report the vulnerabilities found, categorise them, and present\nthe results of a replication study assessing the vulnerabilities across all\nLLMs provided."}
{"id": "2505.12546", "pdf": "https://arxiv.org/pdf/2505.12546.pdf", "abs": "https://arxiv.org/abs/2505.12546", "title": "Extracting memorized pieces of (copyrighted) books from open-weight language models", "authors": ["A. Feder Cooper", "Aaron Gokaslan", "Ahmed Ahmed", "Amy B. Cyphert", "Christopher De Sa", "Mark A. Lemley", "Daniel E. Ho", "Percy Liang"], "categories": ["cs.CL", "cs.CY", "cs.LG"], "comment": null, "summary": "Plaintiffs and defendants in copyright lawsuits over generative AI often make\nsweeping, opposing claims about the extent to which large language models\n(LLMs) have memorized plaintiffs' protected expression. Drawing on adversarial\nML and copyright law, we show that these polarized positions dramatically\noversimplify the relationship between memorization and copyright. To do so, we\nleverage a recent probabilistic extraction technique to extract pieces of the\nBooks3 dataset from 17 open-weight LLMs. Through numerous experiments, we show\nthat it's possible to extract substantial parts of at least some books from\ndifferent LLMs. This is evidence that these LLMs have memorized the extracted\ntext; this memorized content is copied inside the model parameters. But the\nresults are complicated: the extent of memorization varies both by model and by\nbook. With our specific experiments, we find that the largest LLMs don't\nmemorize most books--either in whole or in part. However, we also find that\nLlama 3.1 70B memorizes some books, like Harry Potter and the Sorcerer's Stone\nand 1984, almost entirely. In fact, Harry Potter is so memorized that, using a\nseed prompt consisting of just the first line of chapter 1, we can\ndeterministically generate the entire book near-verbatim. We discuss why our\nresults have significant implications for copyright cases, though not ones that\nunambiguously favor either side."}
{"id": "2506.11903", "pdf": "https://arxiv.org/pdf/2506.11903.pdf", "abs": "https://arxiv.org/abs/2506.11903", "title": "GeistBERT: Breathing Life into German NLP", "authors": ["Raphael Scheible-Schmitt", "Johann Frei"], "categories": ["cs.CL"], "comment": null, "summary": "Advances in transformer-based language models have highlighted the benefits\nof language-specific pre-training on high-quality corpora. In this context,\nGerman NLP stands to gain from updated architectures and modern datasets\ntailored to the linguistic characteristics of the German language. GeistBERT\nseeks to improve German language processing by incrementally training on a\ndiverse corpus and optimizing model performance across various NLP tasks. We\npre-trained GeistBERT using fairseq, following the RoBERTa base configuration\nwith Whole Word Masking (WWM), and initialized from GottBERT weights. The model\nwas trained on a 1.3 TB German corpus with dynamic masking and a fixed sequence\nlength of 512 tokens. For evaluation, we fine-tuned the model on standard\ndownstream tasks, including NER (CoNLL 2003, GermEval 2014), text\nclassification (GermEval 2018 coarse/fine, 10kGNAD), and NLI (German XNLI),\nusing $F_1$ score and accuracy as evaluation metrics. GeistBERT achieved strong\nresults across all tasks, leading among base models and setting a new\nstate-of-the-art (SOTA) in GermEval 2018 fine text classification. It also\noutperformed several larger models, particularly in classification benchmarks.\nTo support research in German NLP, we release GeistBERT under the MIT license."}
{"id": "2506.14123", "pdf": "https://arxiv.org/pdf/2506.14123.pdf", "abs": "https://arxiv.org/abs/2506.14123", "title": "Sampling from Your Language Model One Byte at a Time", "authors": ["Jonathan Hayase", "Alisa Liu", "Noah A. Smith", "Sewoong Oh"], "categories": ["cs.CL", "cs.FL", "cs.LG"], "comment": "23 pages, 8 figures", "summary": "Tokenization is used almost universally by modern language models, enabling\nefficient text representation using multi-byte or multi-character tokens.\nHowever, prior work has shown that tokenization can introduce distortion into\nthe model's generations, an issue known as the Prompt Boundary Problem (PBP).\nFor example, users are often advised not to end their prompts with a space\nbecause it prevents the model from including the space as part of the next\ntoken. While this heuristic is effective in English, the underlying PBP\ncontinues to affect languages such as Chinese as well as code generation, where\ntokens often do not line up with word and syntactic boundaries. In this work,\nwe present an inference-time method to convert any autoregressive LM with a BPE\ntokenizer into a character-level or byte-level LM. Our method efficiently\nsolves the PBP and is also able to unify the vocabularies of language models\nwith different tokenizers, allowing one to ensemble LMs with different\ntokenizers at inference time or transfer the post-training from one model to\nanother using proxy-tuning. We demonstrate in experiments that the ensemble and\nproxy-tuned models outperform their constituents on downstream evals. Code is\navailable at https://github.com/SewoongLab/byte-sampler ."}
{"id": "2507.05788", "pdf": "https://arxiv.org/pdf/2507.05788.pdf", "abs": "https://arxiv.org/abs/2507.05788", "title": "Flippi: End To End GenAI Assistant for E-Commerce", "authors": ["Anand A. Rajasekar", "Praveen Tangarajan", "Anjali Nainani", "Amogh Batwal", "Vinay Rao Dandin", "Anusua Trivedi", "Ozan Ersoy"], "categories": ["cs.CL", "I.2.7; H.3.3"], "comment": "10 pages, 2 figures, 7 tables", "summary": "The emergence of conversational assistants has fundamentally reshaped user\ninteractions with digital platforms. This paper introduces Flippi-a\ncutting-edge, end-to-end conversational assistant powered by large language\nmodels (LLMs) and tailored for the e-commerce sector. Flippi addresses the\nchallenges posed by the vast and often overwhelming product landscape, enabling\ncustomers to discover products more efficiently through natural language\ndialogue. By accommodating both objective and subjective user requirements,\nFlippi delivers a personalized shopping experience that surpasses traditional\nsearch methods. This paper details how Flippi interprets customer queries to\nprovide precise product information, leveraging advanced NLP techniques such as\nQuery Reformulation, Intent Detection, Retrieval-Augmented Generation (RAG),\nNamed Entity Recognition (NER), and Context Reduction. Flippi's unique\ncapability to identify and present the most attractive offers on an e-commerce\nsite is also explored, demonstrating how it empowers users to make\ncost-effective decisions. Additionally, the paper discusses Flippi's\ncomparative analysis features, which help users make informed choices by\ncontrasting product features, prices, and other relevant attributes. The\nsystem's robust architecture is outlined, emphasizing its adaptability for\nintegration across various e-commerce platforms and the technological choices\nunderpinning its performance and accuracy. Finally, a comprehensive evaluation\nframework is presented, covering performance metrics, user satisfaction, and\nthe impact on customer engagement and conversion rates. By bridging the\nconvenience of online shopping with the personalized assistance traditionally\nfound in physical stores, Flippi sets a new standard for customer satisfaction\nand engagement in the digital marketplace."}
{"id": "2507.06261", "pdf": "https://arxiv.org/pdf/2507.06261.pdf", "abs": "https://arxiv.org/abs/2507.06261", "title": "Gemini 2.5: Pushing the Frontier with Advanced Reasoning, Multimodality, Long Context, and Next Generation Agentic Capabilities", "authors": ["Gheorghe Comanici", "Eric Bieber", "Mike Schaekermann", "Ice Pasupat", "Noveen Sachdeva", "Inderjit Dhillon", "Marcel Blistein", "Ori Ram", "Dan Zhang", "Evan Rosen", "Luke Marris", "Sam Petulla", "Colin Gaffney", "Asaf Aharoni", "Nathan Lintz", "Tiago Cardal Pais", "Henrik Jacobsson", "Idan Szpektor", "Nan-Jiang Jiang", "Krishna Haridasan", "Ahmed Omran", "Nikunj Saunshi", "Dara Bahri", "Gaurav Mishra", "Eric Chu", "Toby Boyd", "Brad Hekman", "Aaron Parisi", "Chaoyi Zhang", "Kornraphop Kawintiranon", "Tania Bedrax-Weiss", "Oliver Wang", "Ya Xu", "Ollie Purkiss", "Uri Mendlovic", "Ilaï Deutel", "Nam Nguyen", "Adam Langley", "Flip Korn", "Lucia Rossazza", "Alexandre Ramé", "Sagar Waghmare", "Helen Miller", "Vaishakh Keshava", "Ying Jian", "Xiaofan Zhang", "Raluca Ada Popa", "Kedar Dhamdhere", "Blaž Bratanič", "Kyuyeun Kim", "Terry Koo", "Ferran Alet", "Yi-ting Chen", "Arsha Nagrani", "Hannah Muckenhirn", "Zhiyuan Zhang", "Corbin Quick", "Filip Pavetić", "Duc Dung Nguyen", "Joao Carreira", "Michael Elabd", "Haroon Qureshi", "Fabian Mentzer", "Yao-Yuan Yang", "Danielle Eisenbud", "Anmol Gulati", "Ellie Talius", "Eric Ni", "Sahra Ghalebikesabi", "Edouard Yvinec", "Alaa Saade", "Thatcher Ulrich", "Lorenzo Blanco", "Dan A. Calian", "Muhuan Huang", "Aäron van den Oord", "Naman Goyal", "Terry Chen", "Praynaa Rawlani", "Christian Schallhart", "Swachhand Lokhande", "Xianghong Luo", "Jyn Shan", "Ceslee Montgomery", "Victoria Krakovna", "Federico Piccinini", "Omer Barak", "Jingyu Cui", "Yiling Jia", "Mikhail Dektiarev", "Alexey Kolganov", "Shiyu Huang", "Zhe Chen", "Xingyu Wang", "Jessica Austin", "Peter de Boursac", "Evgeny Sluzhaev", "Frank Ding", "Huijian Li", "Surya Bhupatiraju", "Mohit Agarwal", "Sławek Kwasiborski", "Paramjit Sandhu", "Patrick Siegler", "Ahmet Iscen", "Eyal Ben-David", "Shiraz Butt", "Miltos Allamanis", "Seth Benjamin", "Robert Busa-Fekete", "Felix Hernandez-Campos", "Sasha Goldshtein", "Matt Dibb", "Weiyang Zhang", "Annie Marsden", "Carey Radebaugh", "Stephen Roller", "Abhishek Nayyar", "Jacob Austin", "Tayfun Terzi", "Bhargav Kanagal Shamanna", "Pete Shaw", "Aayush Singh", "Florian Luisier", "Artur Mendonça", "Vaibhav Aggarwal", "Larisa Markeeva", "Claudio Fantacci", "Sergey Brin", "HyunJeong Choe", "Guanyu Wang", "Hartwig Adam", "Avigail Dabush", "Tatsuya Kiyono", "Eyal Marcus", "Jeremy Cole", "Theophane Weber", "Hongrae Lee", "Ronny Huang", "Alex Muzio", "Leandro Kieliger", "Maigo Le", "Courtney Biles", "Long Le", "Archit Sharma", "Chengrun Yang", "Avery Lamp", "Dave Dopson", "Nate Hurley", "Katrina Xinyi Xu", "Zhihao Shan", "Shuang Song", "Jiewen Tan", "Alexandre Senges", "George Zhang", "Chong You", "Yennie Jun", "David Raposo", "Susanna Ricco", "Xuan Yang", "Weijie Chen", "Prakhar Gupta", "Arthur Szlam", "Kevin Villela", "Chun-Sung Ferng", "Daniel Kasenberg", "Chen Liang", "Rui Zhu", "Arunachalam Narayanaswamy", "Florence Perot", "Paul Pucciarelli", "Anna Shekhawat", "Alexey Stern", "Rishikesh Ingale", "Stefani Karp", "Sanaz Bahargam", "Adrian Goedeckemeyer", "Jie Han", "Sicheng Li", "Andrea Tacchetti", "Dian Yu", "Abhishek Chakladar", "Zhiying Zhang", "Mona El Mahdy", "Xu Gao", "Dale Johnson", "Samrat Phatale", "AJ Piergiovanni", "Hyeontaek Lim", "Clement Farabet", "Carl Lebsack", "Theo Guidroz", "John Blitzer", "Nico Duduta", "David Madras", "Steve Li", "Daniel von Dincklage", "Xin Li", "Mahdis Mahdieh", "George Tucker", "Ganesh Jawahar", "Owen Xiao", "Danny Tarlow", "Robert Geirhos", "Noam Velan", "Daniel Vlasic", "Kalesha Bullard", "SK Park", "Nishesh Gupta", "Kellie Webster", "Ayal Hitron", "Jieming Mao", "Julian Eisenschlos", "Laurel Prince", "Nina D'Souza", "Kelvin Zheng", "Sara Nasso", "Gabriela Botea", "Carl Doersch", "Caglar Unlu", "Chris Alberti", "Alexey Svyatkovskiy", "Ankita Goel", "Krzysztof Choromanski", "Pan-Pan Jiang", "Richard Nguyen", "Four Flynn", "Daria Ćurko", "Peter Chen", "Nicholas Roth", "Kieran Milan", "Caleb Habtegebriel", "Shashi Narayan", "Michael Moffitt", "Jake Marcus", "Thomas Anthony", "Brendan McMahan", "Gowoon Cheon", "Ruibo Liu", "Megan Barnes", "Lukasz Lew", "Rebeca Santamaria-Fernandez", "Mayank Upadhyay", "Arjun Akula", "Arnar Mar Hrafnkelsson", "Alvaro Caceres", "Andrew Bunner", "Michal Sokolik", "Subha Puttagunta", "Lawrence Moore", "Berivan Isik", "Jay Hartford", "Lawrence Chan", "Pradeep Shenoy", "Dan Holtmann-Rice", "Jane Park", "Fabio Viola", "Alex Salcianu", "Sujeevan Rajayogam", "Ian Stewart-Binks", "Zelin Wu", "Richard Everett", "Xi Xiong", "Pierre-Antoine Manzagol", "Gary Leung", "Carl Saroufim", "Bo Pang", "Dawid Wegner", "George Papamakarios", "Jennimaria Palomaki", "Helena Pankov", "Guangda Lai", "Guilherme Tubone", "Shubin Zhao", "Theofilos Strinopoulos", "Seth Neel", "Mingqiu Wang", "Joe Kelley", "Li Li", "Pingmei Xu", "Anitha Vijayakumar", "Andrea D'olimpio", "Omer Levy", "Massimo Nicosia", "Grigory Rozhdestvenskiy", "Ni Lao", "Sirui Xie", "Yash Katariya", "Jon Simon", "Sanjiv Kumar", "Florian Hartmann", "Michael Kilgore", "Jinhyuk Lee", "Aroma Mahendru", "Roman Ring", "Tom Hennigan", "Fiona Lang", "Colin Cherry", "David Steiner", "Dawsen Hwang", "Ray Smith", "Pidong Wang", "Jeremy Chen", "Ming-Hsuan Yang", "Sam Kwei", "Philippe Schlattner", "Donnie Kim", "Ganesh Poomal Girirajan", "Nikola Momchev", "Ayushi Agarwal", "Xingyi Zhou", "Ilkin Safarli", "Zachary Garrett", "AJ Pierigiovanni", "Sarthak Jauhari", "Alif Raditya Rochman", "Shikhar Vashishth", "Quan Yuan", "Christof Angermueller", "Jon Blanton", "Xinying Song", "Nitesh Bharadwaj Gundavarapu", "Thi Avrahami", "Maxine Deines", "Subhrajit Roy", "Manish Gupta", "Christopher Semturs", "Shobha Vasudevan", "Aditya Srikanth Veerubhotla", "Shriya Sharma", "Josh Jacob", "Zhen Yang", "Andreas Terzis", "Dan Karliner", "Auriel Wright", "Tania Rojas-Esponda", "Ashley Brown", "Abhijit Guha Roy", "Pawan Dogra", "Andrei Kapishnikov", "Peter Young", "Wendy Kan", "Vinodh Kumar Rajendran", "Maria Ivanova", "Salil Deshmukh", "Chia-Hua Ho", "Mike Kwong", "Stav Ginzburg", "Annie Louis", "KP Sawhney", "Slav Petrov", "Jing Xie", "Yunfei Bai", "Georgi Stoyanov", "Alex Fabrikant", "Rajesh Jayaram", "Yuqi Li", "Joe Heyward", "Justin Gilmer", "Yaqing Wang", "Radu Soricut", "Luyang Liu", "Qingnan Duan", "Jamie Hayes", "Maura O'Brien", "Gaurav Singh Tomar", "Sivan Eiger", "Bahar Fatemi", "Jeffrey Hui", "Catarina Barros", "Adaeze Chukwuka", "Alena Butryna", "Saksham Thakur", "Austin Huang", "Zhufeng Pan", "Haotian Tang", "Serkan Cabi", "Tulsee Doshi", "Michiel Bakker", "Sumit Bagri", "Ruy Ley-Wild", "Adam Lelkes", "Jennie Lees", "Patrick Kane", "David Greene", "Shimu Wu", "Jörg Bornschein", "Gabriela Surita", "Sarah Hodkinson", "Fangtao Li", "Chris Hidey", "Sébastien Pereira", "Sean Ammirati", "Phillip Lippe", "Adam Kraft", "Pu Han", "Sebastian Gerlach", "Zifeng Wang", "Liviu Panait", "Feng Han", "Brian Farris", "Yingying Bi", "Hannah DeBalsi", "Miaosen Wang", "Gladys Tyen", "James Cohan", "Susan Zhang", "Jarred Barber", "Da-Woon Chung", "Jaeyoun Kim", "Markus Kunesch", "Steven Pecht", "Nami Akazawa", "Abe Friesen", "James Lyon", "Ali Eslami", "Junru Wu", "Jie Tan", "Yue Song", "Ravi Kumar", "Chris Welty", "Ilia Akolzin", "Gena Gibson", "Sean Augenstein", "Arjun Pillai", "Nancy Yuen", "Du Phan", "Xin Wang", "Iain Barr", "Heiga Zen", "Nan Hua", "Casper Liu", "Jilei Jerry Wang", "Tanuj Bhatia", "Hao Xu", "Oded Elyada", "Pushmeet Kohli", "Mirek Olšák", "Ke Chen", "Azalia Mirhoseini", "Noam Shazeer", "Shoshana Jakobovits", "Maggie Tran", "Nolan Ramsden", "Tarun Bharti", "Fred Alcober", "Yunjie Li", "Shilpa Shetty", "Jing Chen", "Dmitry Kalashnikov", "Megha Nawhal", "Sercan Arik", "Hanwen Chen", "Michiel Blokzijl", "Shubham Gupta", "James Rubin", "Rigel Swavely", "Sophie Bridgers", "Ian Gemp", "Chen Su", "Arun Suggala", "Juliette Pluto", "Mary Cassin", "Alain Vaucher", "Kaiyang Ji", "Jiahao Cai", "Andrew Audibert", "Animesh Sinha", "David Tian", "Efrat Farkash", "Amy Hua", "Jilin Chen", "Duc-Hieu Tran", "Edward Loper", "Nicole Brichtova", "Lara McConnaughey", "Ballie Sandhu", "Robert Leland", "Doug DeCarlo", "Andrew Over", "James Huang", "Xing Wu", "Connie Fan", "Eric Li", "Yun Lei", "Deepak Sharma", "Cosmin Paduraru", "Luo Yu", "Matko Bošnjak", "Phuong Dao", "Min Choi", "Sneha Kudugunta", "Jakub Adamek", "Carlos Guía", "Ali Khodaei", "Jie Feng", "Wenjun Zeng", "David Welling", "Sandeep Tata", "Christina Butterfield", "Andrey Vlasov", "Seliem El-Sayed", "Swaroop Mishra", "Tara Sainath", "Shentao Yang", "RJ Skerry-Ryan", "Jeremy Shar", "Robert Berry", "Arunkumar Rajendran", "Arun Kandoor", "Andrea Burns", "Deepali Jain", "Tom Stone", "Wonpyo Park", "Shibo Wang", "Albin Cassirer", "Guohui Wang", "Hayato Kobayashi", "Sergey Rogulenko", "Vineetha Govindaraj", "Mikołaj Rybiński", "Nadav Olmert", "Colin Evans", "Po-Sen Huang", "Kelvin Xu", "Premal Shah", "Terry Thurk", "Caitlin Sikora", "Mu Cai", "Jin Xie", "Elahe Dabir", "Saloni Shah", "Norbert Kalb", "Carrie Zhang", "Shruthi Prabhakara", "Amit Sabne", "Artiom Myaskovsky", "Vikas Raunak", "Blanca Huergo", "Behnam Neyshabur", "Jon Clark", "Ye Zhang", "Shankar Krishnan", "Eden Cohen", "Dinesh Tewari", "James Lottes", "Yumeya Yamamori", "Hui Elena Li", "Mohamed Elhawaty", "Ada Maksutaj Oflazer", "Adrià Recasens", "Sheryl Luo", "Duy Nguyen", "Taylor Bos", "Kalyan Andra", "Ana Salazar", "Ed Chi", "Jeongwoo Ko", "Matt Ginsberg", "Anders Andreassen", "Anian Ruoss", "Todor Davchev", "Elnaz Davoodi", "Chenxi Liu", "Min Kim", "Santiago Ontanon", "Chi Ming To", "Dawei Jia", "Rosemary Ke", "Jing Wang", "Anna Korsun", "Moran Ambar", "Ilya Kornakov", "Irene Giannoumis", "Toni Creswell", "Denny Zhou", "Yi Su", "Ishaan Watts", "Aleksandr Zaks", "Evgenii Eltyshev", "Ziqiang Feng", "Sidharth Mudgal", "Alex Kaskasoli", "Juliette Love", "Kingshuk Dasgupta", "Sam Shleifer", "Richard Green", "Sungyong Seo", "Chansoo Lee", "Dale Webster", "Prakash Shroff", "Ganna Raboshchuk", "Isabel Leal", "James Manyika", "Sofia Erell", "Daniel Murphy", "Zhisheng Xiao", "Anton Bulyenov", "Julian Walker", "Mark Collier", "Matej Kastelic", "Nelson George", "Sushant Prakash", "Sailesh Sidhwani", "Alexey Frolov", "Steven Hansen", "Petko Georgiev", "Tiberiu Sosea", "Chris Apps", "Aishwarya Kamath", "David Reid", "Emma Cooney", "Charlotte Magister", "Oriana Riva", "Alec Go", "Pu-Chin Chen", "Sebastian Krause", "Nir Levine", "Marco Fornoni", "Ilya Figotin", "Nick Roy", "Parsa Mahmoudieh", "Vladimir Magay", "Mukundan Madhavan", "Jin Miao", "Jianmo Ni", "Yasuhisa Fujii", "Ian Chou", "George Scrivener", "Zak Tsai", "Siobhan Mcloughlin", "Jeremy Selier", "Sandra Lefdal", "Jeffrey Zhao", "Abhijit Karmarkar", "Kushal Chauhan", "Shivanker Goel", "Zhaoyi Zhang", "Vihan Jain", "Parisa Haghani", "Mostafa Dehghani", "Jacob Scott", "Erin Farnese", "Anastasija Ilić", "Steven Baker", "Julia Pawar", "Li Zhong", "Josh Camp", "Yoel Zeldes", "Shravya Shetty", "Anand Iyer", "Vít Listík", "Jiaxian Guo", "Luming Tang", "Mark Geller", "Simon Bucher", "Yifan Ding", "Hongzhi Shi", "Carrie Muir", "Dominik Grewe", "Ramy Eskander", "Octavio Ponce", "Boqing Gong", "Derek Gasaway", "Samira Khan", "Umang Gupta", "Angelos Filos", "Weicheng Kuo", "Klemen Kloboves", "Jennifer Beattie", "Christian Wright", "Leon Li", "Alicia Jin", "Sandeep Mariserla", "Miteyan Patel", "Jens Heitkaemper", "Dilip Krishnan", "Vivek Sharma", "David Bieber", "Christian Frank", "John Lambert", "Paul Caron", "Martin Polacek", "Mai Giménez", "Himadri Choudhury", "Xing Yu", "Sasan Tavakkol", "Arun Ahuja", "Franz Och", "Rodolphe Jenatton", "Wojtek Skut", "Bryan Richter", "David Gaddy", "Andy Ly", "Misha Bilenko", "Megh Umekar", "Ethan Liang", "Martin Sevenich", "Mandar Joshi", "Hassan Mansoor", "Rebecca Lin", "Sumit Sanghai", "Abhimanyu Singh", "Xiaowei Li", "Sudheendra Vijayanarasimhan", "Zaheer Abbas", "Yonatan Bitton", "Hansa Srinivasan", "Manish Reddy Vuyyuru", "Alexander Frömmgen", "Yanhua Sun", "Ralph Leith", "Alfonso Castaño", "DJ Strouse", "Le Yan", "Austin Kyker", "Satish Kambala", "Mary Jasarevic", "Thibault Sellam", "Chao Jia", "Alexander Pritzel", "Raghavender R", "Huizhong Chen", "Natalie Clay", "Sudeep Gandhe", "Sean Kirmani", "Sayna Ebrahimi", "Hannah Kirkwood", "Jonathan Mallinson", "Chao Wang", "Adnan Ozturel", "Kuo Lin", "Shyam Upadhyay", "Vincent Cohen-Addad", "Sean Purser-haskell", "Yichong Xu", "Ebrahim Songhori", "Babi Seal", "Alberto Magni", "Almog Gueta", "Tingting Zou", "Guru Guruganesh", "Thais Kagohara", "Hung Nguyen", "Khalid Salama", "Alejandro Cruzado Ruiz", "Justin Frye", "Zhenkai Zhu", "Matthias Lochbrunner", "Simon Osindero", "Wentao Yuan", "Lisa Lee", "Aman Prasad", "Lam Nguyen Thiet", "Daniele Calandriello", "Victor Stone", "Qixuan Feng", "Han Ke", "Maria Voitovich", "Geta Sampemane", "Lewis Chiang", "Ling Wu", "Alexander Bykovsky", "Matt Young", "Luke Vilnis", "Ishita Dasgupta", "Aditya Chawla", "Qin Cao", "Bowen Liang", "Daniel Toyama", "Szabolcs Payrits", "Anca Stefanoiu", "Dimitrios Vytiniotis", "Ankesh Anand", "Tianxiao Shen", "Blagoj Mitrevski", "Michael Tschannen", "Sreenivas Gollapudi", "Aishwarya P S", "José Leal", "Zhe Shen", "Han Fu", "Wei Wang", "Arvind Kannan", "Doron Kukliansky", "Sergey Yaroshenko", "Svetlana Grant", "Umesh Telang", "David Wood", "Alexandra Chronopoulou", "Alexandru Ţifrea", "Tao Zhou", "Tony Tu\\'ân Nguy\\~ên", "Muge Ersoy", "Anima Singh", "Meiyan Xie", "Emanuel Taropa", "Woohyun Han", "Eirikur Agustsson", "Andrei Sozanschi", "Hui Peng", "Alex Chen", "Yoel Drori", "Efren Robles", "Yang Gao", "Xerxes Dotiwalla", "Ying Chen", "Anudhyan Boral", "Alexei Bendebury", "John Nham", "Chris Tar", "Luis Castro", "Jiepu Jiang", "Canoee Liu", "Felix Halim", "Jinoo Baek", "Andy Wan", "Jeremiah Liu", "Yuan Cao", "Shengyang Dai", "Trilok Acharya", "Ruoxi Sun", "Fuzhao Xue", "Saket Joshi", "Morgane Lustman", "Yongqin Xian", "Rishabh Joshi", "Deep Karkhanis", "Nora Kassner", "Jamie Hall", "Xiangzhuo Ding", "Gan Song", "Gang Li", "Chen Zhu", "Yana Kulizhskaya", "Bin Ni", "Alexey Vlaskin", "Solomon Demmessie", "Lucio Dery", "Salah Zaiem", "Yanping Huang", "Cindy Fan", "Felix Gimeno", "Ananth Balashankar", "Koji Kojima", "Hagai Taitelbaum", "Maya Meng", "Dero Gharibian", "Sahil Singla", "Wei Chen", "Ambrose Slone", "Guanjie Chen", "Sujee Rajayogam", "Max Schumacher", "Suyog Kotecha", "Rory Blevins", "Qifei Wang", "Mor Hazan Taege", "Alex Morris", "Xin Liu", "Fayaz Jamil", "Richard Zhang", "Pratik Joshi", "Ben Ingram", "Tyler Liechty", "Ahmed Eleryan", "Scott Baird", "Alex Grills", "Gagan Bansal", "Shan Han", "Kiran Yalasangi", "Shawn Xu", "Majd Al Merey", "Isabel Gao", "Felix Weissenberger", "Igor Karpov", "Robert Riachi", "Ankit Anand", "Gautam Prasad", "Kay Lamerigts", "Reid Hayes", "Jamie Rogers", "Mandy Guo", "Ashish Shenoy", "Qiong Q Hu", "Kyle He", "Yuchen Liu", "Polina Zablotskaia", "Sagar Gubbi", "Yifan Chang", "Jay Pavagadhi", "Kristian Kjems", "Archita Vadali", "Diego Machado", "Yeqing Li", "Renshen Wang", "Dipankar Ghosh", "Aahil Mehta", "Dana Alon", "George Polovets", "Alessio Tonioni", "Nate Kushman", "Joel D'sa", "Lin Zhuo", "Allen Wu", "Rohin Shah", "John Youssef", "Jiayu Ye", "Justin Snyder", "Karel Lenc", "Senaka Buthpitiya", "Matthew Tung", "Jichuan Chang", "Tao Chen", "David Saxton", "Jenny Lee", "Lydia Lihui Zhang", "James Qin", "Prabakar Radhakrishnan", "Maxwell Chen", "Piotr Ambroszczyk", "Metin Toksoz-Exley", "Yan Zhong", "Nitzan Katz", "Brendan O'Donoghue", "Tamara von Glehn", "Adi Gerzi Rosenthal", "Aga Świetlik", "Xiaokai Zhao", "Nick Fernando", "Jinliang Wei", "Jieru Mei", "Sergei Vassilvitskii", "Diego Cedillo", "Pranjal Awasthi", "Hui Zheng", "Koray Kavukcuoglu", "Itay Laish", "Joseph Pagadora", "Marc Brockschmidt", "Christopher A. Choquette-Choo", "Arunkumar Byravan", "Yifeng Lu", "Xu Chen", "Mia Chen", "Kenton Lee", "Rama Pasumarthi", "Sijal Bhatnagar", "Aditya Shah", "Qiyin Wu", "Zhuoyuan Chen", "Zack Nado", "Bartek Perz", "Zixuan Jiang", "David Kao", "Ganesh Mallya", "Nino Vieillard", "Lantao Mei", "Sertan Girgin", "Mandy Jordan", "Yeongil Ko", "Alekh Agarwal", "Yaxin Liu", "Yasemin Altun", "Raoul de Liedekerke", "Anastasios Kementsietsidis", "Daiyi Peng", "Dangyi Liu", "Utku Evci", "Peter Humphreys", "Austin Tarango", "Xiang Deng", "Yoad Lewenberg", "Kevin Aydin", "Chengda Wu", "Bhavishya Mittal", "Tsendsuren Munkhdalai", "Kleopatra Chatziprimou", "Rodrigo Benenson", "Uri First", "Xiao Ma", "Jinning Li", "Armand Joulin", "Hamish Tomlinson", "Tingnan Zhang", "Milad Nasr", "Zhi Hong", "Michaël Sander", "Lisa Anne Hendricks", "Anuj Sharma", "Andrew Bolt", "Eszter Vértes", "Jiri Simsa", "Tomer Levinboim", "Olcan Sercinoglu", "Divyansh Shukla", "Austin Wu", "Craig Swanson", "Danny Vainstein", "Fan Bu", "Bo Wang", "Ryan Julian", "Charles Yoon", "Sergei Lebedev", "Antonious Girgis", "Bernd Bandemer", "David Du", "Todd Wang", "Xi Chen", "Ying Xiao", "Peggy Lu", "Natalie Ha", "Vlad Ionescu", "Simon Rowe", "Josip Matak", "Federico Lebron", "Andreas Steiner", "Lalit Jain", "Manaal Faruqui", "Nicolas Lacasse", "Georgie Evans", "Neesha Subramaniam", "Dean Reich", "Giulia Vezzani", "Aditya Pandey", "Joe Stanton", "Tianhao Zhou", "Liam McCafferty", "Henry Griffiths", "Verena Rieser", "Soheil Hassas Yeganeh", "Eleftheria Briakou", "Lu Huang", "Zichuan Wei", "Liangchen Luo", "Erik Jue", "Gabby Wang", "Victor Cotruta", "Myriam Khan", "Jongbin Park", "Qiuchen Guo", "Peiran Li", "Rong Rong", "Diego Antognini", "Anastasia Petrushkina", "Chetan Tekur", "Eli Collins", "Parul Bhatia", "Chester Kwak", "Wenhu Chen", "Arvind Neelakantan", "Immanuel Odisho", "Sheng Peng", "Vincent Nallatamby", "Vaibhav Tulsyan", "Fabian Pedregosa", "Peng Xu", "Raymond Lin", "Yulong Wang", "Emma Wang", "Sholto Douglas", "Reut Tsarfaty", "Elena Gribovskaya", "Renga Aravamudhan", "Manu Agarwal", "Mara Finkelstein", "Qiao Zhang", "Elizabeth Cole", "Phil Crone", "Sarmishta Velury", "Anil Das", "Chris Sauer", "Luyao Xu", "Danfeng Qin", "Chenjie Gu", "Dror Marcus", "CJ Zheng", "Wouter Van Gansbeke", "Sobhan Miryoosefi", "Haitian Sun", "YaGuang Li", "Charlie Chen", "Jae Yoo", "Pavel Dubov", "Alex Tomala", "Adams Yu", "Paweł Wesołowski", "Alok Gunjan", "Eddie Cao", "Jiaming Luo", "Nikhil Sethi", "Arkadiusz Socala", "Laura Graesser", "Tomas Kocisky", "Arturo BC", "Minmin Chen", "Edward Lee", "Sophie Wang", "Weize Kong", "Qiantong Xu", "Nilesh Tripuraneni", "Yiming Li", "Xinxin Yu", "Allen Porter", "Paul Voigtlaender", "Biao Zhang", "Arpi Vezer", "Sarah York", "Qing Wei", "Geoffrey Cideron", "Mark Kurzeja", "Seungyeon Kim", "Benny Li", "Angéline Pouget", "Hyo Lee", "Kaspar Daugaard", "Yang Li", "Dave Uthus", "Aditya Siddhant", "Paul Cavallaro", "Sriram Ganapathy", "Maulik Shah", "Rolf Jagerman", "Jeff Stanway", "Piermaria Mendolicchio", "Li Xiao", "Kayi Lee", "Tara Thompson", "Shubham Milind Phal", "Jason Chase", "Sun Jae Lee", "Adrian N Reyes", "Disha Shrivastava", "Zhen Qin", "Roykrong Sukkerd", "Seth Odoom", "Lior Madmoni", "John Aslanides", "Jonathan Herzig", "Elena Pochernina", "Sheng Zhang", "Parker Barnes", "Daisuke Ikeda", "Qiujia Li", "Shuo-yiin Chang", "Shakir Mohamed", "Jim Sproch", "Richard Powell", "Bidisha Samanta", "Domagoj Ćevid", "Anton Kovsharov", "Shrestha Basu Mallick", "Srinivas Tadepalli", "Anne Zheng", "Kareem Ayoub", "Andreas Noever", "Christian Reisswig", "Zhuo Xu", "Junhyuk Oh", "Martin Matysiak", "Tim Blyth", "Shereen Ashraf", "Julien Amelot", "Boone Severson", "Michele Bevilacqua", "Motoki Sano", "Ethan Dyer", "Ofir Roval", "Anu Sinha", "Yin Zhong", "Sagi Perel", "Tea Sabolić", "Johannes Mauerer", "Willi Gierke", "Mauro Verzetti", "Rodrigo Cabrera", "Alvin Abdagic", "Steven Hemingray", "Austin Stone", "Jong Lee", "Farooq Ahmad", "Karthik Raman", "Lior Shani", "Jonathan Lai", "Orhan Firat", "Nathan Waters", "Eric Ge", "Mo Shomrat", "Himanshu Gupta", "Rajeev Aggarwal", "Tom Hudson", "Bill Jia", "Simon Baumgartner", "Palak Jain", "Joe Kovac", "Junehyuk Jung", "Ante Žužul", "Will Truong", "Morteza Zadimoghaddam", "Songyou Peng", "Marco Liang", "Rachel Sterneck", "Balaji Lakshminarayanan", "Machel Reid", "Oliver Woodman", "Tong Zhou", "Jianling Wang", "Vincent Coriou", "Arjun Narayanan", "Jay Hoover", "Yenai Ma", "Apoorv Jindal", "Clayton Sanford", "Doug Reid", "Swaroop Ramaswamy", "Alex Kurakin", "Roland Zimmermann", "Yana Lunts", "Dragos Dena", "Zalán Borsos", "Vered Cohen", "Shujian Zhang", "Will Grathwohl", "Robert Dadashi", "Morgan Redshaw", "Joshua Kessinger", "Julian Odell", "Silvano Bonacina", "Zihang Dai", "Grace Chen", "Ayush Dubey", "Pablo Sprechmann", "Mantas Pajarskas", "Wenxuan Zhou", "Niharika Ahuja", "Tara Thomas", "Martin Nikoltchev", "Matija Kecman", "Bharath Mankalale", "Andrey Ryabtsev", "Jennifer She", "Christian Walder", "Jiaming Shen", "Lu Li", "Carolina Parada", "Sheena Panthaplackel", "Okwan Kwon", "Matt Lawlor", "Utsav Prabhu", "Yannick Schroecker", "Marc'aurelio Ranzato", "Pete Blois", "Iurii Kemaev", "Ting Yu", "Dmitry Lepikhin", "Hao Xiong", "Sahand Sharifzadeh", "Oleaser Johnson", "Jeremiah Willcock", "Rui Yao", "Greg Farquhar", "Sujoy Basu", "Hidetoshi Shimokawa", "Nina Anderson", "Haiguang Li", "Khiem Pham", "Yizhong Liang", "Sebastian Borgeaud", "Alexandre Moufarek", "Hideto Kazawa", "Blair Kutzman", "Marcin Sieniek", "Sara Smoot", "Ruth Wang", "Natalie Axelsson", "Nova Fallen", "Prasha Sundaram", "Yuexiang Zhai", "Varun Godbole", "Petros Maniatis", "Alek Wang", "Ilia Shumailov", "Santhosh Thangaraj", "Remi Crocker", "Nikita Gupta", "Gang Wu", "Phil Chen", "Gellért Weisz", "Celine Smith", "Mojtaba Seyedhosseini", "Boya Fang", "Xiyang Luo", "Roey Yogev", "Zeynep Cankara", "Andrew Hard", "Helen Ran", "Rahul Sukthankar", "George Necula", "Gaël Liu", "Honglong Cai", "Praseem Banzal", "Daniel Keysers", "Sanjay Ghemawat", "Connie Tao", "Emma Dunleavy", "Aditi Chaudhary", "Wei Li", "Maciej Mikuła", "Chen-Yu Lee", "Tiziana Refice", "Krishna Somandepalli", "Alexandre Fréchette", "Dan Bahir", "John Karro", "Keith Rush", "Sarah Perrin", "Bill Rosgen", "Xiaomeng Yang", "Clara Huiyi Hu", "Mahmoud Alnahlawi", "Justin Mao-Jones", "Roopal Garg", "Hoang Nguyen", "Bat-Orgil Batsaikhan", "Iñaki Iturrate", "Anselm Levskaya", "Avi Singh", "Ashyana Kachra", "Tony Lu", "Denis Petek", "Zheng Xu", "Mark Graham", "Lukas Zilka", "Yael Karov", "Marija Kostelac", "Fangyu Liu", "Yaohui Guo", "Weiyue Wang", "Bernd Bohnet", "Emily Pitler", "Tony Bruguier", "Keisuke Kinoshita", "Chrysovalantis Anastasiou", "Nilpa Jha", "Ting Liu", "Jerome Connor", "Phil Wallis", "Philip Pham", "Eric Bailey", "Shixin Li", "Heng-Tze Cheng", "Sally Ma", "Haiqiong Li", "Akanksha Maurya", "Kate Olszewska", "Manfred Warmuth", "Christy Koh", "Dominik Paulus", "Siddhartha Reddy Jonnalagadda", "Enrique Piqueras", "Ali Elqursh", "Geoff Brown", "Hadar Shemtov", "Loren Maggiore", "Fei Xia", "Ryan Foley", "Beka Westberg", "George van den Driessche", "Livio Baldini Soares", "Arjun Kar", "Michael Quinn", "Siqi Zuo", "Jialin Wu", "Kyle Kastner", "Anna Bortsova", "Aijun Bai", "Ales Mikhalap", "Luowei Zhou", "Jennifer Brennan", "Vinay Ramasesh", "Honglei Zhuang", "John Maggs", "Johan Schalkwyk", "Yuntao Xu", "Hui Huang", "Andrew Howard", "Sasha Brown", "Linting Xue", "Gloria Shen", "Brian Albert", "Neha Jha", "Daniel Zheng", "Varvara Krayvanova", "Spurthi Amba Hombaiah", "Olivier Lacombe", "Gautam Vasudevan", "Dan Graur", "Tian Xie", "Meet Gandhi", "Bangju Wang", "Dustin Zelle", "Harman Singh", "Dahun Kim", "Sébastien Cevey", "Victor Ungureanu", "Natasha Noy", "Fei Liu", "Annie Xie", "Fangxiaoyu Feng", "Katerina Tsihlas", "Daniel Formoso", "Neera Vats", "Quentin Wellens", "Yinan Wang", "Niket Kumar Bhumihar", "Samrat Ghosh", "Matt Hoffman", "Tom Lieber", "Oran Lang", "Kush Bhatia", "Tom Paine", "Aroonalok Pyne", "Ronny Votel", "Madeleine Clare Elish", "Benoit Schillings", "Alex Panagopoulos", "Haichuan Yang", "Adam Raveret", "Zohar Yahav", "Shuang Liu", "Dalia El Badawy", "Nishant Agrawal", "Mohammed Badawi", "Mahdi Mirzazadeh", "Carla Bromberg", "Fan Ye", "Chang Liu", "Tatiana Sholokhova", "George-Cristian Muraru", "Gargi Balasubramaniam", "Jonathan Malmaud", "Alen Carin", "Danilo Martins", "Irina Jurenka", "Pankil Botadra", "Dave Lacey", "Richa Singh", "Mariano Schain", "Dan Zheng", "Isabelle Guyon", "Victor Lavrenko", "Seungji Lee", "Xiang Zhou", "Demis Hassabis", "Jeshwanth Challagundla", "Derek Cheng", "Nikhil Mehta", "Matthew Mauger", "Michela Paganini", "Pushkar Mishra", "Kate Lee", "Zhang Li", "Lexi Baugher", "Ondrej Skopek", "Max Chang", "Amir Zait", "Gaurav Menghani", "Lizzetth Bellot", "Guangxing Han", "Jean-Michel Sarr", "Sharat Chikkerur", "Himanshu Sahni", "Rohan Anil", "Arun Narayanan", "Chandu Thekkath", "Daniele Pighin", "Hana Strejček", "Marko Velic", "Fred Bertsch", "Manuel Tragut", "Keran Rong", "Alicia Parrish", "Kai Bailey", "Jiho Park", "Isabela Albuquerque", "Abhishek Bapna", "Rajesh Venkataraman", "Alec Kosik", "Johannes Griesser", "Zhiwei Deng", "Alek Andreev", "Qingyun Dou", "Kevin Hui", "Fanny Wei", "Xiaobin Yu", "Lei Shu", "Avia Aharon", "David Barker", "Badih Ghazi", "Sebastian Flennerhag", "Chris Breaux", "Yuchuan Liu", "Matthew Bilotti", "Josh Woodward", "Uri Alon", "Stephanie Winkler", "Tzu-Kuo Huang", "Kostas Andriopoulos", "João Gabriel Oliveira", "Penporn Koanantakool", "Berkin Akin", "Michael Wunder", "Cicero Nogueira dos Santos", "Mohammad Hossein Bateni", "Lin Yang", "Dan Horgan", "Beer Changpinyo", "Keyvan Amiri", "Min Ma", "Dayeong Lee", "Lihao Liang", "Anirudh Baddepudi", "Tejasi Latkar", "Raia Hadsell", "Jun Xu", "Hairong Mu", "Michael Han", "Aedan Pope", "Snchit Grover", "Frank Kim", "Ankit Bhagatwala", "Guan Sun", "Yamini Bansal", "Amir Globerson", "Alireza Nazari", "Samira Daruki", "Hagen Soltau", "Jane Labanowski", "Laurent El Shafey", "Matt Harvey", "Yanif Ahmad", "Elan Rosenfeld", "William Kong", "Etienne Pot", "Yi-Xuan Tan", "Aurora Wei", "Victoria Langston", "Marcel Prasetya", "Petar Veličković", "Richard Killam", "Robin Strudel", "Darren Ni", "Zhenhai Zhu", "Aaron Archer", "Kavya Kopparapu", "Lynn Nguyen", "Emilio Parisotto", "Hussain Masoom", "Sravanti Addepalli", "Jordan Grimstad", "Hexiang Hu", "Joss Moore", "Avinatan Hassidim", "Le Hou", "Mukund Raghavachari", "Jared Lichtarge", "Adam R. Brown", "Hilal Dib", "Natalia Ponomareva", "Justin Fu", "Yujing Zhang", "Altaf Rahman", "Joana Iljazi", "Edouard Leurent", "Gabriel Dulac-Arnold", "Cosmo Du", "Chulayuth Asawaroengchai", "Larry Jin", "Ela Gruzewska", "Ziwei Ji", "Benigno Uria", "Daniel De Freitas", "Paul Barham", "Lauren Beltrone", "Víctor Campos", "Jun Yan", "Neel Kovelamudi", "Arthur Nguyen", "Elinor Davies", "Zhichun Wu", "Zoltan Egyed", "Kristina Toutanova", "Nithya Attaluri", "Hongliang Fei", "Peter Stys", "Siddhartha Brahma", "Martin Izzard", "Siva Velusamy", "Scott Lundberg", "Vincent Zhuang", "Kevin Sequeira", "Adam Santoro", "Ehsan Amid", "Ophir Aharoni", "Shuai Ye", "Mukund Sundararajan", "Lijun Yu", "Yu-Cheng Ling", "Stephen Spencer", "Hugo Song", "Josip Djolonga", "Christo Kirov", "Sonal Gupta", "Alessandro Bissacco", "Clemens Meyer", "Mukul Bhutani", "Andrew Dai", "Weiyi Wang", "Siqi Liu", "Ashwin Sreevatsa", "Qijun Tan", "Maria Wang", "Lucy Kim", "Yicheng Wang", "Alex Irpan", "Yang Xiao", "Stanislav Fort", "Yifan He", "Alex Gurney", "Bryan Gale", "Yue Ma", "Monica Roy", "Viorica Patraucean", "Taylan Bilal", "Golnaz Ghiasi", "Anahita Hosseini", "Melvin Johnson", "Zhuowan Li", "Yi Tay", "Benjamin Beyret", "Katie Millican", "Josef Broder", "Mayank Lunayach", "Danny Swisher", "Eugen Vušak", "David Parkinson", "MH Tessler", "Adi Mayrav Gilady", "Richard Song", "Allan Dafoe", "Yves Raimond", "Masa Yamaguchi", "Itay Karo", "Elizabeth Nielsen", "Kevin Kilgour", "Mike Dusenberry", "Rajiv Mathews", "Jiho Choi", "Siyuan Qiao", "Harsh Mehta", "Sahitya Potluri", "Chris Knutsen", "Jialu Liu", "Tat Tan", "Kuntal Sengupta", "Keerthana Gopalakrishnan", "Abodunrinwa Toki", "Mencher Chiang", "Mike Burrows", "Grace Vesom", "Zafarali Ahmed", "Ilia Labzovsky", "Siddharth Vashishtha", "Preeti Singh", "Ankur Sharma", "Ada Ma", "Jinyu Xie", "Pranav Talluri", "Hannah Forbes-Pollard", "Aarush Selvan", "Joel Wee", "Loic Matthey", "Tom Funkhouser", "Parthasarathy Gopavarapu", "Lev Proleev", "Cheng Li", "Matt Thomas", "Kashyap Kolipaka", "Zhipeng Jia", "Ashwin Kakarla", "Srinivas Sunkara", "Joan Puigcerver", "Suraj Satishkumar Sheth", "Emily Graves", "Chen Wang", "Sadh MNM Khan", "Kai Kang", "Shyamal Buch", "Fred Zhang", "Omkar Savant", "David Soergel", "Kevin Lee", "Linda Friso", "Xuanyi Dong", "Rahul Arya", "Shreyas Chandrakaladharan", "Connor Schenck", "Greg Billock", "Tejas Iyer", "Anton Bakalov", "Leslie Baker", "Alex Ruiz", "Angad Chandorkar", "Trieu Trinh", "Matt Miecnikowski", "Yanqi Zhou", "Yangsibo Huang", "Jiazhong Nie", "Ali Shah", "Ashish Thapliyal", "Sam Haves", "Lun Wang", "Uri Shaham", "Patrick Morris-Suzuki", "Soroush Radpour", "Leonard Berrada", "Thomas Strohmann", "Chaochao Yan", "Jingwei Shen", "Sonam Goenka", "Tris Warkentin", "Petar Dević", "Dan Belov", "Albert Webson", "Madhavi Yenugula", "Puranjay Datta", "Jerry Chang", "Nimesh Ghelani", "Aviral Kumar", "Vincent Perot", "Jessica Lo", "Yang Song", "Herman Schmit", "Jianmin Chen", "Vasilisa Bashlovkina", "Xiaoyue Pan", "Diana Mincu", "Paul Roit", "Isabel Edkins", "Andy Davis", "Yujia Li", "Ben Horn", "Xinjian Li", "Pradeep Kumar S", "Eric Doi", "Wanzheng Zhu", "Sri Gayatri Sundara Padmanabhan", "Siddharth Verma", "Jasmine Liu", "Heng Chen", "Mihajlo Velimirović", "Malcolm Reynolds", "Priyanka Agrawal", "Nick Sukhanov", "Abhinit Modi", "Siddharth Goyal", "John Palowitch", "Nima Khajehnouri", "Wing Lowe", "David Klinghoffer", "Sharon Silver", "Vinh Tran", "Candice Schumann", "Francesco Piccinno", "Xi Liu", "Mario Lučić", "Xiaochen Yang", "Sandeep Kumar", "Ajay Kannan", "Ragha Kotikalapudi", "Mudit Bansal", "Fabian Fuchs", "Mohammad Javad Hosseini", "Abdelrahman Abdelhamed", "Dawn Bloxwich", "Tianhe Yu", "Ruoxin Sang", "Gregory Thornton", "Karan Gill", "Yuchi Liu", "Virat Shejwalkar", "Jason Lin", "Zhipeng Yan", "Kehang Han", "Thomas Buschmann", "Michael Pliskin", "Zhi Xing", "Susheel Tatineni", "Junlin Zhang", "Sissie Hsiao", "Gavin Buttimore", "Marcus Wu", "Zefei Li", "Geza Kovacs", "Legg Yeung", "Tao Huang", "Aaron Cohen", "Bethanie Brownfield", "Averi Nowak", "Mikel Rodriguez", "Tianze Shi", "Hado van Hasselt", "Kevin Cen", "Deepanway Ghoshal", "Kushal Majmundar", "Weiren Yu", "Warren Weilun Chen", "Danila Sinopalnikov", "Hao Zhang", "Vlado Galić", "Di Lu", "Zeyu Zheng", "Maggie Song", "Gary Wang", "Gui Citovsky", "Swapnil Gawde", "Isaac Galatzer-Levy", "David Silver", "Ivana Balazevic", "Dipanjan Das", "Kingshuk Majumder", "Yale Cong", "Praneet Dutta", "Dustin Tran", "Hui Wan", "Junwei Yuan", "Daniel Eppens", "Alanna Walton", "Been Kim", "Harry Ragan", "James Cobon-Kerr", "Lu Liu", "Weijun Wang", "Bryce Petrini", "Jack Rae", "Rakesh Shivanna", "Yan Xiong", "Chace Lee", "Pauline Coquinot", "Yiming Gu", "Lisa Patel", "Blake Hechtman", "Aviel Boag", "Orion Jankowski", "Alex Wertheim", "Alex Lee", "Paul Covington", "Hila Noga", "Sam Sobell", "Shanthal Vasanth", "William Bono", "Chirag Nagpal", "Wei Fan", "Xavier Garcia", "Kedar Soparkar", "Aybuke Turker", "Nathan Howard", "Sachit Menon", "Yuankai Chen", "Vikas Verma", "Vladimir Pchelin", "Harish Rajamani", "Valentin Dalibard", "Ana Ramalho", "Yang Guo", "Kartikeya Badola", "Seojin Bang", "Nathalie Rauschmayr", "Julia Proskurnia", "Sudeep Dasari", "Xinyun Chen", "Mikhail Sushkov", "Anja Hauth", "Pauline Sho", "Abhinav Singh", "Bilva Chandra", "Allie Culp", "Max Dylla", "Olivier Bachem", "James Besley", "Heri Zhao", "Timothy Lillicrap", "Wei Wei", "Wael Al Jishi", "Ning Niu", "Alban Rrustemi", "Raphaël Lopez Kaufman", "Ryan Poplin", "Jewel Zhao", "Minh Truong", "Shikhar Bharadwaj", "Ester Hlavnova", "Eli Stickgold", "Cordelia Schmid", "Georgi Stephanov", "Zhaoqi Leng", "Frederick Liu", "Léonard Hussenot", "Shenil Dodhia", "Juliana Vicente Franco", "Lesley Katzen", "Abhanshu Sharma", "Sarah Cogan", "Zuguang Yang", "Aniket Ray", "Sergi Caelles", "Shen Yan", "Ravin Kumar", "Daniel Gillick", "Renee Wong", "Joshua Ainslie", "Jonathan Hoech", "Séb Arnold", "Dan Abolafia", "Anca Dragan", "Ben Hora", "Grace Hu", "Alexey Guseynov", "Yang Lu", "Chas Leichner", "Jinmeng Rao", "Abhimanyu Goyal", "Nagabhushan Baddi", "Daniel Hernandez Diaz", "Tim McConnell", "Max Bain", "Jake Abernethy", "Qiqi Yan", "Rylan Schaeffer", "Paul Vicol", "Will Thompson", "Montse Gonzalez Arenas", "Mathias Bellaiche", "Pablo Barrio", "Stefan Zinke", "Riccardo Patana", "Pulkit Mehta", "JK Kearns", "Avraham Ruderman", "Scott Pollom", "David D'Ambrosio", "Cath Hope", "Yang Yu", "Andrea Gesmundo", "Kuang-Huei Lee", "Aviv Rosenberg", "Yiqian Zhou", "Yaoyiran Li", "Drew Garmon", "Yonghui Wu", "Safeen Huda", "Gil Fidel", "Martin Baeuml", "Jian Li", "Phoebe Kirk", "Rhys May", "Tao Tu", "Sara Mc Carthy", "Toshiyuki Fukuzawa", "Miranda Aperghis", "Chih-Kuan Yeh", "Toshihiro Yoshino", "Bo Li", "Austin Myers", "Kaisheng Yao", "Ben Limonchik", "Changwan Ryu", "Rohun Saxena", "Alex Goldin", "Ruizhe Zhao", "Rocky Rhodes", "Tao Zhu", "Divya Tyam", "Heidi Howard", "Nathan Byrd", "Hongxu Ma", "Yan Wu", "Ryan Mullins", "Qingze Wang", "Aida Amini", "Sebastien Baur", "Yiran Mao", "Subhashini Venugopalan", "Will Song", "Wen Ding", "Paul Collins", "Sashank Reddi", "Megan Shum", "Andrei Rusu", "Luisa Zintgraf", "Kelvin Chan", "Sheela Goenka", "Mathieu Blondel", "Michael Collins", "Renke Pan", "Marissa Giustina", "Nikolai Chinaev", "Christian Schuler", "Ce Zheng", "Jonas Valfridsson", "Alyssa Loo", "Alex Yakubovich", "Jamie Smith", "Tao Jiang", "Rich Munoz", "Gabriel Barcik", "Rishabh Bansal", "Mingyao Yang", "Yilun Du", "Pablo Duque", "Mary Phuong", "Alexandra Belias", "Kunal Lad", "Zeyu Liu", "Tal Schuster", "Karthik Duddu", "Jieru Hu", "Paige Kunkle", "Matthew Watson", "Jackson Tolins", "Josh Smith", "Denis Teplyashin", "Garrett Bingham", "Marvin Ritter", "Marco Andreetto", "Divya Pitta", "Mohak Patel", "Shashank Viswanadha", "Trevor Strohman", "Catalin Ionescu", "Jincheng Luo", "Yogesh Kalley", "Jeremy Wiesner", "Dan Deutsch", "Derek Lockhart", "Peter Choy", "Rumen Dangovski", "Chawin Sitawarin", "Cat Graves", "Tanya Lando", "Joost van Amersfoort", "Ndidi Elue", "Zhouyuan Huo", "Pooya Moradi", "Jean Tarbouriech", "Henryk Michalewski", "Wenting Ye", "Eunyoung Kim", "Alex Druinsky", "Florent Altché", "Xinyi Chen", "Artur Dwornik", "Da-Cheng Juan", "Rivka Moroshko", "Horia Toma", "Jarrod Kahn", "Hai Qian", "Maximilian Sieb", "Irene Cai", "Roman Goldenberg", "Praneeth Netrapalli", "Sindhu Raghuram", "Yuan Gong", "Lijie Fan", "Evan Palmer", "Yossi Matias", "Valentin Gabeur", "Shreya Pathak", "Tom Ouyang", "Don Metzler", "Geoff Bacon", "Srinivasan Venkatachary", "Sridhar Thiagarajan", "Alex Cullum", "Eran Ofek", "Vytenis Sakenas", "Mohamed Hammad", "Cesar Magalhaes", "Mayank Daswani", "Oscar Chang", "Ashok Popat", "Ruichao Li", "Komal Jalan", "Yanhan Hou", "Josh Lipschultz", "Antoine He", "Wenhao Jia", "Pier Giuseppe Sessa", "Prateek Kolhar", "William Wong", "Sumeet Singh", "Lukas Haas", "Jay Whang", "Hanna Klimczak-Plucińska", "Georges Rotival", "Grace Chung", "Yiqing Hua", "Anfal Siddiqui", "Nicolas Serrano", "Dongkai Chen", "Billy Porter", "Libin Bai", "Keshav Shivam", "Sho Arora", "Partha Talukdar", "Tom Cobley", "Sangnie Bhardwaj", "Evgeny Gladchenko", "Simon Green", "Kelvin Guu", "Felix Fischer", "Xiao Wu", "Eric Wang", "Achintya Singhal", "Tatiana Matejovicova", "James Martens", "Hongji Li", "Roma Patel", "Elizabeth Kemp", "Jiaqi Pan", "Lily Wang", "Blake JianHang Chen", "Jean-Baptiste Alayrac", "Navneet Potti", "Erika Gemzer", "Eugene Ie", "Kay McKinney", "Takaaki Saeki", "Edward Chou", "Pascal Lamblin", "SQ Mah", "Zach Fisher", "Martin Chadwick", "Jon Stritar", "Obaid Sarvana", "Andrew Hogue", "Artem Shtefan", "Hadi Hashemi", "Yang Xu", "Jindong Gu", "Sharad Vikram", "Chung-Ching Chang", "Sabela Ramos", "Logan Kilpatrick", "Weijuan Xi", "Jenny Brennan", "Yinghao Sun", "Abhishek Jindal", "Ionel Gog", "Dawn Chen", "Felix Wu", "Jason Lee", "Sudhindra Kopalle", "Srinadh Bhojanapalli", "Oriol Vinyals", "Natan Potikha", "Burcu Karagol Ayan", "Yuan Yuan", "Michael Riley", "Piotr Stanczyk", "Sergey Kishchenko", "Bing Wang", "Dan Garrette", "Antoine Yang", "Vlad Feinberg", "CJ Carey", "Javad Azizi", "Viral Shah", "Erica Moreira", "Chongyang Shi", "Josh Feldman", "Elizabeth Salesky", "Thomas Lampe", "Aneesh Pappu", "Duhyeon Kim", "Jonas Adler", "Avi Caciularu", "Brian Walker", "Yunhan Xu", "Yochai Blau", "Dylan Scandinaro", "Terry Huang", "Sam El-Husseini", "Abhishek Sinha", "Lijie Ren", "Taylor Tobin", "Patrik Sundberg", "Tim Sohn", "Vikas Yadav", "Mimi Ly", "Emily Xue", "Jing Xiong", "Afzal Shama Soudagar", "Sneha Mondal", "Nikhil Khadke", "Qingchun Ren", "Ben Vargas", "Stan Bileschi", "Sarah Chakera", "Cindy Wang", "Boyu Wang", "Yoni Halpern", "Joe Jiang", "Vikas Sindhwani", "Petre Petrov", "Pranavaraj Ponnuramu", "Sanket Vaibhav Mehta", "Yu Watanabe", "Betty Chan", "Matheus Wisniewski", "Trang Pham", "Jingwei Zhang", "Conglong Li", "Dario de Cesare", "Art Khurshudov", "Alex Vasiloff", "Melissa Tan", "Zoe Ashwood", "Bobak Shahriari", "Maryam Majzoubi", "Garrett Tanzer", "Olga Kozlova", "Robin Alazard", "James Lee-Thorp", "Nguyet Minh Phu", "Isaac Tian", "Junwhan Ahn", "Andy Crawford", "Lauren Lax", "Yuan Shangguan", "Iftekhar Naim", "David Ross", "Oleksandr Ferludin", "Tongfei Guo", "Andrea Banino", "Hubert Soyer", "Xiaoen Ju", "Dominika Rogozińska", "Ishaan Malhi", "Marcella Valentine", "Daniel Balle", "Apoorv Kulshreshtha", "Maciej Kula", "Yiwen Song", "Sophia Austin", "John Schultz", "Roy Hirsch", "Arthur Douillard", "Apoorv Reddy", "Michael Fink", "Summer Yue", "Khyatti Gupta", "Adam Zhang", "Norman Rink", "Daniel McDuff", "Lei Meng", "András György", "Yasaman Razeghi", "Ricky Liang", "Kazuki Osawa", "Aviel Atias", "Matan Eyal", "Tyrone Hill", "Nikolai Grigorev", "Zhengdong Wang", "Nitish Kulkarni", "Rachel Soh", "Ivan Lobov", "Zachary Charles", "Sid Lall", "Kazuma Hashimoto", "Ido Kessler", "Victor Gomes", "Zelda Mariet", "Danny Driess", "Alessandro Agostini", "Canfer Akbulut", "Jingcao Hu", "Marissa Ikonomidis", "Emily Caveness", "Kartik Audhkhasi", "Saurabh Agrawal", "Ioana Bica", "Evan Senter", "Jayaram Mudigonda", "Kelly Chen", "Jingchen Ye", "Xuanhui Wang", "James Svensson", "Philipp Fränken", "Josh Newlan", "Li Lao", "Eva Schnider", "Sami Alabed", "Joseph Kready", "Jesse Emond", "Afief Halumi", "Tim Zaman", "Chengxi Ye", "Naina Raisinghani", "Vilobh Meshram", "Bo Chang", "Ankit Singh Rawat", "Axel Stjerngren", "Sergey Levi", "Rui Wang", "Xiangzhu Long", "Mitchelle Rasquinha", "Steven Hand", "Aditi Mavalankar", "Lauren Agubuzu", "Sudeshna Roy", "Junquan Chen", "Jarek Wilkiewicz", "Hao Zhou", "Michal Jastrzebski", "Qiong Hu", "Agustin Dal Lago", "Ramya Sree Boppana", "Wei-Jen Ko", "Jennifer Prendki", "Yao Su", "Zhi Li", "Eliza Rutherford", "Girish Ramchandra Rao", "Ramona Comanescu", "Adrià Puigdomènech", "Qihang Chen", "Dessie Petrova", "Christine Chan", "Vedrana Milutinovic", "Felipe Tiengo Ferreira", "Chin-Yi Cheng", "Ming Zhang", "Tapomay Dey", "Sherry Yang", "Ramesh Sampath", "Quoc Le", "Howard Zhou", "Chu-Cheng Lin", "Hoi Lam", "Christine Kaeser-Chen", "Kai Hui", "Dean Hirsch", "Tom Eccles", "Basil Mustafa", "Shruti Rijhwani", "Morgane Rivière", "Yuanzhong Xu", "Junjie Wang", "Xinyang Geng", "Xiance Si", "Arjun Khare", "Cheolmin Kim", "Vahab Mirrokni", "Kamyu Lee", "Khuslen Baatarsukh", "Nathaniel Braun", "Lisa Wang", "Pallavi LV", "Richard Tanburn", "Yonghao Zhu", "Fangda Li", "Setareh Ariafar", "Dan Goldberg", "Ken Burke", "Daniil Mirylenka", "Meiqi Guo", "Olaf Ronneberger", "Hadas Natalie Vogel", "Liqun Cheng", "Nishita Shetty", "Johnson Jia", "Thomas Jimma", "Corey Fry", "Ted Xiao", "Martin Sundermeyer", "Ryan Burnell", "Yannis Assael", "Mario Pinto", "JD Chen", "Rohit Sathyanarayana", "Donghyun Cho", "Jing Lu", "Rishabh Agarwal", "Sugato Basu", "Lucas Gonzalez", "Dhruv Shah", "Meng Wei", "Dre Mahaarachchi", "Rohan Agrawal", "Tero Rissa", "Yani Donchev", "Ramiro Leal-Cavazos", "Adrian Hutter", "Markus Mircea", "Alon Jacovi", "Faruk Ahmed", "Jiageng Zhang", "Shuguang Hu", "Bo-Juen Chen", "Jonni Kanerva", "Guillaume Desjardins", "Andrew Lee", "Nikos Parotsidis", "Asier Mujika", "Tobias Weyand", "Jasper Snoek", "Jo Chick", "Kai Chen", "Paul Chang", "Ethan Mahintorabi", "Zi Wang", "Tolly Powell", "Orgad Keller", "Abhirut Gupta", "Claire Sha", "Kanav Garg", "Nicolas Heess", "Ágoston Weisz", "Cassidy Hardin", "Bartek Wydrowski", "Ben Coleman", "Karina Zainullina", "Pankaj Joshi", "Alessandro Epasto", "Terry Spitz", "Binbin Xiong", "Kai Zhao", "Arseniy Klimovskiy", "Ivy Zheng", "Johan Ferret", "Itay Yona", "Waleed Khawaja", "Jean-Baptiste Lespiau", "Maxim Krikun", "Siamak Shakeri", "Timothee Cour", "Bonnie Li", "Igor Krivokon", "Dan Suh", "Alex Hofer", "Jad Al Abdallah", "Nikita Putikhin", "Oscar Akerlund", "Silvio Lattanzi", "Anurag Kumar", "Shane Settle", "Himanshu Srivastava", "Folawiyo Campbell-Ajala", "Edouard Rosseel", "Mihai Dorin Istin", "Nishanth Dikkala", "Anand Rao", "Nick Young", "Kate Lin", "Dhruva Bhaswar", "Yiming Wang", "Jaume Sanchez Elias", "Kritika Muralidharan", "James Keeling", "Dayou Du", "Siddharth Gopal", "Gregory Dibb", "Charles Blundell", "Manolis Delakis", "Jacky Liang", "Marco Tulio Ribeiro", "Georgi Karadzhov", "Guillermo Garrido", "Ankur Bapna", "Jiawei Cao", "Adam Sadovsky", "Pouya Tafti", "Arthur Guez", "Coline Devin", "Yixian Di", "Jinwei Xing", "Chuqiao Joyce Xu", "Hanzhao Lin", "Chun-Te Chu", "Sameera Ponda", "Wesley Helmholz", "Fan Yang", "Yue Gao", "Sara Javanmardi", "Wael Farhan", "Alex Ramirez", "Ricardo Figueira", "Khe Chai Sim", "Yuval Bahat", "Ashwin Vaswani", "Liangzhe Yuan", "Gufeng Zhang", "Leland Rechis", "Hanjun Dai", "Tayo Oguntebi", "Alexandra Cordell", "Eugénie Rives", "Kaan Tekelioglu", "Naveen Kumar", "Bing Zhang", "Aurick Zhou", "Nikolay Savinov", "Andrew Leach", "Alex Tudor", "Sanjay Ganapathy", "Yanyan Zheng", "Mirko Rossini", "Vera Axelrod", "Arnaud Autef", "Yukun Zhu", "Zheng Zheng", "Mingda Zhang", "Baochen Sun", "Jie Ren", "Nenad Tomasev", "Nithish Kannen", "Amer Sinha", "Charles Chen", "Louis O'Bryan", "Alex Pak", "Aditya Kusupati", "Weel Yang", "Deepak Ramachandran", "Patrick Griffin", "Seokhwan Kim", "Philipp Neubeck", "Craig Schiff", "Tammo Spalink", "Mingyang Ling", "Arun Nair", "Ga-Young Joung", "Linda Deng", "Avishkar Bhoopchand", "Lora Aroyo", "Tom Duerig", "Jordan Griffith", "Gabe Barth-Maron", "Jake Ades", "Alex Haig", "Ankur Taly", "Yunting Song", "Paul Michel", "Dave Orr", "Dean Weesner", "Corentin Tallec", "Carrie Grimes Bostock", "Paul Niemczyk", "Andy Twigg", "Mudit Verma", "Rohith Vallu", "Henry Wang", "Marco Gelmi", "Kiranbir Sodhia", "Aleksandr Chuklin", "Omer Goldman", "Jasmine George", "Liang Bai", "Kelvin Zhang", "Petar Sirkovic", "Efrat Nehoran", "Golan Pundak", "Jiaqi Mu", "Alice Chen", "Alex Greve", "Paulo Zacchello", "David Amos", "Heming Ge", "Eric Noland", "Colton Bishop", "Jeffrey Dudek", "Youhei Namiki", "Elena Buchatskaya", "Jing Li", "Dorsa Sadigh", "Masha Samsikova", "Dan Malkin", "Damien Vincent", "Robert David", "Rob Willoughby", "Phoenix Meadowlark", "Shawn Gao", "Yan Li", "Raj Apte", "Amit Jhindal", "Stein Xudong Lin", "Alex Polozov", "Zhicheng Wang", "Tomas Mery", "Anirudh GP", "Varun Yerram", "Sage Stevens", "Tianqi Liu", "Noah Fiedel", "Charles Sutton", "Matthew Johnson", "Xiaodan Song", "Kate Baumli", "Nir Shabat", "Muqthar Mohammad", "Hao Liu", "Marco Selvi", "Yichao Zhou", "Mehdi Hafezi Manshadi", "Chu-ling Ko", "Anthony Chen", "Michael Bendersky", "Jorge Gonzalez Mendez", "Nisarg Kothari", "Amir Zandieh", "Yiling Huang", "Daniel Andor", "Ellie Pavlick", "Idan Brusilovsky", "Jitendra Harlalka", "Sally Goldman", "Andrew Lampinen", "Guowang Li", "Asahi Ushio", "Somit Gupta", "Lei Zhang", "Chuyuan Kelly Fu", "Madhavi Sewak", "Timo Denk", "Jed Borovik", "Brendan Jou", "Avital Zipori", "Prateek Jain", "Junwen Bai", "Thang Luong", "Jonathan Tompson", "Alice Li", "Li Liu", "George Powell", "Jiajun Shen", "Alex Feng", "Grishma Chole", "Da Yu", "Yinlam Chow", "Tongxin Yin", "Eric Malmi", "Kefan Xiao", "Yash Pande", "Shachi Paul", "Niccolò Dal Santo", "Adil Dostmohamed", "Sergio Guadarrama", "Aaron Phillips", "Thanumalayan Sankaranarayana Pillai", "Gal Yona", "Amin Ghafouri", "Preethi Lahoti", "Benjamin Lee", "Dhruv Madeka", "Eren Sezener", "Simon Tokumine", "Adrian Collister", "Nicola De Cao", "Richard Shin", "Uday Kalra", "Parker Beak", "Emily Nottage", "Ryo Nakashima", "Ivan Jurin", "Vikash Sehwag", "Meenu Gaba", "Junhao Zeng", "Kevin R. McKee", "Fernando Pereira", "Tamar Yakar", "Amayika Panda", "Arka Dhar", "Peilin Zhong", "Daniel Sohn", "Mark Brand", "Lars Lowe Sjoesund", "Viral Carpenter", "Sharon Lin", "Shantanu Thakoor", "Marcus Wainwright", "Ashwin Chaugule", "Pranesh Srinivasan", "Muye Zhu", "Bernett Orlando", "Jack Weber", "Ayzaan Wahid", "Gilles Baechler", "Apurv Suman", "Jovana Mitrović", "Gabe Taubman", "Honglin Yu", "Helen King", "Josh Dillon", "Cathy Yip", "Dhriti Varma", "Tomas Izo", "Levent Bolelli", "Borja De Balle Pigem", "Julia Di Trapani", "Fotis Iliopoulos", "Adam Paszke", "Nishant Ranka", "Joe Zou", "Francesco Pongetti", "Jed McGiffin", "Alex Siegman", "Rich Galt", "Ross Hemsley", "Goran Žužić", "Victor Carbune", "Tao Li", "Myle Ott", "Félix de Chaumont Quitry", "David Vilar Torres", "Yuri Chervonyi", "Tomy Tsai", "Prem Eruvbetine", "Samuel Yang", "Matthew Denton", "Jake Walker", "Slavica Andačić", "Idan Heimlich Shtacher", "Vittal Premachandran", "Harshal Tushar Lehri", "Cip Baetu", "Damion Yates", "Lampros Lamprou", "Mariko Iinuma", "Ioana Mihailescu", "Ben Albrecht", "Shachi Dave", "Susie Sargsyan", "Bryan Perozzi", "Lucas Manning", "Chiyuan Zhang", "Denis Vnukov", "Igor Mordatch", "Raia Hadsell Wolfgang Macherey", "Ryan Kappedal", "Jim Stephan", "Aditya Tripathi", "Klaus Macherey", "Jun Qian", "Abhishek Bhowmick", "Shekoofeh Azizi", "Rémi Leblond", "Shiva Mohan Reddy Garlapati", "Timothy Knight", "Matthew Wiethoff", "Wei-Chih Hung", "Anelia Angelova", "Georgios Evangelopoulos", "Pawel Janus", "Dimitris Paparas", "Matthew Rahtz", "Ken Caluwaerts", "Vivek Sampathkumar", "Daniel Jarrett", "Shadi Noghabi", "Antoine Miech", "Chak Yeung", "Geoff Clark", "Henry Prior", "Fei Zheng", "Jean Pouget-Abadie", "Indro Bhattacharya", "Kalpesh Krishna", "Will Bishop", "Zhe Yuan", "Yunxiao Deng", "Ashutosh Sathe", "Kacper Krasowiak", "Ciprian Chelba", "Cho-Jui Hsieh", "Kiran Vodrahalli", "Buhuang Liu", "Thomas Köppe", "Amr Khalifa", "Lubo Litchev", "Pichi Charoenpanit", "Reed Roberts", "Sachin Yadav", "Yasumasa Onoe", "Desi Ivanov", "Megha Mohabey", "Vighnesh Birodkar", "Nemanja Rakićević", "Pierre Sermanet", "Vaibhav Mehta", "Krishan Subudhi", "Travis Choma", "Will Ng", "Luheng He", "Kathie Wang", "Tasos Kementsietsidis", "Shane Gu", "Mansi Gupta", "Andrew Nystrom", "Mehran Kazemi", "Timothy Chung", "Nacho Cano", "Nikhil Dhawan", "Yufei Wang", "Jiawei Xia", "Trevor Yacovone", "Eric Jia", "Mingqing Chen", "Simeon Ivanov", "Ashrith Sheshan", "Sid Dalmia", "Paweł Stradomski", "Pengcheng Yin", "Salem Haykal", "Congchao Wang", "Dennis Duan", "Neslihan Bulut", "Greg Kochanski", "Liam MacDermed", "Namrata Godbole", "Shitao Weng", "Jingjing Chen", "Rachana Fellinger", "Ramin Mehran", "Daniel Suo", "Hisham Husain", "Tong He", "Kaushal Patel", "Joshua Howland", "Randall Parker", "Kelvin Nguyen", "Sharath Maddineni", "Chris Rawles", "Mina Khan", "Shlomi Cohen-Ganor", "Amol Mandhane", "Xinyi Wu", "Chenkai Kuang", "Iulia Comşa", "Ramya Ganeshan", "Hanie Sedghi", "Adam Bloniarz", "Nuo Wang Pierse", "Anton Briukhov", "Petr Mitrichev", "Anita Gergely", "Serena Zhan", "Allan Zhou", "Nikita Saxena", "Eva Lu", "Josef Dean", "Ashish Gupta", "Nicolas Perez-Nieves", "Renjie Wu", "Cory McLean", "Wei Liang", "Disha Jindal", "Anton Tsitsulin", "Wenhao Yu", "Kaiz Alarakyia", "Tom Schaul", "Piyush Patil", "Peter Sung", "Elijah Peake", "Hongkun Yu", "Feryal Behbahani", "JD Co-Reyes", "Alan Ansell", "Sean Sun", "Clara Barbu", "Jonathan Lee", "Seb Noury", "James Allingham", "Bilal Piot", "Mohit Sharma", "Christopher Yew", "Ivan Korotkov", "Bibo Xu", "Demetra Brady", "Goran Petrovic", "Shibl Mourad", "Claire Cui", "Aditya Gupta", "Parker Schuh", "Saarthak Khanna", "Anna Goldie", "Abhinav Arora", "Vadim Zubov", "Amy Stuart", "Mark Epstein", "Yun Zhu", "Jianqiao Liu", "Yury Stuken", "Ziyue Wang", "Karolis Misiunas", "Dee Guo", "Ashleah Gill", "Ale Hartman", "Zaid Nabulsi", "Aurko Roy", "Aleksandra Faust", "Jason Riesa", "Ben Withbroe", "Mengchao Wang", "Marco Tagliasacchi", "Andreea Marzoca", "James Noraky", "Serge Toropov", "Malika Mehrotra", "Bahram Raad", "Sanja Deur", "Steve Xu", "Marianne Monteiro", "Zhongru Wu", "Yi Luan", "Sam Ritter", "Nick Li", "Håvard Garnes", "Yanzhang He", "Martin Zlocha", "Jifan Zhu", "Matteo Hessel", "Will Wu", "Spandana Raj Babbula", "Chizu Kawamoto", "Yuanzhen Li", "Mehadi Hassen", "Yan Wang", "Brian Wieder", "James Freedman", "Yin Zhang", "Xinyi Bai", "Tianli Yu", "David Reitter", "XiangHai Sheng", "Mateo Wirth", "Aditya Kini", "Dima Damen", "Mingcen Gao", "Rachel Hornung", "Michael Voznesensky", "Brian Roark", "Adhi Kuncoro", "Yuxiang Zhou", "Rushin Shah", "Anthony Brohan", "Kuangyuan Chen", "James Wendt", "David Rim", "Paul Kishan Rubenstein", "Jonathan Halcrow", "Michelle Liu", "Ty Geri", "Yunhsuan Sung", "Jane Shapiro", "Shaan Bijwadia", "Chris Duvarney", "Christina Sorokin", "Paul Natsev", "Reeve Ingle", "Pramod Gupta", "Young Maeng", "Ndaba Ndebele", "Kexin Zhu", "Valentin Anklin", "Katherine Lee", "Yuan Liu", "Yaroslav Akulov", "Shaleen Gupta", "Guolong Su", "Flavien Prost", "Tianlin Liu", "Vitaly Kovalev", "Pol Moreno", "Martin Scholz", "Sam Redmond", "Zongwei Zhou", "Alex Castro-Ros", "André Susano Pinto", "Dia Kharrat", "Michal Yarom", "Rachel Saputro", "Jannis Bulian", "Ben Caine", "Ji Liu", "Abbas Abdolmaleki", "Shariq Iqbal", "Tautvydas Misiunas", "Mikhail Sirotenko", "Shefali Garg", "Guy Bensky", "Huan Gui", "Xuezhi Wang", "Raphael Koster", "Mike Bernico", "Da Huang", "Romal Thoppilan", "Trevor Cohn", "Ben Golan", "Wenlei Zhou", "Andrew Rosenberg", "Markus Freitag", "Tynan Gangwani", "Vincent Tsang", "Anand Shukla", "Xiaoqi Ren", "Minh Giang", "Chi Zou", "Andre Elisseeff", "Charline Le Lan", "Dheeru Dua", "Shuba Lall", "Pranav Shyam", "Frankie Garcia", "Sarah Nguyen", "Michael Guzman", "AJ Maschinot", "Marcello Maggioni", "Ming-Wei Chang", "Karol Gregor", "Lotte Weerts", "Kumaran Venkatesan", "Bogdan Damoc", "Leon Liu", "Jan Wassenberg", "Lewis Ho", "Becca Roelofs", "Majid Hadian", "François-Xavier Aubet", "Yu Liang", "Sami Lachgar", "Danny Karmon", "Yong Cheng", "Amelio Vázquez-Reina", "Angie Chen", "Zhuyun Dai", "Andy Brock", "Shubham Agrawal", "Chenxi Pang", "Peter Garst", "Mariella Sanchez-Vargas", "Ivor Rendulic", "Aditya Ayyar", "Andrija Ražnatović", "Olivia Ma", "Roopali Vij", "Neha Sharma", "Ashwin Balakrishna", "Bingyuan Liu", "Ian Mackinnon", "Sorin Baltateanu", "Petra Poklukar", "Gabriel Ibagon", "Colin Ji", "Hongyang Jiao", "Isaac Noble", "Wojciech Stokowiec", "Zhihao Li", "Jeff Dean", "David Lindner", "Mark Omernick", "Kristen Chiafullo", "Mason Dimarco", "Vitor Rodrigues", "Vittorio Selo", "Garrett Honke", "Xintian Cindy Wu", "Wei He", "Adam Hillier", "Anhad Mohananey", "Vihari Piratla", "Chang Ye", "Chase Malik", "Sebastian Riedel", "Samuel Albanie", "Zi Yang", "Kenny Vassigh", "Maria Bauza", "Sheng Li", "Yiqing Tao", "Nevan Wichers", "Andrii Maksai", "Abe Ittycheriah", "Ross Mcilroy", "Bryan Seybold", "Noah Goodman", "Romina Datta", "Steven M. Hernandez", "Tian Shi", "Yony Kochinski", "Anna Bulanova", "Ken Franko", "Mikita Sazanovich", "Nicholas FitzGerald", "Praneeth Kacham", "Shubha Srinivas Raghvendra", "Vincent Hellendoorn", "Alexander Grushetsky", "Julian Salazar", "Angeliki Lazaridou", "Jason Chang", "Jan-Thorsten Peter", "Sushant Kafle", "Yann Dauphin", "Abhishek Rao", "Filippo Graziano", "Izhak Shafran", "Yuguo Liao", "Tianli Ding", "Geng Yan", "Grace Chu", "Zhao Fu", "Vincent Roulet", "Gabriel Rasskin", "Duncan Williams", "Shahar Drath", "Alex Mossin", "Raphael Hoffmann", "Jordi Orbay", "Francesco Bertolini", "Hila Sheftel", "Justin Chiu", "Siyang Xue", "Yuheng Kuang", "Ferjad Naeem", "Swaroop Nath", "Nana Nti", "Phil Culliton", "Kashyap Krishnakumar", "Michael Isard", "Pei Sun", "Ayan Chakrabarti", "Nathan Clement", "Regev Cohen", "Arissa Wongpanich", "GS Oh", "Ashwin Murthy", "Hao Zheng", "Jessica Hamrick", "Oskar Bunyan", "Suhas Ganesh", "Nitish Gupta", "Roy Frostig", "John Wieting", "Yury Malkov", "Pierre Marcenac", "Zhixin Lucas Lai", "Xiaodan Tang", "Mohammad Saleh", "Fedir Zubach", "Chinmay Kulkarni", "Huanjie Zhou", "Vicky Zayats", "Nan Ding", "Anshuman Tripathi", "Arijit Pramanik", "Patrik Zochbauer", "Harish Ganapathy", "Vedant Misra", "Zach Behrman", "Hugo Vallet", "Mingyang Zhang", "Mukund Sridhar", "Ye Jin", "Mohammad Babaeizadeh", "Siim Põder", "Megha Goel", "Divya Jain", "Tajwar Nasir", "Shubham Mittal", "Tim Dozat", "Diego Ardila", "Aliaksei Severyn", "Fabio Pardo", "Sammy Jerome", "Siyang Qin", "Louis Rouillard", "Amir Yazdanbakhsh", "Zizhao Zhang", "Shivani Agrawal", "Kaushik Shivakumar", "Caden Lu", "Praveen Kallakuri", "Rachita Chhaparia", "Kanishka Rao", "Charles Kwong", "Asya Fadeeva", "Shitij Nigam", "Yan Virin", "Yuan Zhang", "Balaji Venkatraman", "Beliz Gunel", "Marc Wilson", "Huiyu Wang", "Abhinav Gupta", "Xiaowei Xu", "Adrien Ali Taïga", "Kareem Mohamed", "Doug Fritz", "Daniel Rodriguez", "Zoubin Ghahramani", "Harry Askham", "Lior Belenki", "James Zhao", "Rahul Gupta", "Krzysztof Jastrzębski", "Takahiro Kosakai", "Kaan Katircioglu", "Jon Schneider", "Rina Panigrahy", "Konstantinos Bousmalis", "Peter Grabowski", "Prajit Ramachandran", "Chaitra Hegde", "Mihaela Rosca", "Angelo Scorza Scarpati", "Kyriakos Axiotis", "Ying Xu", "Zach Gleicher", "Assaf Hurwitz Michaely", "Mandar Sharma", "Sanil Jain", "Christoph Hirnschall", "Tal Marian", "Xuhui Jia", "Kevin Mather", "Kilol Gupta", "Linhai Qiu", "Nigamaa Nayakanti", "Lucian Ionita", "Steven Zheng", "Lucia Loher", "Kurt Shuster", "Igor Petrovski", "Roshan Sharma", "Rahma Chaabouni", "Angel Yeh", "James An", "Arushi Gupta", "Steven Schwarcz", "Seher Ellis", "Sam Conway-Rahman", "Javier Snaider", "Alex Zhai", "James Atwood", "Daniel Golovin", "Liqian Peng", "Te I", "Vivian Xia", "Salvatore Scellato", "Mahan Malihi", "Arthur Bražinskas", "Vlad-Doru Ion", "Younghoon Jun", "James Swirhun", "Soroosh Mariooryad", "Jiao Sun", "Steve Chien", "Rey Coaguila", "Ariel Brand", "Yi Gao", "Tom Kwiatkowski", "Roee Aharoni", "Cheng-Chun Lee", "Mislav Žanić", "Yichi Zhang", "Dan Ethier", "Vitaly Nikolaev", "Pranav Nair", "Yoav Ben Shalom", "Hen Fitoussi", "Jai Gupta", "Hongbin Liu", "Dee Cattle", "Tolga Bolukbasi", "Ben Murdoch", "Fantine Huot", "Yin Li", "Chris Hahn"], "categories": ["cs.CL", "cs.AI"], "comment": "72 pages, 17 figures", "summary": "In this report, we introduce the Gemini 2.X model family: Gemini 2.5 Pro and\nGemini 2.5 Flash, as well as our earlier Gemini 2.0 Flash and Flash-Lite\nmodels. Gemini 2.5 Pro is our most capable model yet, achieving SoTA\nperformance on frontier coding and reasoning benchmarks. In addition to its\nincredible coding and reasoning skills, Gemini 2.5 Pro is a thinking model that\nexcels at multimodal understanding and it is now able to process up to 3 hours\nof video content. Its unique combination of long context, multimodal and\nreasoning capabilities can be combined to unlock new agentic workflows. Gemini\n2.5 Flash provides excellent reasoning abilities at a fraction of the compute\nand latency requirements and Gemini 2.0 Flash and Flash-Lite provide high\nperformance at low latency and cost. Taken together, the Gemini 2.X model\ngeneration spans the full Pareto frontier of model capability vs cost, allowing\nusers to explore the boundaries of what is possible with complex agentic\nproblem solving."}
{"id": "2507.06565", "pdf": "https://arxiv.org/pdf/2507.06565.pdf", "abs": "https://arxiv.org/abs/2507.06565", "title": "The Flaws of Others: An LLM-driven Framework for Scientific Knowledge Production", "authors": ["Juan B. Gutiérrez"], "categories": ["cs.CL", "cs.LG", "68T01, 60J10, 91D30, 05C82, 68T50, 68W20, 94A15", "I.2.7; I.2.11; G.3"], "comment": "27 pages, 3 figures, 4 tables, 1 algorithm, 48 references", "summary": "Large-language models turn writing into a live exchange between humans and\nsoftware. We capture this new medium with a discursive-network model that\ntreats people and LLMs as equal nodes and tracks how their statements\ncirculate. Broadening the focus from isolated hallucinations, we define\ninvalidation (any factual, logical, or structural breach) and show it follows\nfour hazards: drift from truth, self-repair, fresh fabrication, and external\ndetection. A general mathematical model of discursive networks is developed to\nprovide valuable insights: A network governed only by drift and self-repair\nstabilizes at a modest error rate; adding fabrication reproduces the high rates\nseen in current LLMs. Giving each false claim even a small chance of peer\nreview shifts the system to a truth-dominant state. We operationalize peer\nreview with the open-source \\emph{Flaws-of-Others (FOO) algorithm}: a\nconfigurable loop in which any set of agents critique one another while a\nharmoniser merges their verdicts. The takeaway is practical and cultural:\nreliability in this new medium comes not from perfecting single models but from\nwiring imperfect ones into networks that keep each other honest."}
{"id": "2507.07248", "pdf": "https://arxiv.org/pdf/2507.07248.pdf", "abs": "https://arxiv.org/abs/2507.07248", "title": "Medical Red Teaming Protocol of Language Models: On the Importance of User Perspectives in Healthcare Settings", "authors": ["Jean-Philippe Corbeil", "Minseon Kim", "Alessandro Sordoni", "Francois Beaulieu", "Paul Vozila"], "categories": ["cs.CL"], "comment": null, "summary": "As the performance of large language models (LLMs) continues to advance,\ntheir adoption is expanding across a wide range of domains, including the\nmedical field. The integration of LLMs into medical applications raises\ncritical safety concerns, particularly due to their use by users with diverse\nroles, e.g. patients and clinicians, and the potential for model's outputs to\ndirectly affect human health. Despite the domain-specific capabilities of\nmedical LLMs, prior safety evaluations have largely focused only on general\nsafety benchmarks. In this paper, we introduce a safety evaluation protocol\ntailored to the medical domain in both patient user and clinician user\nperspectives, alongside general safety assessments and quantitatively analyze\nthe safety of medical LLMs. We bridge a gap in the literature by building the\nPatientSafetyBench containing 466 samples over 5 critical categories to measure\nsafety from the perspective of the patient. We apply our red-teaming protocols\non the MediPhi model collection as a case study. To our knowledge, this is the\nfirst work to define safety evaluation criteria for medical LLMs through\ntargeted red-teaming taking three different points of view - patient,\nclinician, and general user - establishing a foundation for safer deployment in\nmedical domains."}
{"id": "2507.07505", "pdf": "https://arxiv.org/pdf/2507.07505.pdf", "abs": "https://arxiv.org/abs/2507.07505", "title": "Hallucination Stations: On Some Basic Limitations of Transformer-Based Language Models", "authors": ["Varin Sikka", "Vishal Sikka"], "categories": ["cs.CL", "cs.AI"], "comment": "6 pages; to be submitted to AAAI-26 after reviews", "summary": "With widespread adoption of transformer-based language models in AI, there is\nsignificant interest in the limits of LLMs capabilities, specifically so-called\nhallucinations, occurrences in which LLMs provide spurious, factually incorrect\nor nonsensical information when prompted on certain subjects. Furthermore,\nthere is growing interest in agentic uses of LLMs - that is, using LLMs to\ncreate agents that act autonomously or semi-autonomously to carry out various\ntasks, including tasks with applications in the real world. This makes it\nimportant to understand the types of tasks LLMs can and cannot perform. We\nexplore this topic from the perspective of the computational complexity of LLM\ninference. We show that LLMs are incapable of carrying out computational and\nagentic tasks beyond a certain complexity, and further that LLMs are incapable\nof verifying the accuracy of tasks beyond a certain complexity. We present\nexamples of both, then discuss some consequences of this work."}
{"id": "2402.08830", "pdf": "https://arxiv.org/pdf/2402.08830.pdf", "abs": "https://arxiv.org/abs/2402.08830", "title": "Sequence graphs realizations and ambiguity in language models", "authors": ["Sammy Khalife", "Yann Ponty", "Laurent Bulteau"], "categories": ["cs.DS", "cs.CC", "cs.CL"], "comment": null, "summary": "Several popular language models represent local contexts in an input text $x$\nas bags of words. Such representations are naturally encoded by a sequence\ngraph whose vertices are the distinct words occurring in $x$, with edges\nrepresenting the (ordered) co-occurrence of two words within a sliding window\nof size $w$. However, this compressed representation is not generally\nbijective: some may be ambiguous, admitting several realizations as a sequence,\nwhile others may not admit any realization. In this paper, we study the\nrealizability and ambiguity of sequence graphs from a combinatorial and\nalgorithmic point of view. We consider the existence and enumeration of\nrealizations of a sequence graph under multiple settings: window size $w$,\npresence/absence of graph orientation, and presence/absence of weights\n(multiplicities). When $w=2$, we provide polynomial time algorithms for\nrealizability and enumeration in all cases except the undirected/weighted\nsetting, where we show the $\\#$P-hardness of enumeration. For $w \\ge 3$, we\nprove the hardness of all variants, even when $w$ is considered as a constant,\nwith the notable exception of the undirected unweighted case for which we\npropose XP algorithms for both problems, tight due to a corresponding\n$W[1]-$hardness result. We conclude with an integer program formulation to\nsolve the realizability problem, and a dynamic programming algorithm to solve\nthe enumeration problem in instances of moderate sizes. This work leaves open\nthe membership to NP of both problems, a non-trivial question due to the\nexistence of minimum realizations having size exponential on the instance\nencoding."}
{"id": "2408.08054", "pdf": "https://arxiv.org/pdf/2408.08054.pdf", "abs": "https://arxiv.org/abs/2408.08054", "title": "Text2BIM: Generating Building Models Using a Large Language Model-based Multi-Agent Framework", "authors": ["Changyu Du", "Sebastian Esser", "Stavros Nousias", "André Borrmann"], "categories": ["cs.AI", "cs.CL", "cs.SE"], "comment": "Journal of Computing in Civil Engineering", "summary": "The conventional BIM authoring process typically requires designers to master\ncomplex and tedious modeling commands in order to materialize their design\nintentions within BIM authoring tools. This additional cognitive burden\ncomplicates the design process and hinders the adoption of BIM and model-based\ndesign in the AEC (Architecture, Engineering, and Construction) industry. To\nfacilitate the expression of design intentions more intuitively, we propose\nText2BIM, an LLM-based multi-agent framework that can generate 3D building\nmodels from natural language instructions. This framework orchestrates multiple\nLLM agents to collaborate and reason, transforming textual user input into\nimperative code that invokes the BIM authoring tool's APIs, thereby generating\neditable BIM models with internal layouts, external envelopes, and semantic\ninformation directly in the software. Furthermore, a rule-based model checker\nis introduced into the agentic workflow, utilizing predefined domain knowledge\nto guide the LLM agents in resolving issues within the generated models and\niteratively improving model quality. Extensive experiments were conducted to\ncompare and analyze the performance of three different LLMs under the proposed\nframework. The evaluation results demonstrate that our approach can effectively\ngenerate high-quality, structurally rational building models that are aligned\nwith the abstract concepts specified by user input. Finally, an interactive\nsoftware prototype was developed to integrate the framework into the BIM\nauthoring software Vectorworks, showcasing the potential of modeling by\nchatting. The code is available at: https://github.com/dcy0577/Text2BIM"}
{"id": "2411.11767", "pdf": "https://arxiv.org/pdf/2411.11767.pdf", "abs": "https://arxiv.org/abs/2411.11767", "title": "Drowning in Documents: Consequences of Scaling Reranker Inference", "authors": ["Mathew Jacob", "Erik Lindgren", "Matei Zaharia", "Michael Carbin", "Omar Khattab", "Andrew Drozdov"], "categories": ["cs.IR", "cs.CL", "cs.LG"], "comment": "Accepted to ReNeuIR 2025 Workshop at SIGIR 2025 Conference", "summary": "Rerankers, typically cross-encoders, are computationally intensive but are\nfrequently used because they are widely assumed to outperform cheaper initial\nIR systems. We challenge this assumption by measuring reranker performance for\nfull retrieval, not just re-scoring first-stage retrieval. To provide a more\nrobust evaluation, we prioritize strong first-stage retrieval using modern\ndense embeddings and test rerankers on a variety of carefully chosen,\nchallenging tasks, including internally curated datasets to avoid\ncontamination, and out-of-domain ones. Our empirical results reveal a\nsurprising trend: the best existing rerankers provide initial improvements when\nscoring progressively more documents, but their effectiveness gradually\ndeclines and can even degrade quality beyond a certain limit. We hope that our\nfindings will spur future research to improve reranking."}
{"id": "2503.01163", "pdf": "https://arxiv.org/pdf/2503.01163.pdf", "abs": "https://arxiv.org/abs/2503.01163", "title": "Bandit-Based Prompt Design Strategy Selection Improves Prompt Optimizers", "authors": ["Rin Ashizawa", "Yoichi Hirose", "Nozomu Yoshinari", "Kento Uchida", "Shinichi Shirakawa"], "categories": ["cs.AI", "cs.CL", "cs.HC", "cs.LG", "cs.NE"], "comment": "Accepted to ACL 2025 Findings", "summary": "Prompt optimization aims to search for effective prompts that enhance the\nperformance of large language models (LLMs). Although existing prompt\noptimization methods have discovered effective prompts, they often differ from\nsophisticated prompts carefully designed by human experts. Prompt design\nstrategies, representing best practices for improving prompt performance, can\nbe key to improving prompt optimization. Recently, a method termed the\nAutonomous Prompt Engineering Toolbox (APET) has incorporated various prompt\ndesign strategies into the prompt optimization process. In APET, the LLM is\nneeded to implicitly select and apply the appropriate strategies because prompt\ndesign strategies can have negative effects. This implicit selection may be\nsuboptimal due to the limited optimization capabilities of LLMs. This paper\nintroduces Optimizing Prompts with sTrategy Selection (OPTS), which implements\nexplicit selection mechanisms for prompt design. We propose three mechanisms,\nincluding a Thompson sampling-based approach, and integrate them into\nEvoPrompt, a well-known prompt optimizer. Experiments optimizing prompts for\ntwo LLMs, Llama-3-8B-Instruct and GPT-4o mini, were conducted using BIG-Bench\nHard. Our results show that the selection of prompt design strategies improves\nthe performance of EvoPrompt, and the Thompson sampling-based mechanism\nachieves the best overall results. Our experimental code is provided at\nhttps://github.com/shiralab/OPTS ."}
{"id": "2504.01403", "pdf": "https://arxiv.org/pdf/2504.01403.pdf", "abs": "https://arxiv.org/abs/2504.01403", "title": "Generative Retrieval and Alignment Model: A New Paradigm for E-commerce Retrieval", "authors": ["Ming Pang", "Chunyuan Yuan", "Xiaoyu He", "Zheng Fang", "Donghao Xie", "Fanyi Qu", "Xue Jiang", "Changping Peng", "Zhangang Lin", "Ching Law", "Jingping Shao"], "categories": ["cs.IR", "cs.AI", "cs.CL"], "comment": "Accepted by WWW2025", "summary": "Traditional sparse and dense retrieval methods struggle to leverage general\nworld knowledge and often fail to capture the nuanced features of queries and\nproducts. With the advent of large language models (LLMs), industrial search\nsystems have started to employ LLMs to generate identifiers for product\nretrieval. Commonly used identifiers include (1) static/semantic IDs and (2)\nproduct term sets. The first approach requires creating a product ID system\nfrom scratch, missing out on the world knowledge embedded within LLMs. While\nthe second approach leverages this general knowledge, the significant\ndifference in word distribution between queries and products means that\nproduct-based identifiers often do not align well with user search queries,\nleading to missed product recalls. Furthermore, when queries contain numerous\nattributes, these algorithms generate a large number of identifiers, making it\ndifficult to assess their quality, which results in low overall recall\nefficiency.\n  To address these challenges, this paper introduces a novel e-commerce\nretrieval paradigm: the Generative Retrieval and Alignment Model (GRAM). GRAM\nemploys joint training on text information from both queries and products to\ngenerate shared text identifier codes, effectively bridging the gap between\nqueries and products. This approach not only enhances the connection between\nqueries and products but also improves inference efficiency. The model uses a\nco-alignment strategy to generate codes optimized for maximizing retrieval\nefficiency. Additionally, it introduces a query-product scoring mechanism to\ncompare product values across different codes, further boosting retrieval\nefficiency. Extensive offline and online A/B testing demonstrates that GRAM\nsignificantly outperforms traditional models and the latest generative\nretrieval models, confirming its effectiveness and practicality."}
{"id": "2504.13959", "pdf": "https://arxiv.org/pdf/2504.13959.pdf", "abs": "https://arxiv.org/abs/2504.13959", "title": "AI Safety Should Prioritize the Future of Work", "authors": ["Sanchaita Hazra", "Bodhisattwa Prasad Majumder", "Tuhin Chakrabarty"], "categories": ["cs.CY", "cs.AI", "cs.CL", "econ.GN", "q-fin.EC"], "comment": null, "summary": "Current efforts in AI safety prioritize filtering harmful content, preventing\nmanipulation of human behavior, and eliminating existential risks in\ncybersecurity or biosecurity. While pressing, this narrow focus overlooks\ncritical human-centric considerations that shape the long-term trajectory of a\nsociety. In this position paper, we identify the risks of overlooking the\nimpact of AI on the future of work and recommend comprehensive transition\nsupport towards the evolution of meaningful labor with human agency. Through\nthe lens of economic theories, we highlight the intertemporal impacts of AI on\nhuman livelihood and the structural changes in labor markets that exacerbate\nincome inequality. Additionally, the closed-source approach of major\nstakeholders in AI development resembles rent-seeking behavior through\nexploiting resources, breeding mediocrity in creative labor, and monopolizing\ninnovation. To address this, we argue in favor of a robust international\ncopyright anatomy supported by implementing collective licensing that ensures\nfair compensation mechanisms for using data to train AI models. We strongly\nrecommend a pro-worker framework of global AI governance to enhance shared\nprosperity and economic justice while reducing technical debt."}
{"id": "2506.08846", "pdf": "https://arxiv.org/pdf/2506.08846.pdf", "abs": "https://arxiv.org/abs/2506.08846", "title": "Addressing Pitfalls in Auditing Practices of Automatic Speech Recognition Technologies: A Case Study of People with Aphasia", "authors": ["Katelyn Xiaoying Mei", "Anna Seo Gyeong Choi", "Hilke Schellmann", "Mona Sloane", "Allison Koenecke"], "categories": ["cs.CY", "cs.CL", "cs.SD", "eess.AS"], "comment": null, "summary": "Automatic Speech Recognition (ASR) has transformed daily tasks from video\ntranscription to workplace hiring. ASR systems' growing use warrants robust and\nstandardized auditing approaches to ensure automated transcriptions of high and\nequitable quality. This is especially critical for people with speech and\nlanguage disorders (such as aphasia) who may disproportionately depend on ASR\nsystems to navigate everyday life. In this work, we identify three pitfalls in\nexisting standard ASR auditing procedures, and demonstrate how addressing them\nimpacts audit results via a case study of six popular ASR systems' performance\nfor aphasia speakers. First, audits often adhere to a single method of text\nstandardization during data pre-processing, which (a) masks variability in ASR\nperformance from applying different standardization methods, and (b) may not be\nconsistent with how users - especially those from marginalized speech\ncommunities - would want their transcriptions to be standardized. Second,\naudits often display high-level demographic findings without further\nconsidering performance disparities among (a) more nuanced demographic\nsubgroups, and (b) relevant covariates capturing acoustic information from the\ninput audio. Third, audits often rely on a single gold-standard metric -- the\nWord Error Rate -- which does not fully capture the extent of errors arising\nfrom generative AI models, such as transcription hallucinations. We propose a\nmore holistic auditing framework that accounts for these three pitfalls, and\nexemplify its results in our case study, finding consistently worse ASR\nperformance for aphasia speakers relative to a control group. We call on\npractitioners to implement these robust ASR auditing practices that remain\nflexible to the rapidly changing ASR landscape."}
{"id": "2507.06892", "pdf": "https://arxiv.org/pdf/2507.06892.pdf", "abs": "https://arxiv.org/abs/2507.06892", "title": "Squeeze the Soaked Sponge: Efficient Off-policy Reinforcement Finetuning for Large Language Model", "authors": ["Jing Liang", "Hongyao Tang", "Yi Ma", "Jinyi Liu", "Yan Zheng", "Shuyue Hu", "Lei Bai", "Jianye Hao"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "Preliminary version, v3, added the missing name of x-axis in the left\n  part of Fig.1 and corrected a wrong number in Fig.3. Project page:\n  https://anitaleungxx.github.io/ReMix", "summary": "Reinforcement Learning (RL) has demonstrated its potential to improve the\nreasoning ability of Large Language Models (LLMs). One major limitation of most\nexisting Reinforcement Finetuning (RFT) methods is that they are on-policy RL\nin nature, i.e., data generated during the past learning process is not fully\nutilized. This inevitably comes at a significant cost of compute and time,\nposing a stringent bottleneck on continuing economic and efficient scaling. To\nthis end, we launch the renaissance of off-policy RL and propose Reincarnating\nMix-policy Proximal Policy Gradient (ReMix), a general approach to enable\non-policy RFT methods like PPO and GRPO to leverage off-policy data. ReMix\nconsists of three major components: (1) Mix-policy proximal policy gradient\nwith an increased Update-To-Data (UTD) ratio for efficient training; (2)\nKL-Convex policy constraint to balance the trade-off between stability and\nflexibility; (3) Policy reincarnation to achieve a seamless transition from\nefficient early-stage learning to steady asymptotic improvement. In our\nexperiments, we train a series of ReMix models upon PPO, GRPO and 1.5B, 7B base\nmodels. ReMix shows an average Pass@1 accuracy of 52.10% (for 1.5B model) with\n0.079M response rollouts, 350 training steps and achieves 63.27%/64.39% (for 7B\nmodel) with 0.007M/0.011M response rollouts, 50/75 training steps, on five math\nreasoning benchmarks (i.e., AIME'24, AMC'23, Minerva, OlympiadBench, and\nMATH500). Compared with 15 recent advanced models, ReMix shows SOTA-level\nperformance with an over 30x to 450x reduction in training cost in terms of\nrollout data volume. In addition, we reveal insightful findings via\nmultifaceted analysis, including the implicit preference for shorter responses\ndue to the Whipping Effect of off-policy discrepancy, the collapse mode of\nself-reflection behavior under the presence of severe off-policyness, etc."}
{"id": "2507.07257", "pdf": "https://arxiv.org/pdf/2507.07257.pdf", "abs": "https://arxiv.org/abs/2507.07257", "title": "Open Source Planning & Control System with Language Agents for Autonomous Scientific Discovery", "authors": ["Licong Xu", "Milind Sarkar", "Anto I. Lonappan", "Íñigo Zubeldia", "Pablo Villanueva-Domingo", "Santiago Casas", "Christian Fidler", "Chetana Amancharla", "Ujjwal Tiwari", "Adrian Bayer", "Chadi Ait Ekioui", "Miles Cranmer", "Adrian Dimitrov", "James Fergusson", "Kahaan Gandhi", "Sven Krippendorf", "Andrew Laverick", "Julien Lesgourgues", "Antony Lewis", "Thomas Meier", "Blake Sherwin", "Kristen Surrao", "Francisco Villaescusa-Navarro", "Chi Wang", "Xueqing Xu", "Boris Bolliet"], "categories": ["cs.AI", "astro-ph.IM", "cs.CL", "cs.MA"], "comment": "Accepted contribution to the ICML 2025 Workshop on Machine Learning\n  for Astrophysics. Code: https://github.com/CMBAgents/cmbagent Videos:\n  https://www.youtube.com/@cmbagent HuggingFace:\n  https://huggingface.co/spaces/astropilot-ai/cmbagent Cloud:\n  https://cmbagent.cloud", "summary": "We present a multi-agent system for automation of scientific research tasks,\ncmbagent (https://github.com/CMBAgents/cmbagent). The system is formed by about\n30 Large Language Model (LLM) agents and implements a Planning & Control\nstrategy to orchestrate the agentic workflow, with no human-in-the-loop at any\npoint. Each agent specializes in a different task (performing retrieval on\nscientific papers and codebases, writing code, interpreting results, critiquing\nthe output of other agents) and the system is able to execute code locally. We\nsuccessfully apply cmbagent to carry out a PhD level cosmology task (the\nmeasurement of cosmological parameters using supernova data) and evaluate its\nperformance on two benchmark sets, finding superior performance over\nstate-of-the-art LLMs. The source code is available on GitHub, demonstration\nvideos are also available, and the system is deployed on HuggingFace and will\nbe available on the cloud."}
{"id": "2507.07930", "pdf": "https://arxiv.org/pdf/2507.07930.pdf", "abs": "https://arxiv.org/abs/2507.07930", "title": "Probing Experts' Perspectives on AI-Assisted Public Speaking Training", "authors": ["Nesrine Fourati", "Alisa Barkar", "Marion Dragée", "Liv Danthon-Lefebvre", "Mathieu Chollet"], "categories": ["cs.HC", "cs.AI", "cs.CL"], "comment": null, "summary": "Background: Public speaking is a vital professional skill, yet it remains a\nsource of significant anxiety for many individuals. Traditional training relies\nheavily on expert coaching, but recent advances in AI has led to novel types of\ncommercial automated public speaking feedback tools. However, most research has\nfocused on prototypes rather than commercial applications, and little is known\nabout how public speaking experts perceive these tools.\n  Objectives: This study aims to evaluate expert opinions on the efficacy and\ndesign of commercial AI-based public speaking training tools and to propose\nguidelines for their improvement.\n  Methods: The research involved 16 semi-structured interviews and 2 focus\ngroups with public speaking experts. Participants discussed their views on\ncurrent commercial tools, their potential integration into traditional\ncoaching, and suggestions for enhancing these systems.\n  Results and Conclusions: Experts acknowledged the value of AI tools in\nhandling repetitive, technical aspects of training, allowing coaches to focus\non higher-level skills. However they found key issues in current tools,\nemphasising the need for personalised, understandable, carefully selected\nfeedback and clear instructional design. Overall, they supported a hybrid model\ncombining traditional coaching with AI-supported exercises."}
