{"id": "2507.21070", "pdf": "https://arxiv.org/pdf/2507.21070.pdf", "abs": "https://arxiv.org/abs/2507.21070", "title": "Enhancing Manufacturing Training Through VR Simulations", "authors": ["Vladislav Li", "Ilias Siniosoglou", "Panagiotis Sarigiannidis", "Vasileios Argyriou"], "categories": ["cs.HC"], "comment": null, "summary": "In contemporary training for industrial manufacturing, reconciling\ntheoretical knowledge with practical experience continues to be a significant\ndifficulty. As companies transition to more intricate and technology-oriented\nsettings, conventional training methods frequently inadequately equip workers\nwith essential practical skills while maintaining safety and efficiency.\nVirtual Reality has emerged as a transformational instrument to tackle this\nissue by providing immersive, interactive, and risk-free teaching experiences.\nThrough the simulation of authentic industrial environments, virtual reality\nfacilitates the acquisition of vital skills for trainees within a regulated and\nstimulating context, therefore mitigating the hazards linked to experiential\nlearning in the workplace. This paper presents a sophisticated VR-based\nindustrial training architecture aimed at improving learning efficacy via\nhigh-fidelity simulations, dynamic and context-sensitive scenarios, and\nadaptive feedback systems. The suggested system incorporates intuitive\ngesture-based controls, reducing the learning curve for users across all skill\nlevels. A new scoring metric, namely, VR Training Scenario Score (VRTSS), is\nused to assess trainee performance dynamically, guaranteeing ongoing engagement\nand incentive. The experimental assessment of the system reveals promising\noutcomes, with significant enhancements in information retention, task\nexecution precision, and overall training efficacy. The results highlight the\ncapability of VR as a crucial instrument in industrial training, providing a\nscalable, interactive, and efficient substitute for conventional learning\nmethods."}
{"id": "2507.21071", "pdf": "https://arxiv.org/pdf/2507.21071.pdf", "abs": "https://arxiv.org/abs/2507.21071", "title": "FingerTip 20K: A Benchmark for Proactive and Personalized Mobile LLM Agents", "authors": ["Qinglong Yang", "Haoming Li", "Haotian Zhao", "Xiaokai Yan", "Jingtao Ding", "Fengli Xu", "Yong Li"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "Mobile GUI agents are becoming critical tools for enhancing human-device\ninteraction efficiency, with multimodal large language models (MLLMs) emerging\nas dominant paradigms in this domain. Current agents, however, are limited to\nfollowing explicit human instructions, resulting in insufficient capability for\nproactive intent anticipation. Additionally, these agents fail to leverage the\ncontextual information associated with users during task execution, thereby\nneglecting potentially vast differences in user preferences. To address these\nchallenges, we introduce the FingerTip benchmark. It contains two new tracks:\nproactive task suggestions by analyzing environment observation and users'\nprevious intents, and personalized task execution by catering to users' action\npreferences. We collected unique human demonstrations of multi-step Android\ndevice interactions across a variety of everyday apps. These demonstrations are\nnot isolated but are continuously acquired from the users' long-term usage in\ntheir real lives, and encompass essential user-related contextual information.\nOur experiments reveal challenges of the tasks we propose. The model fine-tuned\nwith the data we collected effectively utilized user information and achieved\ngood results, highlighting the potential of our approach in building more\nuser-oriented mobile GUI agents. Our code is open-source at\nhttps://anonymous.4open.science/r/FingerTip-57B8 for reproducibility."}
{"id": "2507.21072", "pdf": "https://arxiv.org/pdf/2507.21072.pdf", "abs": "https://arxiv.org/abs/2507.21072", "title": "Snap, Segment, Deploy: A Visual Data and Detection Pipeline for Wearable Industrial Assistants", "authors": ["Di Wen", "Junwei Zheng", "Ruiping Liu", "Yi Xu", "Kunyu Peng", "Rainer Stiefelhagen"], "categories": ["cs.HC", "cs.RO"], "comment": null, "summary": "Industrial assembly tasks increasingly demand rapid adaptation to complex\nprocedures and varied components, yet are often conducted in environments with\nlimited computing, connectivity, and strict privacy requirements. These\nconstraints make conventional cloud-based or fully autonomous solutions\nimpractical for factory deployment. This paper introduces a mobile-device-based\nassistant system for industrial training and operational support, enabling\nreal-time, semi-hands-free interaction through on-device perception and voice\ninterfaces. The system integrates lightweight object detection, speech\nrecognition, and Retrieval-Augmented Generation (RAG) into a modular on-device\npipeline that operates entirely on-device, enabling intuitive support for part\nhandling and procedure understanding without relying on manual supervision or\ncloud services. To enable scalable training, we adopt an automated data\nconstruction pipeline and introduce a two-stage refinement strategy to improve\nvisual robustness under domain shift. Experiments on our generated dataset,\ni.e., Gear8, demonstrate improved robustness to domain shift and common visual\ncorruptions. A structured user study further confirms its practical viability,\nwith positive user feedback on the clarity of the guidance and the quality of\nthe interaction. These results indicate that our framework offers a deployable\nsolution for real-time, privacy-preserving smart assistance in industrial\nenvironments. We will release the Gear8 dataset and source code upon\nacceptance."}
{"id": "2507.21074", "pdf": "https://arxiv.org/pdf/2507.21074.pdf", "abs": "https://arxiv.org/abs/2507.21074", "title": "Empowering Educators in the Age of AI: An Empirical Study on Creating custom GPTs in Qualitative Research Method education", "authors": ["Qian Huang", "Thijs Willems"], "categories": ["cs.HC", "cs.AI"], "comment": "20 pages", "summary": "As generative AI (Gen-AI) tools become more prevalent in education, there is\na growing need to understand how educators, not just students, can actively\nshape their design and use. This study investigates how two instructors\nintegrated four custom GPT tools into a Masters-level Qualitative Research\nMethods course for Urban Planning Policy students. Addressing two key gaps: the\ndominant framing of students as passive AI users, and the limited use of AI in\nqualitative methods education. The study explores how Gen-AI can support\ndisciplinary learning when aligned with pedagogical intent. Drawing on the\nTechnological Pedagogical Content Knowledge (TPACK) framework and action\nresearch methodology, the instructors designed GPTs to scaffold tasks such as\nresearch question formulation, interview practice, fieldnote analysis, and\ndesign thinking. Thematic analysis of student reflections, AI chat logs, and\nfinal assignments revealed that the tools enhanced student reflexivity,\nimproved interview techniques, and supported structured analytic thinking.\nHowever, students also expressed concerns about cognitive overload, reduced\nimmersion in data, and the formulaic nature of AI responses. The study offers\nthree key insights: AI can be a powerful scaffold for active learning when\npaired with human facilitation; custom GPTs can serve as cognitive partners in\niterative research practice; and educator-led design is critical to\npedagogically meaningful AI integration. This research contributes to emerging\nscholarship on AI in higher education by demonstrating how empowering educators\nto design custom tools can promote more reflective, responsible, and\ncollaborative learning with AI."}
{"id": "2507.21058", "pdf": "https://arxiv.org/pdf/2507.21058.pdf", "abs": "https://arxiv.org/abs/2507.21058", "title": "Categorical Classification of Book Summaries Using Word Embedding Techniques", "authors": ["Kerem Keskin", "Mümine Kaya Keleş"], "categories": ["cs.CL", "cs.AI"], "comment": "in Turkish language. This paper was published in the proceedings of\n  the 6th International Conference on Data Science and Applications ICONDATA24,\n  held on September between 2 and 6, 2024, in Pristina, Kosovo. For full text\n  book see https://www.icondata.org/en/proceedings-books", "summary": "In this study, book summaries and categories taken from book sites were\nclassified using word embedding methods, natural language processing techniques\nand machine learning algorithms. In addition, one hot encoding, Word2Vec and\nTerm Frequency - Inverse Document Frequency (TF-IDF) methods, which are\nfrequently used word embedding methods were used in this study and their\nsuccess was compared. Additionally, the combination table of the pre-processing\nmethods used is shown and added to the table. Looking at the results, it was\nobserved that Support Vector Machine, Naive Bayes and Logistic Regression\nModels and TF-IDF and One-Hot Encoder word embedding techniques gave more\nsuccessful results for Turkish texts."}
{"id": "2507.21075", "pdf": "https://arxiv.org/pdf/2507.21075.pdf", "abs": "https://arxiv.org/abs/2507.21075", "title": "Can LLMs Reason About Trust?: A Pilot Study", "authors": ["Anushka Debnath", "Stephen Cranefield", "Emiliano Lorini", "Bastin Tony Roy Savarimuthu"], "categories": ["cs.HC", "cs.CL", "cs.CY", "cs.MA"], "comment": "17 pages, 5 figures, 3 tables Accepted for presentation as a full\n  paper at the COINE 2025 workshop at AAMAS 2025 see\n  https://coin-workshop.github.io/coine-2025-detroit/accepted_for_presentation.html", "summary": "In human society, trust is an essential component of social attitude that\nhelps build and maintain long-term, healthy relationships which creates a\nstrong foundation for cooperation, enabling individuals to work together\neffectively and achieve shared goals. As many human interactions occur through\nelectronic means such as using mobile apps, the potential arises for AI systems\nto assist users in understanding the social state of their relationships. In\nthis paper we investigate the ability of Large Language Models (LLMs) to reason\nabout trust between two individuals in an environment which requires fostering\ntrust relationships. We also assess whether LLMs are capable of inducing trust\nby role-playing one party in a trust based interaction and planning actions\nwhich can instil trust."}
{"id": "2507.21065", "pdf": "https://arxiv.org/pdf/2507.21065.pdf", "abs": "https://arxiv.org/abs/2507.21065", "title": "Dialogic Social Learning for Artificial Agents: Enhancing LLM Ontology Acquisition through Mixed-Initiative Educational Interactions", "authors": ["Sabrina Patania", "Luca Annese", "Cansu Koyuturk", "Azzurra Ruggeri", "Dimitri Ognibene"], "categories": ["cs.CL", "cs.HC", "cs.LG", "cs.RO", "I.2.7, I.2.9, j.4,"], "comment": "submitted to ICSR2025", "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nprocessing extensive offline datasets. However, they often face challenges in\nacquiring and integrating complex, knowledge online. Traditional AI training\nparadigms, predominantly based on supervised learning or reinforcement\nlearning, mirror a 'Piagetian' model of independent exploration. These\napproaches typically rely on large datasets and sparse feedback signals,\nlimiting the models' ability to learn efficiently from interactions. Drawing\ninspiration from Vygotsky's sociocultural theory, this study explores the\npotential of socially mediated learning paradigms to address these limitations.\n  We introduce a dynamic environment, termed the 'AI Social Gym', where an AI\nlearner agent engages in dyadic pedagogical dialogues with knowledgeable AI\nteacher agents. These interactions emphasize external, structured dialogue as a\ncore mechanism for knowledge acquisition, contrasting with methods that depend\nsolely on internal inference or pattern recognition.\n  Our investigation focuses on how different pedagogical strategies impact the\nAI learning process in the context of ontology acquisition. Empirical results\nindicate that such dialogic approaches-particularly those involving\nmixed-direction interactions combining top-down explanations with\nlearner-initiated questioning-significantly enhance the LLM's ability to\nacquire and apply new knowledge, outperforming both unidirectional\ninstructional methods and direct access to structured knowledge, formats\ntypically present in training datasets.\n  These findings suggest that integrating pedagogical and psychological\ninsights into AI and robot training can substantially improve post-training\nknowledge acquisition and response quality. This approach offers a\ncomplementary pathway to existing strategies like prompt engineering"}
{"id": "2507.21077", "pdf": "https://arxiv.org/pdf/2507.21077.pdf", "abs": "https://arxiv.org/abs/2507.21077", "title": "Data-Driven and Participatory Approaches toward Neuro-Inclusive AI", "authors": ["Naba Rizvi"], "categories": ["cs.HC", "cs.AI", "cs.CY"], "comment": "PhD Dissertation at UC San Diego (June 2025)", "summary": "Biased data representation in AI marginalizes up to 75 million autistic\npeople worldwide through medical applications viewing autism as a deficit of\nneurotypical social skills rather than an aspect of human diversity, and this\nperspective is grounded in research questioning the humanity of autistic\npeople. Turing defined artificial intelligence as the ability to mimic human\ncommunication, and as AI development increasingly focuses on human-like agents,\nthis benchmark remains popular. In contrast, we define Neuro-Inclusive AI as\ndatasets and systems that move away from mimicking humanness as a benchmark for\nmachine intelligence. Then, we explore the origins, prevalence, and impact of\nanti-autistic biases in current research. Our work finds that 90% of human-like\nAI agents exclude autistic perspectives, and AI creators continue to believe\nethical considerations are beyond the scope of their work. To improve the\nautistic representation in data, we conduct empirical experiments with\nannotators and LLMs, finding that binary labeling schemes sufficiently capture\nthe nuances of labeling anti-autistic hate speech. Our benchmark, AUTALIC, can\nbe used to evaluate or fine-tune models, and was developed to serve as a\nfoundation for more neuro-inclusive future work."}
{"id": "2507.21073", "pdf": "https://arxiv.org/pdf/2507.21073.pdf", "abs": "https://arxiv.org/abs/2507.21073", "title": "Product vs. Process: Exploring EFL Students' Editing of AI-Generated Text for Expository Writing", "authors": ["David James Woo", "Yangyang Yu", "Kai Guo", "Yilin Huang", "April Ka Yeng Fung"], "categories": ["cs.CL", "cs.HC"], "comment": "45 pages, 11 figures", "summary": "Text generated by artificial intelligence (AI) chatbots is increasingly used\nin English as a foreign language (EFL) writing contexts, yet its impact on\nstudents' expository writing process and compositions remains understudied.\nThis research examines how EFL secondary students edit AI-generated text.\nExploring editing behaviors in their expository writing process and in\nexpository compositions, and their effect on human-rated scores for content,\norganization, language, and overall quality. Participants were 39 Hong Kong\nsecondary students who wrote an expository composition with AI chatbots in a\nworkshop. A convergent design was employed to analyze their screen recordings\nand compositions to examine students' editing behaviors and writing qualities.\nAnalytical methods included qualitative coding, descriptive statistics,\ntemporal sequence analysis, human-rated scoring, and multiple linear regression\nanalysis. We analyzed over 260 edits per dataset, and identified two editing\npatterns: one where students refined introductory units repeatedly before\nprogressing, and another where they quickly shifted to extensive edits in body\nunits (e.g., topic and supporting sentences). MLR analyses revealed that the\nnumber of AI-generated words positively predicted all score dimensions, while\nmost editing variables showed minimal impact. These results suggest a\ndisconnect between students' significant editing effort and improved\ncomposition quality, indicating AI supports but does not replace writing\nskills. The findings highlight the importance of genre-specific instruction and\nprocess-focused writing before AI integration. Educators should also develop\nassessments valuing both process and product to encourage critical engagement\nwith AI text."}
{"id": "2507.21078", "pdf": "https://arxiv.org/pdf/2507.21078.pdf", "abs": "https://arxiv.org/abs/2507.21078", "title": "What Makes a Level Hard in Super Mario Maker 2?", "authors": ["Carlo A. Furia", "Andrea Mocci"], "categories": ["cs.HC", "cs.SE"], "comment": null, "summary": "Games like Super Mario Maker 2 (SMM2) lower the barrier for casual users to\nbecome level designers. In this paper, we set out to analyze a vast amount of\ndata about SMM2 user-written levels, in order to understand what factors affect\na level's difficulty as experienced by other users. To this end, we perform two\nkinds of analyses: one based on regression models and one using natural\nlanguage processing techniques. The main results shed light on which level\ncharacteristics (e.g., its style, popularity, timing) and which topics and\nsentiments have a consistent association with easier or harder levels. While\nnone of our findings are startling, they help distill some key differences\nbetween easy and hard SMM2 levels, which, in turn, can pave the way for a\nbetter understanding of end-user level design."}
{"id": "2507.21080", "pdf": "https://arxiv.org/pdf/2507.21080.pdf", "abs": "https://arxiv.org/abs/2507.21080", "title": "Which symbol grounding problem should we try to solve?", "authors": ["Vincent C. Müller"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Floridi and Taddeo propose a condition of \"zero semantic commitment\" for\nsolutions to the grounding problem, and a solution to it. I argue briefly that\ntheir condition cannot be fulfilled, not even by their own solution. After a\nlook at Luc Steels' very different competing suggestion, I suggest that we need\nto re-think what the problem is and what role the 'goals' in a system play in\nformulating the problem. On the basis of a proper understanding of computing, I\ncome to the conclusion that the only sensible grounding problem is how we can\nexplain and re-produce the behavioral ability and function of meaning in\nartificial computational agents"}
{"id": "2507.21079", "pdf": "https://arxiv.org/pdf/2507.21079.pdf", "abs": "https://arxiv.org/abs/2507.21079", "title": "Metaverse Support Groups for LGBTQ+ Youth: An Observational Study on Safety, Self-Expression, and Early Intervention", "authors": ["Joe Hasei", "Yosuke Matsumoto", "Hiroki Kawai", "Yuko Okahisa", "Manabu Takaki", "Toshifumi Ozaki"], "categories": ["cs.HC", "cs.CY"], "comment": null, "summary": "This study assessed metaverse-based support groups designed to reduce social\nisolation and suicide risk among LGBTQ+ youths. Using the Cluster platform,\nenhanced anonymity, avatar-based self-expression, and accessibility were\nprovided. Key findings showed that 79.2% chose avatars matching their gender\nidentity, reporting high satisfaction (mean: 4.10/5) and low discomfort (mean:\n1.79/5). Social confidence significantly improved in virtual spaces compared to\nreal-world interactions (p<0.001), particularly among participants with\ninitially low confidence, averaging an increase of 2.08 points. About half of\nthe first-time participants were 16 or younger, highlighting potential for\nearly intervention. The metaverse scored higher than real-world environments\nfor safety/privacy (3.94/5), self-expression (4.02/5), and accessibility\n(4.21/5). Additionally, 73.6% reported feeling more accepted virtually.\nHowever, some highly confident individuals offline experienced mild adaptation\nchallenges, averaging a confidence decrease of 0.58 points, indicating virtual\nsupport complements rather than replaces in-person services. These findings\nsuggest metaverse-based support effectively lowers psychological barriers and\nprovides affirming spaces, potentially reducing severe outcomes such as\nsuicidal ideation. Future studies should focus on integrating virtual support\nwith existing community and clinical frameworks to enhance long-term impacts."}
{"id": "2507.21083", "pdf": "https://arxiv.org/pdf/2507.21083.pdf", "abs": "https://arxiv.org/abs/2507.21083", "title": "ChatGPT Reads Your Tone and Responds Accordingly -- Until It Does Not -- Emotional Framing Induces Bias in LLM Outputs", "authors": ["Franck Bardol"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models like GPT-4 adjust their responses not only based on the\nquestion asked, but also on how it is emotionally phrased. We systematically\nvary the emotional tone of 156 prompts - spanning controversial and everyday\ntopics - and analyze how it affects model responses. Our findings show that\nGPT-4 is three times less likely to respond negatively to a negatively framed\nquestion than to a neutral one. This suggests a \"rebound\" bias where the model\novercorrects, often shifting toward neutrality or positivity. On sensitive\ntopics (e.g., justice or politics), this effect is even more pronounced:\ntone-based variation is suppressed, suggesting an alignment override. We\nintroduce concepts like the \"tone floor\" - a lower bound in response negativity\n- and use tone-valence transition matrices to quantify behavior. Visualizations\nbased on 1536-dimensional embeddings confirm semantic drift based on tone. Our\nwork highlights an underexplored class of biases driven by emotional framing in\nprompts, with implications for AI alignment and trust. Code and data are\navailable at: https://github.com/bardolfranck/llm-responses-viewer"}
{"id": "2507.21081", "pdf": "https://arxiv.org/pdf/2507.21081.pdf", "abs": "https://arxiv.org/abs/2507.21081", "title": "Empathy in Explanation", "authors": ["Katherine M. Collins", "Kartik Chandra", "Adrian Weller", "Jonathan Ragan-Kelley", "Joshua B. Tenenbaum"], "categories": ["cs.HC", "cs.AI"], "comment": "CogSci non-archival conference paper", "summary": "Why do we give the explanations we do? Recent work has suggested that we\nshould think of explanation as a kind of cooperative social interaction,\nbetween a why-question-asker and an explainer. Here, we apply this perspective\nto consider the role that emotion plays in this social interaction. We develop\na computational framework for modeling explainers who consider the emotional\nimpact an explanation might have on a listener. We test our framework by using\nit to model human intuitions about how a doctor might explain to a patient why\nthey have a disease, taking into account the patient's propensity for regret.\nOur model predicts human intuitions well, better than emotion-agnostic\nablations, suggesting that people do indeed reason about emotion when giving\nexplanations."}
{"id": "2507.21084", "pdf": "https://arxiv.org/pdf/2507.21084.pdf", "abs": "https://arxiv.org/abs/2507.21084", "title": "Reviving Your MNEME: Predicting The Side Effects of LLM Unlearning and Fine-Tuning via Sparse Model Diffing", "authors": ["Aly M. Kassem", "Zhuan Shi", "Negar Rostamzadeh", "Golnoosh Farnadi"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Large language models (LLMs) are frequently fine-tuned or unlearned to adapt\nto new tasks or eliminate undesirable behaviors. While existing evaluation\nmethods assess performance after such interventions, there remains no general\napproach for detecting unintended side effects, such as unlearning biology\ncontent degrading performance on chemistry tasks, particularly when these\neffects are unpredictable or emergent. To address this issue, we introduce\nMNEME, Model diffiNg for Evaluating Mechanistic Effects, a lightweight\nframework for identifying these side effects using sparse model diffing. MNEME\ncompares base and fine-tuned models on task-agnostic data (for example, The\nPile, LMSYS-Chat-1M) without access to fine-tuning data to isolate behavioral\nshifts. Applied to five LLMs across three scenarios: WMDP knowledge unlearning,\nemergent misalignment, and benign fine-tuning, MNEME achieves up to 95 percent\naccuracy in predicting side effects, aligning with known benchmarks and\nrequiring no custom heuristics. Furthermore, we show that retraining on\nhigh-activation samples can partially reverse these effects. Our results\ndemonstrate that sparse probing and diffing offer a scalable and automated lens\ninto fine-tuning-induced model changes, providing practical tools for\nunderstanding and managing LLM behavior."}
{"id": "2507.21088", "pdf": "https://arxiv.org/pdf/2507.21088.pdf", "abs": "https://arxiv.org/abs/2507.21088", "title": "Eliciting User Requirements for AI-Enhanced Learning Environments using a Participatory Approach", "authors": ["Bibeg Limbu", "Irene-Angelica Chounta", "Vilma Sukacke", "Andromachi Filippidi", "Chara Spyropoulou", "Marianna Anagnostopoulou", "Eleftheria Tsourlidaki", "Nikos Karacapilidis"], "categories": ["cs.HC"], "comment": "12 pages, 2 figures, 15th International Conference on Methodologies\n  and Intelligent Systems for Technology Enhanced Learning (mis4tel), Workshop\n  Track: Workshop on Integration of Emerging Technologies into Education and\n  Training (ETELT) https://mis4tel-conference.net/tracks/workshops/etelt,\n  accepted", "summary": "This paper explores the needs \\& expectations of educational stakeholders for\nAI (Artificial Intelligence)-enhanced learning environments. Data was collected\nfollowing two-phased participatory workshops. The first workshop outlined\nstakeholders' profiles in terms of technical and pedagogical characteristics.\nThe qualitative data collected was analysed using deductive thematic analysis\nwith Activity Theory, explicating the user needs. The second workshop\narticulated expectations related to the integration of AI in education.\nInductive thematic analysis of the second workshop led to the elicitation of\nusers' expectations. We cross-examined the needs and expectations, identifying\ncontradictions, to generate user requirements for emerging technologies. The\npaper provides suggestions for future design initiatives that incorporate AI in\nlearning environments."}
{"id": "2507.21086", "pdf": "https://arxiv.org/pdf/2507.21086.pdf", "abs": "https://arxiv.org/abs/2507.21086", "title": "Multi-Amateur Contrastive Decoding for Text Generation", "authors": ["Jaydip Sen", "Subhasis Dasgupta", "Hetvi Waghela"], "categories": ["cs.CL"], "comment": "This paper has been accepted for oral presentation and publication in\n  the proceedings of the IEEE I2ITCON 2025. The conference will be organized in\n  Pune, India, from July 4 to 5, 2025. This is the accepted version of the\n  paper and NOT the final camera-ready version. The paper is 11 pages long and\n  contains 5 figures and 6 tables", "summary": "Contrastive Decoding (CD) has emerged as an effective inference-time strategy\nfor enhancing open-ended text generation by exploiting the divergence in output\nprobabilities between a large expert language model and a smaller amateur\nmodel. Although CD improves coherence and fluency, its dependence on a single\namateur restricts its capacity to capture the diverse and multifaceted failure\nmodes of language generation, such as repetition, hallucination, and stylistic\ndrift. This paper proposes Multi-Amateur Contrastive Decoding (MACD), a\ngeneralization of the CD framework that employs an ensemble of amateur models\nto more comprehensively characterize undesirable generation patterns. MACD\nintegrates contrastive signals through both averaging and consensus\npenalization mechanisms and extends the plausibility constraint to operate\neffectively in the multi-amateur setting. Furthermore, the framework enables\ncontrollable generation by incorporating amateurs with targeted stylistic or\ncontent biases. Experimental results across multiple domains, such as news,\nencyclopedic, and narrative, demonstrate that MACD consistently surpasses\nconventional decoding methods and the original CD approach in terms of fluency,\ncoherence, diversity, and adaptability, all without requiring additional\ntraining or fine-tuning."}
{"id": "2507.21089", "pdf": "https://arxiv.org/pdf/2507.21089.pdf", "abs": "https://arxiv.org/abs/2507.21089", "title": "Emotionally Aware Moderation: The Potential of Emotion Monitoring in Shaping Healthier Social Media Conversations", "authors": ["Xiaotian Su", "Naim Zierau", "Soomin Kim", "April Yi Wang", "Thiemo Wambsganss"], "categories": ["cs.HC", "cs.CL"], "comment": null, "summary": "Social media platforms increasingly employ proactive moderation techniques,\nsuch as detecting and curbing toxic and uncivil comments, to prevent the spread\nof harmful content. Despite these efforts, such approaches are often criticized\nfor creating a climate of censorship and failing to address the underlying\ncauses of uncivil behavior. Our work makes both theoretical and practical\ncontributions by proposing and evaluating two types of emotion monitoring\ndashboards to users' emotional awareness and mitigate hate speech. In a study\ninvolving 211 participants, we evaluate the effects of the two mechanisms on\nuser commenting behavior and emotional experiences. The results reveal that\nthese interventions effectively increase users' awareness of their emotional\nstates and reduce hate speech. However, our findings also indicate potential\nunintended effects, including increased expression of negative emotions (Angry,\nFear, and Sad) when discussing sensitive issues. These insights provide a basis\nfor further research on integrating proactive emotion regulation tools into\nsocial media platforms to foster healthier digital interactions."}
{"id": "2507.21095", "pdf": "https://arxiv.org/pdf/2507.21095.pdf", "abs": "https://arxiv.org/abs/2507.21095", "title": "QU-NLP at CheckThat! 2025: Multilingual Subjectivity in News Articles Detection using Feature-Augmented Transformer Models with Sequential Cross-Lingual Fine-Tuning", "authors": ["Mohammad AL-Smadi"], "categories": ["cs.CL"], "comment": null, "summary": "This paper presents our approach to the CheckThat! 2025 Task 1 on\nsubjectivity detection, where systems are challenged to distinguish whether a\nsentence from a news article expresses the subjective view of the author or\npresents an objective view on the covered topic. We propose a feature-augmented\ntransformer architecture that combines contextual embeddings from pre-trained\nlanguage models with statistical and linguistic features. Our system leveraged\npre-trained transformers with additional lexical features: for Arabic we used\nAraELECTRA augmented with part-of-speech (POS) tags and TF-IDF features, while\nfor the other languages we fine-tuned a cross-lingual DeBERTa~V3 model combined\nwith TF-IDF features through a gating mechanism. We evaluated our system in\nmonolingual, multilingual, and zero-shot settings across multiple languages\nincluding English, Arabic, German, Italian, and several unseen languages. The\nresults demonstrate the effectiveness of our approach, achieving competitive\nperformance across different languages with notable success in the monolingual\nsetting for English (rank 1st with macro-F1=0.8052), German (rank 3rd with\nmacro-F1=0.8013), Arabic (rank 4th with macro-F1=0.5771), and Romanian (rank\n1st with macro-F1=0.8126) in the zero-shot setting. We also conducted an\nablation analysis that demonstrated the importance of combining TF-IDF features\nwith the gating mechanism and the cross-lingual transfer for subjectivity\ndetection. Furthermore, our analysis reveals the model's sensitivity to both\nthe order of cross-lingual fine-tuning and the linguistic proximity of the\ntraining languages."}
{"id": "2507.21090", "pdf": "https://arxiv.org/pdf/2507.21090.pdf", "abs": "https://arxiv.org/abs/2507.21090", "title": "Thinking Like a Scientist: Can Interactive Simulations Foster Critical AI Literacy?", "authors": ["Yiling Zhao", "Audrey Michal", "Nithum Thain", "Hari Subramonyam"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "As AI systems shape individual and societal decisions, fostering critical AI\nliteracy is essential. Traditional approaches, such as blog articles, static\nlessons, and social media discussions, often fail to support deep conceptual\nunderstanding and critical engagement. This study examines whether interactive\nsimulations can help learners think like a scientist by engaging them in\nhypothesis testing, experimentation, and direct observation of AI behavior. In\na controlled study with 605 participants, we assess how interactive AI\ntutorials impact learning of key concepts such as fairness, dataset\nrepresentativeness, and bias in language models. Results show that interactive\nsimulations effectively enhance AI literacy across topics, supporting greater\nknowledge transfer and self-reported confidence, though engagement alone does\nnot predict learning. This work contributes to the growing field of AI literacy\neducation, highlighting how interactive, inquiry-driven methodologies can\nbetter equip individuals to critically engage with AI in their daily lives."}
{"id": "2507.21099", "pdf": "https://arxiv.org/pdf/2507.21099.pdf", "abs": "https://arxiv.org/abs/2507.21099", "title": "Rewrite-to-Rank: Optimizing Ad Visibility via Retrieval-Aware Text Rewriting", "authors": ["Chloe Ho", "Ishneet Sukhvinder Singh", "Diya Sharma", "Tanvi Reddy Anumandla", "Michael Lu", "Vasu Sharma", "Kevin Zhu"], "categories": ["cs.CL"], "comment": null, "summary": "Search algorithms and user query relevance have given LLMs the ability to\nreturn relevant information, but the effect of content phrasing on ad\nvisibility remains underexplored. We investigate how LLM-based rewriting of\nadvertisements can improve their ranking in retrieval systems and inclusion in\ngenerated LLM responses, without modifying the retrieval model itself. We\nintroduce a supervised fine-tuning framework with a custom loss balancing\nsemantic relevance and content fidelity. To evaluate effectiveness, we propose\ntwo metrics: DeltaMRR@K (ranking improvement) and DeltaDIR@K (inclusion\nfrequency improvement). Our approach presents a scalable method to optimize ad\nphrasing, enhancing visibility in retrieval-based LLM workflows. Experiments\nacross both instruction-based and few-shot prompting demonstrate that PPO\ntrained models outperform both prompt engineering and supervised fine-tuning in\nmost cases, achieving up to a 2.79 DeltaDIR@5 and 0.0073 DeltaMRR@5 in\ninstruction-based prompting. These results highlight the importance of how the\nad is written before retrieval and prompt format and reinforcement learning in\neffective ad rewriting for LLM integrated retrieval systems."}
{"id": "2507.21124", "pdf": "https://arxiv.org/pdf/2507.21124.pdf", "abs": "https://arxiv.org/abs/2507.21124", "title": "VizGenie: Toward Self-Refining, Domain-Aware Workflows for Next-Generation Scientific Visualization", "authors": ["Ayan Biswas", "Terece L. Turton", "Nishath Rajiv Ranasinghe", "Shawn Jones", "Bradley Love", "William Jones", "Aric Hagberg", "Han-Wei Shen", "Nathan DeBardeleben", "Earl Lawrence"], "categories": ["cs.HC", "cs.AI", "cs.GR", "cs.LG"], "comment": null, "summary": "We present VizGenie, a self-improving, agentic framework that advances\nscientific visualization through large language model (LLM) by orchestrating of\na collection of domain-specific and dynamically generated modules. Users\ninitially access core functionalities--such as threshold-based filtering, slice\nextraction, and statistical analysis--through pre-existing tools. For tasks\nbeyond this baseline, VizGenie autonomously employs LLMs to generate new\nvisualization scripts (e.g., VTK Python code), expanding its capabilities\non-demand. Each generated script undergoes automated backend validation and is\nseamlessly integrated upon successful testing, continuously enhancing the\nsystem's adaptability and robustness. A distinctive feature of VizGenie is its\nintuitive natural language interface, allowing users to issue high-level\nfeature-based queries (e.g., ``visualize the skull\"). The system leverages\nimage-based analysis and visual question answering (VQA) via fine-tuned vision\nmodels to interpret these queries precisely, bridging domain expertise and\ntechnical implementation. Additionally, users can interactively query generated\nvisualizations through VQA, facilitating deeper exploration. Reliability and\nreproducibility are further strengthened by Retrieval-Augmented Generation\n(RAG), providing context-driven responses while maintaining comprehensive\nprovenance records. Evaluations on complex volumetric datasets demonstrate\nsignificant reductions in cognitive overhead for iterative visualization tasks.\nBy integrating curated domain-specific tools with LLM-driven flexibility,\nVizGenie not only accelerates insight generation but also establishes a\nsustainable, continuously evolving visualization practice. The resulting\nplatform dynamically learns from user interactions, consistently enhancing\nsupport for feature-centric exploration and reproducible research in scientific\nvisualization."}
{"id": "2507.21104", "pdf": "https://arxiv.org/pdf/2507.21104.pdf", "abs": "https://arxiv.org/abs/2507.21104", "title": "iLSU-T: an Open Dataset for Uruguayan Sign Language Translation", "authors": ["Ariel E. Stassi", "Yanina Boria", "J. Matías Di Martino", "Gregory Randall"], "categories": ["cs.CL", "cs.AI"], "comment": "10 pages, 5 figures, 19th International Conference on Automatic Face\n  and Gesture Recognition IEEE FG 2025", "summary": "Automatic sign language translation has gained particular interest in the\ncomputer vision and computational linguistics communities in recent years.\nGiven each sign language country particularities, machine translation requires\nlocal data to develop new techniques and adapt existing ones. This work\npresents iLSU T, an open dataset of interpreted Uruguayan Sign Language RGB\nvideos with audio and text transcriptions. This type of multimodal and curated\ndata is paramount for developing novel approaches to understand or generate\ntools for sign language processing. iLSU T comprises more than 185 hours of\ninterpreted sign language videos from public TV broadcasting. It covers diverse\ntopics and includes the participation of 18 professional interpreters of sign\nlanguage. A series of experiments using three state of the art translation\nalgorithms is presented. The aim is to establish a baseline for this dataset\nand evaluate its usefulness and the proposed pipeline for data processing. The\nexperiments highlight the need for more localized datasets for sign language\ntranslation and understanding, which are critical for developing novel tools to\nimprove accessibility and inclusion of all individuals. Our data and code can\nbe accessed."}
{"id": "2507.21303", "pdf": "https://arxiv.org/pdf/2507.21303.pdf", "abs": "https://arxiv.org/abs/2507.21303", "title": "Impact of eHMI on Pedestrians' Interactions with Level-5 Automated Driving Systems", "authors": ["Viktoria Marcus", "Griffin Pitts", "Sanaz Motamedi"], "categories": ["cs.HC", "cs.CY", "cs.ET"], "comment": "Accepted and to be presented at ASPIRE 2025 - the 69th International\n  Annual Meeting of HFES", "summary": "Each year, over half of global traffic fatalities involve vulnerable road\nusers (e.g. pedestrians), often due to human error. Level-5 automated driving\nsystems (ADSs) could reduce driver errors contributing to pedestrian accidents,\nthough effectiveness depends on clarity and understandability for other road\nusers. External human-machine interfaces (eHMIs) have been proposed to\nfacilitate pedestrian-ADS communication, though consensus on optimal eHMI\nfeatures remains unclear. In an online survey, 153 participants responded to\nroad-crossing scenarios involving level-5 ADSs, with and without eHMIs. With\neHMIs, pedestrians crossed earlier and more confidently, and reported\nsignificantly increased perceptions of safety, trust, and understanding when\ninteracting with level-5 ADSs. Visual eHMI features (including a text display\nand external speedometer) were ranked more necessary than auditory ones, though\nauditory cues received positive feedback. This study demonstrates that eHMIs\ncan significantly improve pedestrians' understanding of level-5 ADS intent and\nenhance perceived safety and trust, facilitating more intuitive pedestrian-ADS\ninteractions."}
{"id": "2507.21106", "pdf": "https://arxiv.org/pdf/2507.21106.pdf", "abs": "https://arxiv.org/abs/2507.21106", "title": "Creation of a Numerical Scoring System to Objectively Measure and Compare the Level of Rhetoric in Arabic Texts: A Feasibility Study, and A Working Prototype", "authors": ["Mandar Marathe"], "categories": ["cs.CL"], "comment": "This dissertation was submitted by Mandar Marathe on 6 September\n  2022, in partial fulfilment of the requirements for the Master of Arts degree\n  in Advanced Arabic at the University of Exeter", "summary": "Arabic Rhetoric is the field of Arabic linguistics which governs the art and\nscience of conveying a message with greater beauty, impact and persuasiveness.\nThe field is as ancient as the Arabic language itself and is found extensively\nin classical and contemporary Arabic poetry, free verse and prose. In practical\nterms, it is the intelligent use of word order, figurative speech and\nlinguistic embellishments to enhance message delivery. Despite the volumes that\nhave been written about it and the high status accorded to it, there is no way\nto objectively know whether a speaker or writer has used Arabic rhetoric in a\ngiven text, to what extent, and why. There is no objective way to compare the\nuse of Arabic rhetoric across genres, authors or epochs. It is impossible to\nknow which of pre-Islamic poetry, Andalucian Arabic poetry, or modern literary\ngenres are richer in Arabic rhetoric. The aim of the current study was to\ndevise a way to measure the density of the literary devices which constitute\nArabic rhetoric in a given text, as a proxy marker for Arabic rhetoric itself.\nA comprehensive list of 84 of the commonest literary devices and their\ndefinitions was compiled. A system of identifying literary devices in texts was\nconstructed. A method of calculating the density of literary devices based on\nthe morpheme count of the text was utilised. Four electronic tools and an\nanalogue tool were created to support the calculation of an Arabic text's\nrhetorical literary device density, including a website and online calculator.\nAdditionally, a technique of reporting the distribution of literary devices\nused across the three sub-domains of Arabic rhetoric was created. The output of\nthis project is a working tool which can accurately report the density of\nArabic rhetoric in any Arabic text or speech."}
{"id": "2507.21378", "pdf": "https://arxiv.org/pdf/2507.21378.pdf", "abs": "https://arxiv.org/abs/2507.21378", "title": "ProMemAssist: Exploring Timely Proactive Assistance Through Working Memory Modeling in Multi-Modal Wearable Devices", "authors": ["Kevin Pu", "Ting Zhang", "Naveen Sendhilnathan", "Sebastian Freitag", "Raj Sodhi", "Tanya Jonker"], "categories": ["cs.HC", "cs.AI"], "comment": "Accepted to UIST'25", "summary": "Wearable AI systems aim to provide timely assistance in daily life, but\nexisting approaches often rely on user initiation or predefined task knowledge,\nneglecting users' current mental states. We introduce ProMemAssist, a smart\nglasses system that models a user's working memory (WM) in real-time using\nmulti-modal sensor signals. Grounded in cognitive theories of WM, our system\nrepresents perceived information as memory items and episodes with encoding\nmechanisms, such as displacement and interference. This WM model informs a\ntiming predictor that balances the value of assistance with the cost of\ninterruption. In a user study with 12 participants completing cognitively\ndemanding tasks, ProMemAssist delivered more selective assistance and received\nhigher engagement compared to an LLM baseline system. Qualitative feedback\nhighlights the benefits of WM modeling for nuanced, context-sensitive support,\noffering design implications for more attentive and user-aware proactive\nagents."}
{"id": "2507.21107", "pdf": "https://arxiv.org/pdf/2507.21107.pdf", "abs": "https://arxiv.org/abs/2507.21107", "title": "Curved Inference: Concern-Sensitive Geometry in Large Language Model Residual Streams", "authors": ["Rob Manson"], "categories": ["cs.CL", "cs.AI"], "comment": "29 pages, 22 figures", "summary": "We propose Curved Inference - a geometric Interpretability framework that\ntracks how the residual stream trajectory of a large language model bends in\nresponse to shifts in semantic concern. Across 20 matched prompts spanning\nemotional, moral, perspective, logical, identity, environmental, and nonsense\ndomains, we analyse Gemma3-1b and LLaMA3.2-3b using five native-space metrics,\nwith a primary focus on curvature (\\k{appa}_i) and salience (S(t)). These\nmetrics are computed under a pullback semantic metric derived from the\nunembedding matrix, ensuring that all measurements reflect token-aligned\ngeometry rather than raw coordinate structure. We find that concern-shifted\nprompts reliably alter internal activation trajectories in both models - with\nLLaMA exhibiting consistent, statistically significant scaling in both\ncurvature and salience as concern intensity increases. Gemma also responds to\nconcern but shows weaker differentiation between moderate and strong variants.\nOur results support a two-layer view of LLM geometry - a latent conceptual\nstructure encoded in the embedding space, and a contextual trajectory shaped by\nprompt-specific inference. Curved Inference reveals how models navigate,\nreorient, or reinforce semantic meaning over depth, offering a principled\nmethod for diagnosing alignment, abstraction, and emergent inference dynamics.\nThese findings offer fresh insight into semantic abstraction and model\nalignment through the lens of Curved Inference."}
{"id": "2507.21411", "pdf": "https://arxiv.org/pdf/2507.21411.pdf", "abs": "https://arxiv.org/abs/2507.21411", "title": "InSituTale: Enhancing Augmented Data Storytelling with Physical Objects", "authors": ["Kentaro Takahira", "Yue Yu", "Takanori Fujiwara", "Suzuki Ryo", "Huamin Qu"], "categories": ["cs.HC", "cs.GR"], "comment": null, "summary": "Augmented data storytelling enhances narrative delivery by integrating\nvisualizations with physical environments and presenter actions. Existing\nsystems predominantly rely on body gestures or speech to control\nvisualizations, leaving interactions with physical objects largely\nunderexplored. We introduce augmented physical data storytelling, an approach\nenabling presenters to manipulate visualizations through physical object\ninteractions. To inform this approach, we first conducted a survey of\ndata-driven presentations to identify common visualization commands. We then\nconducted workshops with nine HCI/VIS researchers to collect mappings between\nphysical manipulations and these commands. Guided by these insights, we\ndeveloped InSituTale, a prototype that combines object tracking via a depth\ncamera with Vision-LLM for detecting real-world events. Through physical\nmanipulations, presenters can dynamically execute various visualization\ncommands, delivering cohesive data storytelling experiences that blend physical\nand digital elements. A user study with 12 participants demonstrated that\nInSituTale enables intuitive interactions, offers high utility, and facilitates\nan engaging presentation experience."}
{"id": "2507.21108", "pdf": "https://arxiv.org/pdf/2507.21108.pdf", "abs": "https://arxiv.org/abs/2507.21108", "title": "A Survey of Classification Tasks and Approaches for Legal Contracts", "authors": ["Amrita Singh", "Aditya Joshi", "Jiaojiao Jiang", "Hye-young Paik"], "categories": ["cs.CL", "cs.AI"], "comment": "Under review. 49 pages + references", "summary": "Given the large size and volumes of contracts and their underlying inherent\ncomplexity, manual reviews become inefficient and prone to errors, creating a\nclear need for automation. Automatic Legal Contract Classification (LCC)\nrevolutionizes the way legal contracts are analyzed, offering substantial\nimprovements in speed, accuracy, and accessibility. This survey delves into the\nchallenges of automatic LCC and a detailed examination of key tasks, datasets,\nand methodologies. We identify seven classification tasks within LCC, and\nreview fourteen datasets related to English-language contracts, including\npublic, proprietary, and non-public sources. We also introduce a methodology\ntaxonomy for LCC, categorized into Traditional Machine Learning, Deep Learning,\nand Transformer-based approaches. Additionally, the survey discusses evaluation\ntechniques and highlights the best-performing results from the reviewed\nstudies. By providing a thorough overview of current methods and their\nlimitations, this survey suggests future research directions to improve the\nefficiency, accuracy, and scalability of LCC. As the first comprehensive survey\non LCC, it aims to support legal NLP researchers and practitioners in improving\nlegal processes, making legal information more accessible, and promoting a more\ninformed and equitable society."}
{"id": "2507.21435", "pdf": "https://arxiv.org/pdf/2507.21435.pdf", "abs": "https://arxiv.org/abs/2507.21435", "title": "MindChat: Enhancing BCI Spelling with Large Language Models in Realistic Scenarios", "authors": ["JIaheng Wang", "Yucun Zhong", "Chengjie Huang", "Lin Yao"], "categories": ["cs.HC"], "comment": null, "summary": "Brain-computer interface (BCI) spellers can render a new communication\nchannel independent of peripheral nervous system, which are especially valuable\nfor patients with severe motor disabilities. However, current BCI spellers\noften require users to type intended utterances letter-by-letter while spelling\nerrors grow proportionally due to inaccurate electroencephalogram (EEG)\ndecoding, largely impeding the efficiency and usability of BCIs in real-world\ncommunication. In this paper, we present MindChat, a large language model\n(LLM)-assisted BCI speller to enhance BCI spelling efficiency by reducing\nusers' manual keystrokes. Building upon prompt engineering, we prompt LLMs\n(GPT-4o) to continuously suggest context-aware word and sentence\ncompletions/predictions during spelling. Online copy-spelling experiments\nencompassing four dialogue scenarios demonstrate that MindChat saves more than\n62\\% keystrokes and over 32\\% spelling time compared with traditional BCI\nspellers. We envision high-speed BCI spellers enhanced by LLMs will potentially\nlead to truly practical applications."}
{"id": "2507.21110", "pdf": "https://arxiv.org/pdf/2507.21110.pdf", "abs": "https://arxiv.org/abs/2507.21110", "title": "SemRAG: Semantic Knowledge-Augmented RAG for Improved Question-Answering", "authors": ["Kezhen Zhong", "Basem Suleiman", "Abdelkarim Erradi", "Shijing Chen"], "categories": ["cs.CL", "cs.AI", "cs.IR"], "comment": "16 pages, 12 figures", "summary": "This paper introduces SemRAG, an enhanced Retrieval Augmented Generation\n(RAG) framework that efficiently integrates domain-specific knowledge using\nsemantic chunking and knowledge graphs without extensive fine-tuning.\nIntegrating domain-specific knowledge into large language models (LLMs) is\ncrucial for improving their performance in specialized tasks. Yet, existing\nadaptations are computationally expensive, prone to overfitting and limit\nscalability. To address these challenges, SemRAG employs a semantic chunking\nalgorithm that segments documents based on the cosine similarity from sentence\nembeddings, preserving semantic coherence while reducing computational\noverhead. Additionally, by structuring retrieved information into knowledge\ngraphs, SemRAG captures relationships between entities, improving retrieval\naccuracy and contextual understanding. Experimental results on MultiHop RAG and\nWikipedia datasets demonstrate SemRAG has significantly enhances the relevance\nand correctness of retrieved information from the Knowledge Graph,\noutperforming traditional RAG methods. Furthermore, we investigate the\noptimization of buffer sizes for different data corpus, as optimizing buffer\nsizes tailored to specific datasets can further improve retrieval performance,\nas integration of knowledge graphs strengthens entity relationships for better\ncontextual comprehension. The primary advantage of SemRAG is its ability to\ncreate an efficient, accurate domain-specific LLM pipeline while avoiding\nresource-intensive fine-tuning. This makes it a practical and scalable approach\naligned with sustainability goals, offering a viable solution for AI\napplications in domain-specific fields."}
{"id": "2507.21462", "pdf": "https://arxiv.org/pdf/2507.21462.pdf", "abs": "https://arxiv.org/abs/2507.21462", "title": "Using Tactile Charts to Support Comprehension and Learning of Complex Visualizations for Blind and Low-Vision Individuals", "authors": ["Tingying He", "Maggie McCracken", "Daniel Hajas", "Sarah Creem-Regehr", "Alexander Lex"], "categories": ["cs.HC"], "comment": null, "summary": "We investigate whether tactile charts support comprehension and learning of\ncomplex visualizations for blind and low-vision (BLV) individuals and\ncontribute four tactile chart designs and an interview study. Visualizations\nare powerful tools for conveying data, yet BLV individuals typically can rely\nonly on assistive technologies -- primarily alternative texts -- to access this\ninformation. Prior research shows the importance of mental models of chart\ntypes for interpreting these descriptions, yet BLV individuals have no means to\nbuild such a mental model based on images of visualizations. Tactile charts\nshow promise to fill this gap in supporting the process of building mental\nmodels. Yet studies on tactile data representations mostly focus on simple\nchart types, and it is unclear whether they are also appropriate for more\ncomplex charts as would be found in scientific publications. Working with two\nBLV researchers, we designed 3D-printed tactile template charts with\nexploration instructions for four advanced chart types: UpSet plots, violin\nplots, clustered heatmaps, and faceted line charts. We then conducted an\ninterview study with 12 BLV participants comparing whether using our tactile\ntemplates improves mental models and understanding of charts and whether this\nunderstanding translates to novel datasets experienced through alt texts.\nThematic analysis shows that tactile models support chart type understanding\nand are the preferred learning method by BLV individuals. We also report\nparticipants' opinions on tactile chart design and their role in BLV education."}
{"id": "2507.21112", "pdf": "https://arxiv.org/pdf/2507.21112.pdf", "abs": "https://arxiv.org/abs/2507.21112", "title": "InsurTech innovation using natural language processing", "authors": ["Panyi Dong", "Zhiyu Quan"], "categories": ["cs.CL", "cs.LG", "stat.ML"], "comment": null, "summary": "With the rapid rise of InsurTech, traditional insurance companies are\nincreasingly exploring alternative data sources and advanced technologies to\nsustain their competitive edge. This paper provides both a conceptual overview\nand practical case studies of natural language processing (NLP) and its\nemerging applications within insurance operations with a focus on transforming\nraw, unstructured text into structured data suitable for actuarial analysis and\ndecision-making. Leveraging real-world alternative data provided by an\nInsurTech industry partner that enriches traditional insurance data sources, we\napply various NLP techniques to demonstrate practical use cases in the\ncommercial insurance context. These enriched, text-derived insights not only\nadd to and refine traditional rating factors for commercial insurance pricing\nbut also offer novel perspectives for assessing underlying risk by introducing\nnovel industry classifications. Through these demonstrations, we show that NLP\nis not merely a supplementary tool but a foundational element for modern,\ndata-driven insurance analytics."}
{"id": "2507.21490", "pdf": "https://arxiv.org/pdf/2507.21490.pdf", "abs": "https://arxiv.org/abs/2507.21490", "title": "Conversations over Clicks: Impact of Chatbots on Information Search in Interdisciplinary Learning", "authors": ["Hannah Kim", "Sergei L. Kosakovsky Pond", "Stephen MacNeil"], "categories": ["cs.HC", "cs.CY", "cs.IR", "J.3; K.3.2"], "comment": "9 pages, 2 tables, 3 figures, 2025 ASEE/IEEE Frontiers in Education\n  (FIE) Conference preprint", "summary": "This full research paper investigates the impact of generative AI (GenAI) on\nthe learner experience, with a focus on how learners engage with and utilize\nthe information it provides. In e-learning environments, learners often need to\nnavigate a complex information space on their own. This challenge is further\ncompounded in interdisciplinary fields like bioinformatics, due to the varied\nprior knowledge and backgrounds. In this paper, we studied how GenAI influences\ninformation search in bioinformatics research: (1) How do interactions with a\nGenAI chatbot influence learner orienteering behaviors?; and (2) How do\nlearners identify information scent in GenAI chatbot responses? We adopted an\nautoethnographic approach to investigate these questions. GenAI was found to\nsupport orienteering once a learning plan was established, but it was\ncounterproductive prior to that. Moreover, traditionally value-rich information\nsources such as bullet points and related terms proved less effective when\napplied to GenAI responses. Information scents were primarily recognized\nthrough the presence or absence of prior knowledge of the domain. These\nfindings suggest that GenAI should be adopted into e-learning environments with\ncaution, particularly in interdisciplinary learning contexts."}
{"id": "2507.21134", "pdf": "https://arxiv.org/pdf/2507.21134.pdf", "abs": "https://arxiv.org/abs/2507.21134", "title": "TRIDENT: Benchmarking LLM Safety in Finance, Medicine, and Law", "authors": ["Zheng Hui", "Yijiang River Dong", "Ehsan Shareghi", "Nigel Collier"], "categories": ["cs.CL", "cs.CY", "cs.LG"], "comment": null, "summary": "As large language models (LLMs) are increasingly deployed in high-risk\ndomains such as law, finance, and medicine, systematically evaluating their\ndomain-specific safety and compliance becomes critical. While prior work has\nlargely focused on improving LLM performance in these domains, it has often\nneglected the evaluation of domain-specific safety risks. To bridge this gap,\nwe first define domain-specific safety principles for LLMs based on the AMA\nPrinciples of Medical Ethics, the ABA Model Rules of Professional Conduct, and\nthe CFA Institute Code of Ethics. Building on this foundation, we introduce\nTrident-Bench, a benchmark specifically targeting LLM safety in the legal,\nfinancial, and medical domains. We evaluated 19 general-purpose and\ndomain-specialized models on Trident-Bench and show that it effectively reveals\nkey safety gaps -- strong generalist models (e.g., GPT, Gemini) can meet basic\nexpectations, whereas domain-specialized models often struggle with subtle\nethical nuances. This highlights an urgent need for finer-grained\ndomain-specific safety improvements. By introducing Trident-Bench, our work\nprovides one of the first systematic resources for studying LLM safety in law\nand finance, and lays the groundwork for future research aimed at reducing the\nsafety risks of deploying LLMs in professionally regulated fields. Code and\nbenchmark will be released at: https://github.com/zackhuiiiii/TRIDENT"}
{"id": "2507.21654", "pdf": "https://arxiv.org/pdf/2507.21654.pdf", "abs": "https://arxiv.org/abs/2507.21654", "title": "AI Literacy as a Key Driver of User Experience in AI-Powered Assessment: Insights from Socratic Mind", "authors": ["Meryem Yilmaz Soylu", "Jeonghyun Lee", "Jui-Tse Hung", "Christopher Zhang Cui", "David A. Joyner"], "categories": ["cs.HC", "cs.AI", "K.3.1; I.2.6"], "comment": "34 pages, 1 figure, 3 tables", "summary": "As Artificial Intelligence (AI) tools become increasingly embedded in higher\neducation, understanding how students interact with these systems is essential\nto supporting effective learning. This study examines how students' AI literacy\nand prior exposure to AI technologies shape their perceptions of Socratic Mind,\nan interactive AI-powered formative assessment tool. Drawing on\nSelf-Determination Theory and user experience research, we analyze\nrelationships among AI literacy, perceived usability, satisfaction, engagement,\nand perceived learning effectiveness. Data from 309 undergraduates in Computer\nScience and Business courses were collected through validated surveys. Partial\nleast squares structural equation modeling showed that AI literacy - especially\nself-efficacy, conceptual understanding, and application skills - significantly\npredicts usability, satisfaction, and engagement. Usability and satisfaction,\nin turn, strongly predict perceived learning effectiveness, while prior AI\nexposure showed no significant effect. These findings highlight that AI\nliteracy, rather than exposure alone, shapes student experiences. Designers\nshould integrate adaptive guidance and user-centered features to support\ndiverse literacy levels, fostering inclusive, motivating, and effective\nAI-based learning environments."}
{"id": "2507.21138", "pdf": "https://arxiv.org/pdf/2507.21138.pdf", "abs": "https://arxiv.org/abs/2507.21138", "title": "TTS-1 Technical Report", "authors": ["Oleg Atamanenko", "Anna Chalova", "Joseph Coombes", "Nikki Cope", "Phillip Dang", "Zhifeng Deng", "Jimmy Du", "Michael Ermolenko", "Feifan Fan", "Yufei Feng", "Cheryl Fichter", "Pavel Filimonov", "Louis Fischer", "Kylan Gibbs", "Valeria Gusarova", "Pavel Karpik", "Andreas Assad Kottner", "Ian Lee", "Oliver Louie", "Jasmine Mai", "Mikhail Mamontov", "Suri Mao", "Nurullah Morshed", "Igor Poletaev", "Florin Radu", "Dmytro Semernia", "Evgenii Shingarev", "Vikram Sivaraja", "Peter Skirko", "Rinat Takhautdinov", "Robert Villahermosa", "Jean Wang"], "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.SD", "eess.AS"], "comment": "20 pages, 10 figures. For associated modeling and training code, see\n  https://github.com/inworld-ai/tts", "summary": "We introduce Inworld TTS-1, a set of two Transformer-based autoregressive\ntext-to-speech (TTS) models. Our largest model, TTS-1-Max, has 8.8B parameters\nand is designed for utmost quality and expressiveness in demanding\napplications. TTS-1 is our most efficient model, with 1.6B parameters, built\nfor real-time speech synthesis and on-device use cases. By scaling train-time\ncompute and applying a sequential process of pre-training, fine-tuning, and\nRL-alignment of the speech-language model (SpeechLM) component, both models\nachieve state-of-the-art performance on a variety of benchmarks, demonstrating\nexceptional quality relying purely on in-context learning of the speaker's\nvoice. Inworld TTS-1 and TTS-1-Max can generate high-resolution 48 kHz speech\nwith low latency, and support 11 languages with fine-grained emotional control\nand non-verbal vocalizations through audio markups. We additionally open-source\nour training and modeling code under an MIT license."}
{"id": "2507.21722", "pdf": "https://arxiv.org/pdf/2507.21722.pdf", "abs": "https://arxiv.org/abs/2507.21722", "title": "Identification of Design Recommendations for Augmented Reality Authors in Corporate Training", "authors": ["Stefan Graser", "Martin Schrepp", "Stephan Böhm"], "categories": ["cs.HC", "cs.SE"], "comment": "9 pages, 1 table, 1 figure", "summary": "Innovative technologies, such as Augmented Reality (AR), introduce new\ninteraction paradigms, demanding the identification of software requirements\nduring the software development process. In general, design recommendations are\nrelated to this, supporting the design of applications positively and meeting\nstakeholder needs. However, current research lacks context-specific AR design\nrecommendations. This study addresses this gap by identifying and analyzing\npractical AR design recommendations relevant to the evaluation phase of the\nUser-Centered Design (UCD) process. We rely on an existing dataset of Mixed\nReality (MR) design recommendations. We applied a multi-method approach by (1)\nextending the dataset with AR-specific recommendations published since 2020,\n(2) classifying the identified recommendations using a NLP classification\napproach based on a pre-trained Sentence Transformer model, (3) summarizing the\ncontent of all topics, and (4) evaluating their relevance concerning AR in\nCorporate Training (CT) both based on a qualitative Round Robin approach with\nfive experts. As a result, an updated dataset of 597 practitioner design\nrecommendations, classified into 84 topics, is provided with new insights into\ntheir applicability in the context of AR in CT. Based on this, 32 topics with a\ntotal of 284 statements were evaluated as relevant for AR in CT. This research\ndirectly contributes to the authors' work for extending their AR-specific User\nExperience (UX) measurement approach, supporting AR authors in targeting the\nimprovement of AR applications for CT scenarios."}
{"id": "2507.21168", "pdf": "https://arxiv.org/pdf/2507.21168.pdf", "abs": "https://arxiv.org/abs/2507.21168", "title": "Diverse LLMs or Diverse Question Interpretations? That is the Ensembling Question", "authors": ["Rafael Rosales", "Santiago Miret"], "categories": ["cs.CL", "cs.AI", "cs.LG", "68T50", "I.2.7; I.2.0"], "comment": null, "summary": "Effectively leveraging diversity has been shown to improve performance for\nvarious machine learning models, including large language models (LLMs).\nHowever, determining the most effective way of using diversity remains a\nchallenge. In this work, we compare two diversity approaches for answering\nbinary questions using LLMs: model diversity, which relies on multiple models\nanswering the same question, and question interpretation diversity, which\nrelies on using the same model to answer the same question framed in different\nways. For both cases, we apply majority voting as the ensemble consensus\nheuristic to determine the final answer. Our experiments on boolq, strategyqa,\nand pubmedqa show that question interpretation diversity consistently leads to\nbetter ensemble accuracy compared to model diversity. Furthermore, our analysis\nof GPT and LLaMa shows that model diversity typically produces results between\nthe best and the worst ensemble members without clear improvement."}
{"id": "2507.21811", "pdf": "https://arxiv.org/pdf/2507.21811.pdf", "abs": "https://arxiv.org/abs/2507.21811", "title": "Helping or Homogenizing? GenAI as a Design Partner to Pre-Service SLPs for Just-in-Time Programming of AAC", "authors": ["Cynthia Zastudil", "Christine Holyfield", "Christine Kapp", "Kate Hamilton", "Kriti Baru", "Liam Newsam", "June A. Smith", "Stephen MacNeil"], "categories": ["cs.HC"], "comment": null, "summary": "Augmentative and alternative communication (AAC) devices are used by many\npeople around the world who experience difficulties in communicating verbally.\nOne AAC device which is especially useful for minimally verbal autistic\nchildren in developing language and communication skills are visual scene\ndisplays (VSD). VSDs use images with interactive hotspots embedded in them to\ndirectly connect language to real-world contexts which are meaningful to the\nAAC user. While VSDs can effectively support emergent communicators, their\nwidespread adoption is impacted by how difficult these devices are to\nconfigure. We developed a prototype that uses generative AI to automatically\nsuggest initial hotspots on an image to help non-experts efficiently create\nVSDs. We conducted a within-subjects user study to understand how effective our\nprototype is in supporting non-expert users, specifically pre-service\nspeech-language pathologists (SLP) who are not familiar with VSDs as an AAC\nintervention. Pre-service SLPs are actively studying to become clinically\ncertified SLPs and have domain-specific knowledge about language and\ncommunication skill development. We evaluated the effectiveness of our\nprototype based on creation time, quality, and user confidence. We also\nanalyzed the relevance and developmental appropriateness of the automatically\ngenerated hotspots and how often users interacted with the generated hotspots.\nOur results were mixed with SLPs becoming more efficient and confident.\nHowever, there were multiple negative impacts as well, including over-reliance\nand homogenization of communication options. The implications of these findings\nreach beyond the domain of AAC, especially as generative AI becomes more\nprevalent across domains, including assistive technology. Future work is needed\nto further identify and address these risks associated with integrating\ngenerative AI into assistive technology."}
{"id": "2507.21186", "pdf": "https://arxiv.org/pdf/2507.21186.pdf", "abs": "https://arxiv.org/abs/2507.21186", "title": "Contrast-CAT: Contrasting Activations for Enhanced Interpretability in Transformer-based Text Classifiers", "authors": ["Sungmin Han", "Jeonghyun Lee", "Sangkyun Lee"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Transformers have profoundly influenced AI research, but explaining their\ndecisions remains challenging -- even for relatively simpler tasks such as\nclassification -- which hinders trust and safe deployment in real-world\napplications. Although activation-based attribution methods effectively explain\ntransformer-based text classification models, our findings reveal that these\nmethods can be undermined by class-irrelevant features within activations,\nleading to less reliable interpretations. To address this limitation, we\npropose Contrast-CAT, a novel activation contrast-based attribution method that\nrefines token-level attributions by filtering out class-irrelevant features. By\ncontrasting the activations of an input sequence with reference activations,\nContrast-CAT generates clearer and more faithful attribution maps. Experimental\nresults across various datasets and models confirm that Contrast-CAT\nconsistently outperforms state-of-the-art methods. Notably, under the MoRF\nsetting, it achieves average improvements of x1.30 in AOPC and x2.25 in LOdds\nover the most competing methods, demonstrating its effectiveness in enhancing\ninterpretability for transformer-based text classification."}
{"id": "2507.21837", "pdf": "https://arxiv.org/pdf/2507.21837.pdf", "abs": "https://arxiv.org/abs/2507.21837", "title": "VeasyGuide: Personalized Visual Guidance for Low-vision Learners on Instructor Actions in Presentation Videos", "authors": ["Yotam Sechayk", "Ariel Shamir", "Amy Pavel", "Takeo Igarashi"], "categories": ["cs.HC"], "comment": "ASSETS '25, Denver, CO, USA", "summary": "Instructors often rely on visual actions such as pointing, marking, and\nsketching to convey information in educational presentation videos. These\nsubtle visual cues often lack verbal descriptions, forcing low-vision (LV)\nlearners to search for visual indicators or rely solely on audio, which can\nlead to missed information and increased cognitive load. To address this\nchallenge, we conducted a co-design study with three LV participants and\ndeveloped VeasyGuide, a tool that uses motion detection to identify instructor\nactions and dynamically highlight and magnify them. VeasyGuide produces\nfamiliar visual highlights that convey spatial context and adapt to diverse\nlearners and content through extensive personalization and real-time visual\nfeedback. VeasyGuide reduces visual search effort by clarifying what to look\nfor and where to look. In an evaluation with 8 LV participants, learners\ndemonstrated a significant improvement in detecting instructor actions, with\nfaster response times and significantly reduced cognitive load. A separate\nevaluation with 8 sighted participants showed that VeasyGuide also enhanced\nengagement and attentiveness, suggesting its potential as a universally\nbeneficial tool."}
{"id": "2507.21234", "pdf": "https://arxiv.org/pdf/2507.21234.pdf", "abs": "https://arxiv.org/abs/2507.21234", "title": "Understanding Public Perception of Crime in Bangladesh: A Transformer-Based Approach with Explainability", "authors": ["Fatema Binte Hassan", "Md Al Jubair", "Mohammad Mehadi Hasan", "Tahmid Hossain", "S M Mehebubur Rahman Khan Shuvo", "Mohammad Shamsul Arefin"], "categories": ["cs.CL"], "comment": null, "summary": "In recent years, social media platforms have become prominent spaces for\nindividuals to express their opinions on ongoing events, including criminal\nincidents. As a result, public sentiment can shift dynamically over time. This\nstudy investigates the evolving public perception of crime-related news by\nclassifying user-generated comments into three categories: positive, negative,\nand neutral. A newly curated dataset comprising 28,528 Bangla-language social\nmedia comments was developed for this purpose. We propose a transformer-based\nmodel utilizing the XLM-RoBERTa Base architecture, which achieves a\nclassification accuracy of 97%, outperforming existing state-of-the-art methods\nin Bangla sentiment analysis. To enhance model interpretability, explainable AI\ntechnique is employed to identify the most influential features driving\nsentiment classification. The results underscore the effectiveness of\ntransformer-based models in processing low-resource languages such as Bengali\nand demonstrate their potential to extract actionable insights that can support\npublic policy formulation and crime prevention strategies."}
{"id": "2507.21900", "pdf": "https://arxiv.org/pdf/2507.21900.pdf", "abs": "https://arxiv.org/abs/2507.21900", "title": "Leveraging LLMs for Persona-Based Visualization of Election Data", "authors": ["Swaroop Panda", "Arun Kumar Sekar"], "categories": ["cs.HC"], "comment": null, "summary": "Visualizations are essential tools for disseminating information regarding\nelections and their outcomes, potentially influencing public perceptions.\nPersonas, delineating distinctive segments within the populace, furnish a\nvaluable framework for comprehending the nuanced perspectives, requisites, and\nbehaviors of diverse voter demographics. In this work, we propose making\nvisualizations tailored to these personas to make election information easier\nto understand and more relevant. Using data from UK parliamentary elections and\nnew developments in Large Language Models (LLMs), we create personas that\nencompass the diverse demographics, technological preferences, voting\ntendencies, and information consumption patterns observed among\nvoters.Subsequently, we elucidate how these personas can inform the design of\nvisualizations through specific design criteria. We then provide illustrative\nexamples of visualization prototypes based on these criteria and evaluate these\nprototypes using these personas and LLMs. We finally propose some actionable\ninsights based upon the framework and the different design artifacts."}
{"id": "2507.21242", "pdf": "https://arxiv.org/pdf/2507.21242.pdf", "abs": "https://arxiv.org/abs/2507.21242", "title": "Bangla BERT for Hyperpartisan News Detection: A Semi-Supervised and Explainable AI Approach", "authors": ["Mohammad Mehadi Hasan", "Fatema Binte Hassan", "Md Al Jubair", "Zobayer Ahmed", "Sazzatul Yeakin", "Md Masum Billah"], "categories": ["cs.CL"], "comment": null, "summary": "In the current digital landscape, misinformation circulates rapidly, shaping\npublic perception and causing societal divisions. It is difficult to identify\nhyperpartisan news in Bangla since there aren't many sophisticated natural\nlanguage processing methods available for this low-resource language. Without\neffective detection methods, biased content can spread unchecked, posing\nserious risks to informed discourse. To address this gap, our research\nfine-tunes Bangla BERT. This is a state-of-the-art transformer-based model,\ndesigned to enhance classification accuracy for hyperpartisan news. We evaluate\nits performance against traditional machine learning models and implement\nsemi-supervised learning to enhance predictions further. Not only that, we use\nLIME to provide transparent explanations of the model's decision-making\nprocess, which helps to build trust in its outcomes. With a remarkable accuracy\nscore of 95.65%, Bangla BERT outperforms conventional approaches, according to\nour trial data. The findings of this study demonstrate the usefulness of\ntransformer models even in environments with limited resources, which opens the\ndoor to further improvements in this area."}
{"id": "2507.21953", "pdf": "https://arxiv.org/pdf/2507.21953.pdf", "abs": "https://arxiv.org/abs/2507.21953", "title": "MapAgent: Trajectory-Constructed Memory-Augmented Planning for Mobile Task Automation", "authors": ["Yi Kong", "Dianxi Shi", "Guoli Yang", "Zhang ke-di", "Chenlin Huang", "Xiaopeng Li", "Songchang Jin"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "The recent advancement of autonomous agents powered by Large Language Models\n(LLMs) has demonstrated significant potential for automating tasks on mobile\ndevices through graphical user interfaces (GUIs). Despite initial progress,\nthese agents still face challenges when handling complex real-world tasks.\nThese challenges arise from a lack of knowledge about real-life mobile\napplications in LLM-based agents, which may lead to ineffective task planning\nand even cause hallucinations. To address these challenges, we propose a novel\nLLM-based agent framework called MapAgent that leverages memory constructed\nfrom historical trajectories to augment current task planning. Specifically, we\nfirst propose a trajectory-based memory mechanism that transforms task\nexecution trajectories into a reusable and structured page-memory database.\nEach page within a trajectory is extracted as a compact yet comprehensive\nsnapshot, capturing both its UI layout and functional context. Secondly, we\nintroduce a coarse-to-fine task planning approach that retrieves relevant pages\nfrom the memory database based on similarity and injects them into the LLM\nplanner to compensate for potential deficiencies in understanding real-world\napp scenarios, thereby achieving more informed and context-aware task planning.\nFinally, planned tasks are transformed into executable actions through a task\nexecutor supported by a dual-LLM architecture, ensuring effective tracking of\ntask progress. Experimental results in real-world scenarios demonstrate that\nMapAgent achieves superior performance to existing methods. The code will be\nopen-sourced to support further research."}
{"id": "2507.21302", "pdf": "https://arxiv.org/pdf/2507.21302.pdf", "abs": "https://arxiv.org/abs/2507.21302", "title": "Can human clinical rationales improve the performance and explainability of clinical text classification models?", "authors": ["Christoph Metzner", "Shang Gao", "Drahomira Herrmannova", "Heidi A. Hanson"], "categories": ["cs.CL"], "comment": null, "summary": "AI-driven clinical text classification is vital for explainable automated\nretrieval of population-level health information. This work investigates\nwhether human-based clinical rationales can serve as additional supervision to\nimprove both performance and explainability of transformer-based models that\nautomatically encode clinical documents. We analyzed 99,125 human-based\nclinical rationales that provide plausible explanations for primary cancer site\ndiagnoses, using them as additional training samples alongside 128,649\nelectronic pathology reports to evaluate transformer-based models for\nextracting primary cancer sites. We also investigated sufficiency as a way to\nmeasure rationale quality for pre-selecting rationales. Our results showed that\nclinical rationales as additional training data can improve model performance\nin high-resource scenarios but produce inconsistent behavior when resources are\nlimited. Using sufficiency as an automatic metric to preselect rationales also\nleads to inconsistent results. Importantly, models trained on rationales were\nconsistently outperformed by models trained on additional reports instead. This\nsuggests that clinical rationales don't consistently improve model performance\nand are outperformed by simply using more reports. Therefore, if the goal is\noptimizing accuracy, annotation efforts should focus on labeling more reports\nrather than creating rationales. However, if explainability is the priority,\ntraining models on rationale-supplemented data may help them better identify\nrationale-like features. We conclude that using clinical rationales as\nadditional training data results in smaller performance improvements and only\nslightly better explainability (measured as average token-level rationale\ncoverage) compared to training on additional reports."}
{"id": "2507.22051", "pdf": "https://arxiv.org/pdf/2507.22051.pdf", "abs": "https://arxiv.org/abs/2507.22051", "title": "DataSway: Vivifying Metaphoric Visualization with Animation Clip Generation and Coordination", "authors": ["Liwenhan Xie", "Jiayi Zhou", "Anyi Rao", "Huamin Qu", "Xinhuan Shu"], "categories": ["cs.HC"], "comment": "19 pages, 5 figures", "summary": "Animating metaphoric visualizations brings data to life, enhancing the\ncomprehension of abstract data encodings and fostering deeper engagement.\nHowever, creators face significant challenges in designing these animations,\nsuch as crafting motions that align semantically with the metaphors,\nmaintaining faithful data representation during animation, and seamlessly\nintegrating interactivity. We propose a human-AI co-creation workflow that\nfacilitates creating animations for SVG-based metaphoric visualizations. Users\ncan initially derive animation clips for data elements from vision-language\nmodels (VLMs) and subsequently coordinate their timelines based on entity\norder, attribute values, spatial layout, or randomness. Our design decisions\nwere informed by a formative study with experienced designers (N=8). We further\ndeveloped a prototype, DataSway, and conducted a user study (N=14) to evaluate\nits creativity support and usability. A gallery with 6 cases demonstrates its\ncapabilities and applications in web-based hypermedia. We conclude with\nimplications for future research on bespoke data visualization animation."}
{"id": "2507.21319", "pdf": "https://arxiv.org/pdf/2507.21319.pdf", "abs": "https://arxiv.org/abs/2507.21319", "title": "Do Large Language Models Understand Morality Across Cultures?", "authors": ["Hadi Mohammadi", "Yasmeen F. S. S. Meijer", "Efthymia Papadopoulou", "Ayoub Bagheri"], "categories": ["cs.CL"], "comment": null, "summary": "Recent advancements in large language models (LLMs) have established them as\npowerful tools across numerous domains. However, persistent concerns about\nembedded biases, such as gender, racial, and cultural biases arising from their\ntraining data, raise significant questions about the ethical use and societal\nconsequences of these technologies. This study investigates the extent to which\nLLMs capture cross-cultural differences and similarities in moral perspectives.\nSpecifically, we examine whether LLM outputs align with patterns observed in\ninternational survey data on moral attitudes. To this end, we employ three\ncomplementary methods: (1) comparing variances in moral scores produced by\nmodels versus those reported in surveys, (2) conducting cluster alignment\nanalyses to assess correspondence between country groupings derived from LLM\noutputs and survey data, and (3) directly probing models with comparative\nprompts using systematically chosen token pairs. Our results reveal that\ncurrent LLMs often fail to reproduce the full spectrum of cross-cultural moral\nvariation, tending to compress differences and exhibit low alignment with\nempirical survey patterns. These findings highlight a pressing need for more\nrobust approaches to mitigate biases and improve cultural representativeness in\nLLMs. We conclude by discussing the implications for the responsible\ndevelopment and global deployment of LLMs, emphasizing fairness and ethical\nalignment."}
{"id": "2507.21054", "pdf": "https://arxiv.org/pdf/2507.21054.pdf", "abs": "https://arxiv.org/abs/2507.21054", "title": "High hopes for \"Deep Medicine\"? AI, economics, and the future of care", "authors": ["Robert Sparrow", "Joshua Hatherley"], "categories": ["cs.CY", "cs.AI", "cs.HC", "cs.LG"], "comment": null, "summary": "In the much-celebrated book Deep Medicine, Eric Topol argues that the\ndevelopment of artificial intelligence for health care will lead to a dramatic\nshift in the culture and practice of medicine. In the next several decades, he\nsuggests, AI will become sophisticated enough that many of the everyday tasks\nof physicians could be delegated to it. Topol is perhaps the most articulate\nadvocate of the benefits of AI in medicine, but he is hardly alone in spruiking\nits potential to allow physicians to dedicate more of their time and attention\nto providing empathetic care for their patients in the future. Unfortunately,\nseveral factors suggest a radically different picture for the future of health\ncare. Far from facilitating a return to a time of closer doctor-patient\nrelationships, the use of medical AI seems likely to further erode therapeutic\nrelationships and threaten professional and patient satisfaction."}
{"id": "2507.21331", "pdf": "https://arxiv.org/pdf/2507.21331.pdf", "abs": "https://arxiv.org/abs/2507.21331", "title": "A Deep Learning Automatic Speech Recognition Model for Shona Language", "authors": ["Leslie Wellington Sirora", "Mainford Mutandavari"], "categories": ["cs.CL", "cs.SD", "eess.AS"], "comment": null, "summary": "This study presented the development of a deep learning-based Automatic\nSpeech Recognition system for Shona, a low-resource language characterized by\nunique tonal and grammatical complexities. The research aimed to address the\nchallenges posed by limited training data, lack of labelled data, and the\nintricate tonal nuances present in Shona speech, with the objective of\nachieving significant improvements in recognition accuracy compared to\ntraditional statistical models. The research first explored the feasibility of\nusing deep learning to develop an accurate ASR system for Shona. Second, it\ninvestigated the specific challenges involved in designing and implementing\ndeep learning architectures for Shona speech recognition and proposed\nstrategies to mitigate these challenges. Lastly, it compared the performance of\nthe deep learning-based model with existing statistical models in terms of\naccuracy. The developed ASR system utilized a hybrid architecture consisting of\na Convolutional Neural Network for acoustic modelling and a Long Short-Term\nMemory network for language modelling. To overcome the scarcity of data, data\naugmentation techniques and transfer learning were employed. Attention\nmechanisms were also incorporated to accommodate the tonal nature of Shona\nspeech. The resulting ASR system achieved impressive results, with a Word Error\nRate of 29%, Phoneme Error Rate of 12%, and an overall accuracy of 74%. These\nmetrics indicated the potential of deep learning to enhance ASR accuracy for\nunder-resourced languages like Shona. This study contributed to the advancement\nof ASR technology for under-resourced languages like Shona, ultimately\nfostering improved accessibility and communication for Shona speakers\nworldwide."}
{"id": "2507.21065", "pdf": "https://arxiv.org/pdf/2507.21065.pdf", "abs": "https://arxiv.org/abs/2507.21065", "title": "Dialogic Social Learning for Artificial Agents: Enhancing LLM Ontology Acquisition through Mixed-Initiative Educational Interactions", "authors": ["Sabrina Patania", "Luca Annese", "Cansu Koyuturk", "Azzurra Ruggeri", "Dimitri Ognibene"], "categories": ["cs.CL", "cs.HC", "cs.LG", "cs.RO", "I.2.7, I.2.9, j.4,"], "comment": "submitted to ICSR2025", "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nprocessing extensive offline datasets. However, they often face challenges in\nacquiring and integrating complex, knowledge online. Traditional AI training\nparadigms, predominantly based on supervised learning or reinforcement\nlearning, mirror a 'Piagetian' model of independent exploration. These\napproaches typically rely on large datasets and sparse feedback signals,\nlimiting the models' ability to learn efficiently from interactions. Drawing\ninspiration from Vygotsky's sociocultural theory, this study explores the\npotential of socially mediated learning paradigms to address these limitations.\n  We introduce a dynamic environment, termed the 'AI Social Gym', where an AI\nlearner agent engages in dyadic pedagogical dialogues with knowledgeable AI\nteacher agents. These interactions emphasize external, structured dialogue as a\ncore mechanism for knowledge acquisition, contrasting with methods that depend\nsolely on internal inference or pattern recognition.\n  Our investigation focuses on how different pedagogical strategies impact the\nAI learning process in the context of ontology acquisition. Empirical results\nindicate that such dialogic approaches-particularly those involving\nmixed-direction interactions combining top-down explanations with\nlearner-initiated questioning-significantly enhance the LLM's ability to\nacquire and apply new knowledge, outperforming both unidirectional\ninstructional methods and direct access to structured knowledge, formats\ntypically present in training datasets.\n  These findings suggest that integrating pedagogical and psychological\ninsights into AI and robot training can substantially improve post-training\nknowledge acquisition and response quality. This approach offers a\ncomplementary pathway to existing strategies like prompt engineering"}
{"id": "2507.21340", "pdf": "https://arxiv.org/pdf/2507.21340.pdf", "abs": "https://arxiv.org/abs/2507.21340", "title": "StructText: A Synthetic Table-to-Text Approach for Benchmark Generation with Multi-Dimensional Evaluation", "authors": ["Satyananda Kashyap", "Sola Shirai", "Nandana Mihindukulasooriya", "Horst Samulowitz"], "categories": ["cs.CL", "cs.AI", "cs.DB", "cs.IR"], "comment": "Data available:\n  https://huggingface.co/datasets/ibm-research/struct-text and code available\n  at: https://github.com/ibm/struct-text", "summary": "Extracting structured information from text, such as key-value pairs that\ncould augment tabular data, is quite useful in many enterprise use cases.\nAlthough large language models (LLMs) have enabled numerous automated pipelines\nfor converting natural language into structured formats, there is still a lack\nof benchmarks for evaluating their extraction quality, especially in specific\ndomains or focused documents specific to a given organization. Building such\nbenchmarks by manual annotations is labour-intensive and limits the size and\nscalability of the benchmarks. In this work, we present StructText, an\nend-to-end framework for automatically generating high-fidelity benchmarks for\nkey-value extraction from text using existing tabular data. It uses available\ntabular data as structured ground truth, and follows a two-stage\n``plan-then-execute'' pipeline to synthetically generate corresponding\nnatural-language text. To ensure alignment between text and structured source,\nwe introduce a multi-dimensional evaluation strategy that combines (a)\nLLM-based judgments on factuality, hallucination, and coherence and (b)\nobjective extraction metrics measuring numeric and temporal accuracy. We\nevaluated the proposed method on 71,539 examples across 49 datasets. Results\nreveal that while LLMs achieve strong factual accuracy and avoid hallucination,\nthey struggle with narrative coherence in producing extractable text. Notably,\nmodels presume numerical and temporal information with high fidelity yet this\ninformation becomes embedded in narratives that resist automated extraction. We\nrelease a framework, including datasets, evaluation tools, and baseline\nextraction systems, to support continued research."}
{"id": "2507.21067", "pdf": "https://arxiv.org/pdf/2507.21067.pdf", "abs": "https://arxiv.org/abs/2507.21067", "title": "SynLang and Symbiotic Epistemology: A Manifesto for Conscious Human-AI Collaboration", "authors": ["Jan Kapusta"], "categories": ["cs.AI", "cs.CY", "cs.HC"], "comment": "32 pages, 4 figures. Includes 2 Appendices containing SynLang v1.2.0\n  protocol specification, and formal BNF grammar", "summary": "Current AI systems rely on opaque reasoning processes that hinder human\noversight and collaborative potential. Conventional explainable AI approaches\noffer post-hoc justifications and often fail to establish genuine symbiotic\ncollaboration. In this paper, the Symbiotic Epistemology is presented as a\nphilosophical foundation for human-AI cognitive partnerships. Unlike frameworks\nthat treat AI as a mere tool or replacement, symbiotic epistemology positions\nAI as a reasoning partner, fostering calibrated trust by aligning human\nconfidence with AI reliability through explicit reasoning patterns and\nconfidence assessments. SynLang (Symbiotic Syntactic Language) is introduced as\na formal protocol for transparent human-AI collaboration. The framework is\nempirically validated through actual human-AI dialogues demonstrating AI's\nadaptation to structured reasoning protocols and successful metacognitive\nintervention. The protocol defines two complementary mechanisms: TRACE for\nhigh-level reasoning patterns and TRACE_FE for detailed factor explanations. It\nalso integrates confidence quantification, declarative control over AI\nbehavior, and context inheritance for multi-agent coordination. By structuring\ncommunication and embedding confidence-calibrated transparency, SynLang,\ntogether with symbiotic epistemology, enables AI systems that enhance human\nintelligence, preserve human agency, and uphold ethical accountability in\ncollaborative decision-making. Through dual-level transparency, beginning with\nhigh-level reasoning patterns and progressing to granular explanations, the\nprotocol facilitates rapid comprehension and supports thorough verification of\nAI decision-making."}
{"id": "2507.21369", "pdf": "https://arxiv.org/pdf/2507.21369.pdf", "abs": "https://arxiv.org/abs/2507.21369", "title": "Turbocharging Web Automation: The Impact of Compressed History States", "authors": ["Xiyue Zhu", "Peng Tang", "Haofu Liao", "Srikar Appalaraju"], "categories": ["cs.CL"], "comment": null, "summary": "Language models have led to a leap forward in web automation. The current web\nautomation approaches take the current web state, history actions, and language\ninstruction as inputs to predict the next action, overlooking the importance of\nhistory states. However, the highly verbose nature of web page states can\nresult in long input sequences and sparse information, hampering the effective\nutilization of history states. In this paper, we propose a novel web history\ncompressor approach to turbocharge web automation using history states. Our\napproach employs a history compressor module that distills the most\ntask-relevant information from each history state into a fixed-length short\nrepresentation, mitigating the challenges posed by the highly verbose history\nstates. Experiments are conducted on the Mind2Web and WebLINX datasets to\nevaluate the effectiveness of our approach. Results show that our approach\nobtains 1.2-5.4% absolute accuracy improvements compared to the baseline\napproach without history inputs."}
{"id": "2507.21069", "pdf": "https://arxiv.org/pdf/2507.21069.pdf", "abs": "https://arxiv.org/abs/2507.21069", "title": "GAITEX: Human motion dataset from impaired gait and rehabilitation exercises of inertial and optical sensor data", "authors": ["Andreas Spilz", "Heiko Oppel", "Jochen Werner", "Kathrin Stucke-Straub", "Felix Capanni", "Michael Munz"], "categories": ["cs.CV", "cs.AI", "cs.HC"], "comment": null, "summary": "Wearable inertial measurement units (IMUs) offer a cost-effective and\nscalable means to assess human movement quality in clinical and everyday\nsettings. However, the development of robust sensor-based classification models\nfor physiotherapeutic exercises and gait analysis requires large, diverse\ndatasets, which are costly and time-consuming to collect. Here, we present a\nmultimodal dataset of physiotherapeutic exercises - including correct and\nclinically relevant variants - and gait-related exercises - including both\nnormal and impaired gait patterns - recorded from 19 participants using\nsynchronized IMUs and marker-based motion capture (MoCap). The dataset includes\nraw data from nine IMUs and thirty-five optical markers capturing full-body\nkinematics. Each IMU is additionally equipped with four optical markers,\nenabling precise comparison between IMU-derived orientation estimates and\nreference values from the MoCap system. To support further analysis, we also\nprovide processed IMU orientations aligned with common segment coordinate\nsystems, subject-specific OpenSim models, inverse kinematics results, and tools\nfor visualizing IMU orientations in the musculoskeletal context. Detailed\nannotations of movement execution quality and time-stamped segmentations\nsupport diverse analysis goals. This dataset supports the development and\nbenchmarking of machine learning models for tasks such as automatic exercise\nevaluation, gait analysis, temporal activity segmentation, and biomechanical\nparameter estimation. To facilitate reproducibility, we provide code for\npostprocessing, sensor-to-segment alignment, inverse kinematics computation,\nand technical validation. This resource is intended to accelerate research in\nmachine learning-driven human movement analysis."}
{"id": "2507.21428", "pdf": "https://arxiv.org/pdf/2507.21428.pdf", "abs": "https://arxiv.org/abs/2507.21428", "title": "MemTool: Optimizing Short-Term Memory Management for Dynamic Tool Calling in LLM Agent Multi-Turn Conversations", "authors": ["Elias Lumer", "Anmol Gulati", "Vamse Kumar Subbiah", "Pradeep Honaganahalli Basavaraju", "James A. Burke"], "categories": ["cs.CL"], "comment": "23 Pages, 20 Figures", "summary": "Large Language Model (LLM) agents have shown significant autonomous\ncapabilities in dynamically searching and incorporating relevant tools or Model\nContext Protocol (MCP) servers for individual queries. However, fixed context\nwindows limit effectiveness in multi-turn interactions requiring repeated,\nindependent tool usage. We introduce MemTool, a short-term memory framework\nenabling LLM agents to dynamically manage tools or MCP server contexts across\nmulti-turn conversations. MemTool offers three agentic architectures: 1)\nAutonomous Agent Mode, granting full tool management autonomy, 2) Workflow\nMode, providing deterministic control without autonomy, and 3) Hybrid Mode,\ncombining autonomous and deterministic control. Evaluating each MemTool mode\nacross 13+ LLMs on the ScaleMCP benchmark, we conducted experiments over 100\nconsecutive user interactions, measuring tool removal ratios (short-term memory\nefficiency) and task completion accuracy. In Autonomous Agent Mode, reasoning\nLLMs achieve high tool-removal efficiency (90-94% over a 3-window average),\nwhile medium-sized models exhibit significantly lower efficiency (0-60%).\nWorkflow and Hybrid modes consistently manage tool removal effectively, whereas\nAutonomous and Hybrid modes excel at task completion. We present trade-offs and\nrecommendations for each MemTool mode based on task accuracy, agency, and model\ncapabilities."}
{"id": "2507.21073", "pdf": "https://arxiv.org/pdf/2507.21073.pdf", "abs": "https://arxiv.org/abs/2507.21073", "title": "Product vs. Process: Exploring EFL Students' Editing of AI-Generated Text for Expository Writing", "authors": ["David James Woo", "Yangyang Yu", "Kai Guo", "Yilin Huang", "April Ka Yeng Fung"], "categories": ["cs.CL", "cs.HC"], "comment": "45 pages, 11 figures", "summary": "Text generated by artificial intelligence (AI) chatbots is increasingly used\nin English as a foreign language (EFL) writing contexts, yet its impact on\nstudents' expository writing process and compositions remains understudied.\nThis research examines how EFL secondary students edit AI-generated text.\nExploring editing behaviors in their expository writing process and in\nexpository compositions, and their effect on human-rated scores for content,\norganization, language, and overall quality. Participants were 39 Hong Kong\nsecondary students who wrote an expository composition with AI chatbots in a\nworkshop. A convergent design was employed to analyze their screen recordings\nand compositions to examine students' editing behaviors and writing qualities.\nAnalytical methods included qualitative coding, descriptive statistics,\ntemporal sequence analysis, human-rated scoring, and multiple linear regression\nanalysis. We analyzed over 260 edits per dataset, and identified two editing\npatterns: one where students refined introductory units repeatedly before\nprogressing, and another where they quickly shifted to extensive edits in body\nunits (e.g., topic and supporting sentences). MLR analyses revealed that the\nnumber of AI-generated words positively predicted all score dimensions, while\nmost editing variables showed minimal impact. These results suggest a\ndisconnect between students' significant editing effort and improved\ncomposition quality, indicating AI supports but does not replace writing\nskills. The findings highlight the importance of genre-specific instruction and\nprocess-focused writing before AI integration. Educators should also develop\nassessments valuing both process and product to encourage critical engagement\nwith AI text."}
{"id": "2507.21432", "pdf": "https://arxiv.org/pdf/2507.21432.pdf", "abs": "https://arxiv.org/abs/2507.21432", "title": "Towards Locally Deployable Fine-Tuned Causal Large Language Models for Mode Choice Behaviour", "authors": ["Tareq Alsaleh", "Bilal Farooq"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "This study investigates the adoption of open-access, locally deployable\ncausal large language models (LLMs) for travel mode choice prediction and\nintroduces LiTransMC, the first fine-tuned causal LLM developed for this task.\nWe systematically benchmark eleven LLMs (1-12B parameters) across three stated\nand revealed preference datasets, testing 396 configurations and generating\nover 79,000 synthetic commuter predictions. Beyond predictive accuracy, we\nevaluate models generated reasoning using BERTopic for topic modelling and a\nnovel Explanation Strength Index, providing the first structured analysis of\nhow LLMs articulate decision factors in alignment with behavioural theory.\nLiTransMC, fine-tuned using parameter efficient and loss masking strategy,\nachieved a weighted F1 score of 0.6845 and a Jensen-Shannon Divergence of\n0.000245, surpassing both untuned local models and larger proprietary systems,\nincluding GPT-4o with advanced persona inference and embedding-based loading,\nwhile also outperforming classical mode choice methods such as discrete choice\nmodels and machine learning classifiers for the same dataset. This dual\nimprovement, i.e., high instant-level accuracy and near-perfect distributional\ncalibration, demonstrates the feasibility of creating specialist, locally\ndeployable LLMs that integrate prediction and interpretability. Through\ncombining structured behavioural prediction with natural language reasoning,\nthis work unlocks the potential for conversational, multi-task transport models\ncapable of supporting agent-based simulations, policy testing, and behavioural\ninsight generation. These findings establish a pathway for transforming general\npurpose LLMs into specialized, explainable tools for transportation research\nand policy formulation, while maintaining privacy, reducing cost, and\nbroadening access through local deployment."}
{"id": "2507.21093", "pdf": "https://arxiv.org/pdf/2507.21093.pdf", "abs": "https://arxiv.org/abs/2507.21093", "title": "Barriers to Digital Mental Health Services among College Students", "authors": ["Ha Na Cho", "Kyuha Jung", "Daniel Eisenberg", "Cheryl A. King", "Kai Zheng"], "categories": ["cs.CY", "cs.HC"], "comment": null, "summary": "This qualitative study explores barriers to utilization of digital mental\nhealth Intervention (DMHI) among college students. Data are from a large\nrandomized clinical trial of an intervention, eBridge, that used motivational\ninterviewing for online counseling to connect students with mental health\nissues to professional services. We applied thematic analysis to analyze the\nfeedback from the student participants regarding their experience of using the\nDMHI platform. We identified nine key barriers to DMHI adoption and the use of\nin-person mental health services: emotional distress, time constraints, privacy\nconcerns, resource accessibility, financial challenges, medication stigma,\ndissatisfaction with communication, content clarity, and treatment-related\nconcerns. Our findings emphasize the need for personalized, culturally\nsensitive interventions and improved strategies to enhance the access and\nengagement in mental health support for young adults."}
{"id": "2507.21476", "pdf": "https://arxiv.org/pdf/2507.21476.pdf", "abs": "https://arxiv.org/abs/2507.21476", "title": "Which LLMs Get the Joke? Probing Non-STEM Reasoning Abilities with HumorBench", "authors": ["Reuben Narad", "Siddharth Suresh", "Jiayi Chen", "Pine S. L. Dysart-Bricken", "Bob Mankoff", "Robert Nowak", "Jifan Zhang", "Lalit Jain"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "We present HumorBench, a benchmark designed to evaluate large language\nmodels' (LLMs) ability to reason about and explain sophisticated humor in\ncartoon captions. As reasoning models increasingly saturate existing benchmarks\nin mathematics and science, novel and challenging evaluations of model\nintelligence beyond STEM domains are essential. Reasoning is fundamentally\ninvolved in text-based humor comprehension, requiring the identification of\nconnections between concepts in cartoons/captions and external cultural\nreferences, wordplays, and other mechanisms. HumorBench includes approximately\n300 unique cartoon-caption pairs from the New Yorker Caption Contest and\nCartoonstock.com, with expert-annotated evaluation rubrics identifying\nessential joke elements. LLMs are evaluated based on their explanations towards\nthe humor and abilities in identifying the joke elements. To perform well on\nthis task, models must form and test hypotheses about associations between\nconcepts, potentially backtracking from initial interpretations to arrive at\nthe most plausible explanation. Our extensive benchmarking of current SOTA\nmodels reveals three key insights: (1) LLM progress on STEM reasoning transfers\neffectively to humor comprehension; (2) models trained exclusively on STEM\nreasoning data still perform well on HumorBench, demonstrating strong\ntransferability of reasoning abilities; and (3) test-time scaling by increasing\nthinking token budgets yields mixed results across different models in humor\nreasoning."}
{"id": "2507.21158", "pdf": "https://arxiv.org/pdf/2507.21158.pdf", "abs": "https://arxiv.org/abs/2507.21158", "title": "Adaptive XAI in High Stakes Environments: Modeling Swift Trust with Multimodal Feedback in Human AI Teams", "authors": ["Nishani Fernando", "Bahareh Nakisa", "Adnan Ahmad", "Mohammad Naim Rastgoo"], "categories": ["cs.AI", "cs.HC", "H.1.2; I.2.6; I.2.4"], "comment": "15 pages, 1 figure, Accepted to MAI-XAI@ECAI2025", "summary": "Effective human-AI teaming heavily depends on swift trust, particularly in\nhigh-stakes scenarios such as emergency response, where timely and accurate\ndecision-making is critical. In these time-sensitive and cognitively demanding\nsettings, adaptive explainability is essential for fostering trust between\nhuman operators and AI systems. However, existing explainable AI (XAI)\napproaches typically offer uniform explanations and rely heavily on explicit\nfeedback mechanisms, which are often impractical in such high-pressure\nscenarios. To address this gap, we propose a conceptual framework for adaptive\nXAI that operates non-intrusively by responding to users' real-time cognitive\nand emotional states through implicit feedback, thereby enhancing swift trust\nin high-stakes environments. The proposed adaptive explainability trust\nframework (AXTF) leverages physiological and behavioral signals, such as EEG,\nECG, and eye tracking, to infer user states and support explanation adaptation.\nAt its core is a multi-objective, personalized trust estimation model that maps\nworkload, stress, and emotion to dynamic trust estimates. These estimates guide\nthe modulation of explanation features enabling responsive and personalized\nsupport that promotes swift trust in human-AI collaboration. This conceptual\nframework establishes a foundation for developing adaptive, non-intrusive XAI\nsystems tailored to the rigorous demands of high-pressure, time-sensitive\nenvironments."}
{"id": "2507.21482", "pdf": "https://arxiv.org/pdf/2507.21482.pdf", "abs": "https://arxiv.org/abs/2507.21482", "title": "Improving Task Diversity in Label Efficient Supervised Finetuning of LLMs", "authors": ["Abhinav Arabelly", "Jagrut Nemade", "Robert D Nowak", "Jifan Zhang"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\ndiverse domains, but developing high-performing models for specialized\napplications often requires substantial human annotation -- a process that is\ntime-consuming, labor-intensive, and expensive. In this paper, we address the\nlabel-efficient learning problem for supervised finetuning (SFT) by leveraging\ntask-diversity as a fundamental principle for effective data selection. This is\nmarkedly different from existing methods based on the prompt-diversity. Our\napproach is based on two key observations: 1) task labels for different prompts\nare often readily available; 2) pre-trained models have significantly varying\nlevels of confidence across tasks. We combine these facts to devise a simple\nyet effective sampling strategy: we select examples across tasks using an\ninverse confidence weighting strategy. This produces models comparable to or\nbetter than those trained with more complex sampling procedures, while being\nsignificantly easier to implement and less computationally intensive. Notably,\nour experimental results demonstrate that this method can achieve better\naccuracy than training on the complete dataset (a 4\\% increase in MMLU score).\nAcross various annotation budgets and two instruction finetuning datasets, our\nalgorithm consistently performs at or above the level of the best existing\nmethods, while reducing annotation costs by up to 80\\%."}
{"id": "2507.21199", "pdf": "https://arxiv.org/pdf/2507.21199.pdf", "abs": "https://arxiv.org/abs/2507.21199", "title": "Advancing Compositional LLM Reasoning with Structured Task Relations in Interactive Multimodal Communications", "authors": ["Xinye Cao", "Hongcan Guo", "Guoshun Nan", "Jiaoyang Cui", "Haoting Qian", "Yihan Lin", "Yilin Peng", "Diyang Zhang", "Yanzhao Hou", "Huici Wu", "Xiaofeng Tao", "Tony Q. S. Quek"], "categories": ["cs.LG", "cs.AI", "cs.DC", "cs.HC"], "comment": "Accepted by IEEE JSAC. This work has been submitted to the IEEE for\n  possible publication", "summary": "Interactive multimodal applications (IMAs), such as route planning in the\nInternet of Vehicles, enrich users' personalized experiences by integrating\nvarious forms of data over wireless networks. Recent advances in large language\nmodels (LLMs) utilize mixture-of-experts (MoE) mechanisms to empower multiple\nIMAs, with each LLM trained individually for a specific task that presents\ndifferent business workflows. In contrast to existing approaches that rely on\nmultiple LLMs for IMAs, this paper presents a novel paradigm that accomplishes\nvarious IMAs using a single compositional LLM over wireless networks. The two\nprimary challenges include 1) guiding a single LLM to adapt to diverse IMA\nobjectives and 2) ensuring the flexibility and efficiency of the LLM in\nresource-constrained mobile environments. To tackle the first challenge, we\npropose ContextLoRA, a novel method that guides an LLM to learn the rich\nstructured context among IMAs by constructing a task dependency graph. We\npartition the learnable parameter matrix of neural layers for each IMA to\nfacilitate LLM composition. Then, we develop a step-by-step fine-tuning\nprocedure guided by task relations, including training, freezing, and masking\nphases. This allows the LLM to learn to reason among tasks for better\nadaptation, capturing the latent dependencies between tasks. For the second\nchallenge, we introduce ContextGear, a scheduling strategy to optimize the\ntraining procedure of ContextLoRA, aiming to minimize computational and\ncommunication costs through a strategic grouping mechanism. Experiments on\nthree benchmarks show the superiority of the proposed ContextLoRA and\nContextGear. Furthermore, we prototype our proposed paradigm on a real-world\nwireless testbed, demonstrating its practical applicability for various IMAs.\nWe will release our code to the community."}
{"id": "2507.21500", "pdf": "https://arxiv.org/pdf/2507.21500.pdf", "abs": "https://arxiv.org/abs/2507.21500", "title": "VN-MTEB: Vietnamese Massive Text Embedding Benchmark", "authors": ["Loc Pham", "Tung Luu", "Thu Vo", "Minh Nguyen", "Viet Hoang"], "categories": ["cs.CL", "cs.AI"], "comment": "19 pages (including reference, appendix) 41 datasets from 6 tasks\n  (retrieval, classification, pair-classification, clustering, rerank, sts) 7\n  figures, 16 tables, benchmark 18 text embedding models", "summary": "Vietnam ranks among the top countries in terms of both internet traffic and\nonline toxicity. As a result, implementing embedding models for recommendation\nand content control duties in applications is crucial. However, a lack of\nlarge-scale test datasets, both in volume and task diversity, makes it tricky\nfor scientists to effectively evaluate AI models before deploying them in\nreal-world, large-scale projects. To solve this important problem, we introduce\na Vietnamese benchmark, VN-MTEB for embedding models, which we created by\ntranslating a large number of English samples from the Massive Text Embedding\nBenchmark using our new automated framework. We leverage the strengths of large\nlanguage models (LLMs) and cutting-edge embedding models to conduct translation\nand filtering processes to retain high-quality samples, guaranteeing a natural\nflow of language and semantic fidelity while preserving named entity\nrecognition (NER) and code snippets. Our comprehensive benchmark consists of 41\ndatasets from six tasks specifically designed for Vietnamese text embeddings.\nIn our analysis, we find that bigger and more complex models using Rotary\nPositional Embedding outperform those using Absolute Positional Embedding in\nembedding tasks. Datasets are available at HuggingFace:\nhttps://huggingface.co/collections/GreenNode/vn-mteb-68871433f0f7573b8e1a6686"}
{"id": "2507.21360", "pdf": "https://arxiv.org/pdf/2507.21360.pdf", "abs": "https://arxiv.org/abs/2507.21360", "title": "Efficacy of AI RAG Tools for Complex Information Extraction and Data Annotation Tasks: A Case Study Using Banks Public Disclosures", "authors": ["Nicholas Botti", "Flora Haberkorn", "Charlotte Hoopes", "Shaun Khan"], "categories": ["cs.AI", "cs.HC", "econ.GN", "q-fin.EC"], "comment": null, "summary": "We utilize a within-subjects design with randomized task assignments to\nunderstand the effectiveness of using an AI retrieval augmented generation\n(RAG) tool to assist analysts with an information extraction and data\nannotation task. We replicate an existing, challenging real-world annotation\ntask with complex multi-part criteria on a set of thousands of pages of public\ndisclosure documents from global systemically important banks (GSIBs) with\nheterogeneous and incomplete information content. We test two treatment\nconditions. First, a \"naive\" AI use condition in which annotators use only the\ntool and must accept the first answer they are given. And second, an\n\"interactive\" AI treatment condition where annotators use the tool\ninteractively, and use their judgement to follow-up with additional information\nif necessary. Compared to the human-only baseline, the use of the AI tool\naccelerated task execution by up to a factor of 10 and enhanced task accuracy,\nparticularly in the interactive condition. We find that when extrapolated to\nthe full task, these methods could save up to 268 hours compared to the\nhuman-only approach. Additionally, our findings suggest that annotator skill,\nnot just with the subject matter domain, but also with AI tools, is a factor in\nboth the accuracy and speed of task performance."}
{"id": "2507.21509", "pdf": "https://arxiv.org/pdf/2507.21509.pdf", "abs": "https://arxiv.org/abs/2507.21509", "title": "Persona Vectors: Monitoring and Controlling Character Traits in Language Models", "authors": ["Runjin Chen", "Andy Arditi", "Henry Sleight", "Owain Evans", "Jack Lindsey"], "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Large language models interact with users through a simulated 'Assistant'\npersona. While the Assistant is typically trained to be helpful, harmless, and\nhonest, it sometimes deviates from these ideals. In this paper, we identify\ndirections in the model's activation space-persona vectors-underlying several\ntraits, such as evil, sycophancy, and propensity to hallucinate. We confirm\nthat these vectors can be used to monitor fluctuations in the Assistant's\npersonality at deployment time. We then apply persona vectors to predict and\ncontrol personality shifts that occur during training. We find that both\nintended and unintended personality changes after finetuning are strongly\ncorrelated with shifts along the relevant persona vectors. These shifts can be\nmitigated through post-hoc intervention, or avoided in the first place with a\nnew preventative steering method. Moreover, persona vectors can be used to flag\ntraining data that will produce undesirable personality changes, both at the\ndataset level and the individual sample level. Our method for extracting\npersona vectors is automated and can be applied to any personality trait of\ninterest, given only a natural-language description."}
{"id": "2507.21431", "pdf": "https://arxiv.org/pdf/2507.21431.pdf", "abs": "https://arxiv.org/abs/2507.21431", "title": "Sound Source Localization for Human-Robot Interaction in Outdoor Environments", "authors": ["Victor Liu", "Timothy Du", "Jordy Sehn", "Jack Collier", "François Grondin"], "categories": ["cs.RO", "cs.HC", "eess.AS"], "comment": null, "summary": "This paper presents a sound source localization strategy that relies on a\nmicrophone array embedded in an unmanned ground vehicle and an asynchronous\nclose-talking microphone near the operator. A signal coarse alignment strategy\nis combined with a time-domain acoustic echo cancellation algorithm to estimate\na time-frequency ideal ratio mask to isolate the target speech from\ninterferences and environmental noise. This allows selective sound source\nlocalization, and provides the robot with the direction of arrival of sound\nfrom the active operator, which enables rich interaction in noisy scenarios.\nResults demonstrate an average angle error of 4 degrees and an accuracy within\n5 degrees of 95\\% at a signal-to-noise ratio of 1dB, which is significantly\nsuperior to the state-of-the-art localization methods."}
{"id": "2507.21522", "pdf": "https://arxiv.org/pdf/2507.21522.pdf", "abs": "https://arxiv.org/abs/2507.21522", "title": "Model-free Speculative Decoding for Transformer-based ASR with Token Map Drafting", "authors": ["Tuan Vu Ho", "Hiroaki Kokubo", "Masaaki Yamamoto", "Yohei Kawaguchi"], "categories": ["cs.CL", "cs.SD", "eess.AS"], "comment": "Accepted at EUSIPCO 2025", "summary": "End-to-end automatic speech recognition (ASR) systems based on transformer\narchitectures, such as Whisper, offer high transcription accuracy and\nrobustness. However, their autoregressive decoding is computationally\nexpensive, hence limiting deployment on CPU-based and resource-constrained\ndevices. Speculative decoding (SD) mitigates this issue by using a smaller\ndraft model to propose candidate tokens, which are then verified by the main\nmodel. However, this approach is impractical for devices lacking hardware\naccelerators like GPUs. To address this, we propose \\emph{Token Map Drafting},\na model-free SD technique that eliminates the need for a separate draft model.\nInstead, we leverage a precomputed n-gram token map derived from\ndomain-specific training data, enabling efficient speculative decoding with\nminimal overhead. Our method significantly accelerates ASR inference in\nstructured, low-perplexity domains without sacrificing transcription accuracy.\nExperimental results demonstrate decoding speed-ups of $1.27\\times$ on the\nCI-AVSR dataset and $1.37\\times$ on our internal dataset without degrading\nrecognition accuracy. Additionally, our approach achieves a $10\\%$ absolute\nimprovement in decoding speed over the Distill-spec baseline running on CPU,\nhighlighting its effectiveness for on-device ASR applications."}
{"id": "2507.21571", "pdf": "https://arxiv.org/pdf/2507.21571.pdf", "abs": "https://arxiv.org/abs/2507.21571", "title": "Finding Uncommon Ground: A Human-Centered Model for Extrospective Explanations", "authors": ["Laura Spillner", "Nima Zargham", "Mihai Pomarlan", "Robert Porzel", "Rainer Malaka"], "categories": ["cs.AI", "cs.HC"], "comment": "Presented at the IJCAI 2023 Workshop on Explainable Artificial\n  Intelligence (XAI)", "summary": "The need for explanations in AI has, by and large, been driven by the desire\nto increase the transparency of black-box machine learning models. However,\nsuch explanations, which focus on the internal mechanisms that lead to a\nspecific output, are often unsuitable for non-experts. To facilitate a\nhuman-centered perspective on AI explanations, agents need to focus on\nindividuals and their preferences as well as the context in which the\nexplanations are given. This paper proposes a personalized approach to\nexplanation, where the agent tailors the information provided to the user based\non what is most likely pertinent to them. We propose a model of the agent's\nworldview that also serves as a personal and dynamic memory of its previous\ninteractions with the same user, based on which the artificial agent can\nestimate what part of its knowledge is most likely new information to the user."}
{"id": "2507.21526", "pdf": "https://arxiv.org/pdf/2507.21526.pdf", "abs": "https://arxiv.org/abs/2507.21526", "title": "TriangleMix: A Lossless and Efficient Attention Pattern for Long Context Prefilling", "authors": ["Zhiyuan He", "Yike Zhang", "Chengruidong Zhang", "Huiqiang Jiang", "Yuqing Yang", "Lili Qiu"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) rely on attention mechanisms whose time\ncomplexity grows quadratically with input sequence length, creating significant\ncomputational bottlenecks during the prefilling stage. Existing static sparse\nattention methods typically degrade accuracy, while dynamic sparsity methods\nintroduce additional computational overhead due to runtime sparse index\nestimation. To address these limitations, we propose TriangleMix, a novel\ntraining-free static attention pattern. TriangleMix employs dense attention in\nshallow layers and switches to a triangle-shaped sparse pattern in deeper\nlayers. Extensive experiments demonstrate that TriangleMix reduces attention\noverhead by 3.7x to 15.3x in deep layers, and decreases overall\nTime-to-First-Token (TTFT) by 12% to 32% for sequence lengths ranging from 32K\nto 128K, without sacrificing model accuracy. Moreover, TriangleMix can be\nseamlessly integrated with dynamic sparsity methods to achieve further speedup,\ne.g. accelerating MInference by 19% at 128K, highlighting its potential to\nenhance LLM inference efficiency."}
{"id": "2507.21664", "pdf": "https://arxiv.org/pdf/2507.21664.pdf", "abs": "https://arxiv.org/abs/2507.21664", "title": "Can the current trends of AI handle a full course of mathematics?", "authors": ["Mariam Alsayyad", "Fayadh Kadhem"], "categories": ["cs.AI", "cs.HC", "math.HO"], "comment": "36 pages", "summary": "This paper addresses the question of how able the current trends of\nArtificial Intelligence (AI) are in managing to take the responsibility of a\nfull course of mathematics at a college level. The study evaluates this ability\nin four significant aspects, namely, creating a course syllabus, presenting\nselected material, answering student questions, and creating an assessment. It\nshows that even though the AI is strong in some important parts like\norganization and accuracy, there are still some human aspects that are far away\nfrom the current abilities of AI. There is still a hidden emotional part, even\nin science, that cannot be fulfilled by the AI in its current state. This paper\nsuggests some recommendations to integrate the human and AI potentials to\ncreate better outcomes in terms of reaching the target of creating a full\ncourse of mathematics, at a university level, as best as possible."}
{"id": "2507.21532", "pdf": "https://arxiv.org/pdf/2507.21532.pdf", "abs": "https://arxiv.org/abs/2507.21532", "title": "Automatic Classification of User Requirements from Online Feedback -- A Replication Study", "authors": ["Meet Bhatt", "Nic Boilard", "Muhammad Rehan Chaudhary", "Cole Thompson", "Jacob Idoko", "Aakash Sorathiya", "Gouri Ginde"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "10 pages, 3 figures, Replication package available at\n  https://zenodo.org/records/15626782, Accepted at AIRE 2025 (12th\n  International Workshop on Artificial Intelligence and Requirements\n  Engineering)", "summary": "Natural language processing (NLP) techniques have been widely applied in the\nrequirements engineering (RE) field to support tasks such as classification and\nambiguity detection. Although RE research is rooted in empirical investigation,\nit has paid limited attention to replicating NLP for RE (NLP4RE) studies. The\nrapidly advancing realm of NLP is creating new opportunities for efficient,\nmachine-assisted workflows, which can bring new perspectives and results to the\nforefront. Thus, we replicate and extend a previous NLP4RE study (baseline),\n\"Classifying User Requirements from Online Feedback in Small Dataset\nEnvironments using Deep Learning\", which evaluated different deep learning\nmodels for requirement classification from user reviews. We reproduced the\noriginal results using publicly released source code, thereby helping to\nstrengthen the external validity of the baseline study. We then extended the\nsetup by evaluating model performance on an external dataset and comparing\nresults to a GPT-4o zero-shot classifier. Furthermore, we prepared the\nreplication study ID-card for the baseline study, important for evaluating\nreplication readiness. Results showed diverse reproducibility levels across\ndifferent models, with Naive Bayes demonstrating perfect reproducibility. In\ncontrast, BERT and other models showed mixed results. Our findings revealed\nthat baseline deep learning models, BERT and ELMo, exhibited good\ngeneralization capabilities on an external dataset, and GPT-4o showed\nperformance comparable to traditional baseline machine learning models.\nAdditionally, our assessment confirmed the baseline study's replication\nreadiness; however missing environment setup files would have further enhanced\nreadiness. We include this missing information in our replication package and\nprovide the replication study ID-card for our study to further encourage and\nsupport the replication of our study."}
{"id": "2507.21859", "pdf": "https://arxiv.org/pdf/2507.21859.pdf", "abs": "https://arxiv.org/abs/2507.21859", "title": "Evaluating Interactions between Automated Vehicles and Cyclists using a coupled In-the-Loop Test Environment", "authors": ["Michael Kaiser", "Clemens Groß", "Lisa Marie Otto", "Steffen Müller"], "categories": ["cs.RO", "cs.HC"], "comment": null, "summary": "Testing and evaluating automated driving systems (ADS) in interactions with\nvulnerable road users (VRUs), such as cyclists, are essential for improving the\nsafety of VRUs, but often lack realism. This paper presents and validates a\ncoupled in-the-loop test environment that integrates a Cyclist-in-the Loop test\nbench with a Vehicle-in-the-Loop test bench via a virtual environment (VE)\ndeveloped in Unreal Engine 5. The setup enables closed-loop, bidirectional\ninteraction between a real human cyclist and a real automated vehicle under\nsafe and controllable conditions. The automated vehicle reacts to cyclist\ngestures via stimulated camera input, while the cyclist, riding a stationary\nbicycle, perceives and reacts to the vehicle in the VE in real time. Validation\nexperiments are conducted using a real automated shuttle bus with a\ntrack-and-follow function, performing three test maneuvers - straight-line\ndriving with stop, circular track driving, and double lane change - on a\nproving ground and in the coupled in-the-loop test environment. The performance\nis evaluated by comparing the resulting vehicle trajectories in both\nenvironments. Additionally, the introduced latencies of individual components\nin the test setup are measured. The results demonstrate the feasibility of the\napproach and highlight its strengths and limitations for realistic ADS\nevaluation."}
{"id": "2507.21536", "pdf": "https://arxiv.org/pdf/2507.21536.pdf", "abs": "https://arxiv.org/abs/2507.21536", "title": "Modern Uyghur Dependency Treebank (MUDT): An Integrated Morphosyntactic Framework for a Low-Resource Language", "authors": ["Jiaxin Zuo", "Yiquan Wang", "Yuan Pan", "Xiadiya Yibulayin"], "categories": ["cs.CL"], "comment": null, "summary": "To address a critical resource gap in Uyghur Natural Language Processing\n(NLP), this study introduces a dependency annotation framework designed to\novercome the limitations of existing treebanks for the low-resource,\nagglutinative language. This inventory includes 18 main relations and 26\nsubtypes, with specific labels such as cop:zero for verbless clauses and\ninstr:case=loc/dat for nuanced instrumental functions. To empirically validate\nthe necessity of this tailored approach, we conducted a cross-standard\nevaluation using a pre-trained Universal Dependencies parser. The analysis\nrevealed a systematic 47.9% divergence in annotations, pinpointing the\ninadequacy of universal schemes for handling Uyghur-specific structures.\nGrounded in nine annotation principles that ensure typological accuracy and\nsemantic transparency, the Modern Uyghur Dependency Treebank (MUDT) provides a\nmore accurate and semantically transparent representation, designed to enable\nsignificant improvements in parsing and downstream NLP tasks, and offers a\nreplicable model for other morphologically complex languages."}
{"id": "2507.21928", "pdf": "https://arxiv.org/pdf/2507.21928.pdf", "abs": "https://arxiv.org/abs/2507.21928", "title": "Vibe Coding as a Reconfiguration of Intent Mediation in Software Development: Definition, Implications, and Research Agenda", "authors": ["Christian Meske", "Tobias Hermanns", "Esther von der Weiden", "Kai-Uwe Loser", "Thorsten Berger"], "categories": ["cs.SE", "cs.AI", "cs.HC"], "comment": null, "summary": "Software development is undergoing a fundamental transformation as vibe\ncoding becomes widespread, with large portions of contemporary codebases now\nbeing AI-generated. The disconnect between rapid adoption and limited\nconceptual understanding highlights the need for an inquiry into this emerging\nparadigm. Drawing on an intent perspective and historical analysis, we define\nvibe coding as a software development paradigm where humans and generative AI\nengage in collaborative flow to co-create software artifacts through natural\nlanguage dialogue, shifting the mediation of developer intent from\ndeterministic instruction to probabilistic inference. By intent mediation, we\nrefer to the fundamental process through which developers translate their\nconceptual goals into representations that computational systems can execute.\nOur results show that vibe coding reconfigures cognitive work by redistributing\nepistemic labor between humans and machines, shifting the expertise in the\nsoftware development process away from traditional areas such as design or\ntechnical implementation toward collaborative orchestration. We identify key\nopportunities, including democratization, acceleration, and systemic leverage,\nalongside risks, such as black box codebases, responsibility gaps, and\necosystem bias. We conclude with a research agenda spanning human-,\ntechnology-, and organization-centered directions to guide future\ninvestigations of this paradigm."}
{"id": "2507.21544", "pdf": "https://arxiv.org/pdf/2507.21544.pdf", "abs": "https://arxiv.org/abs/2507.21544", "title": "MAGIC: A Multi-Hop and Graph-Based Benchmark for Inter-Context Conflicts in Retrieval-Augmented Generation", "authors": ["Jungyeon Lee", "Kangmin Lee", "Taeuk Kim"], "categories": ["cs.CL"], "comment": null, "summary": "Knowledge conflict often arises in retrieval-augmented generation (RAG)\nsystems, where retrieved documents may be inconsistent with one another or\ncontradict the model's parametric knowledge. Existing benchmarks for\ninvestigating the phenomenon have notable limitations, including a narrow focus\non the question answering setup, heavy reliance on entity substitution\ntechniques, and a restricted range of conflict types. To address these issues,\nwe propose a knowledge graph (KG)-based framework that generates varied and\nsubtle conflicts between two similar yet distinct contexts, while ensuring\ninterpretability through the explicit relational structure of KGs. Experimental\nresults on our benchmark, MAGIC, provide intriguing insights into the inner\nworkings of LLMs regarding knowledge conflict: both open-source and proprietary\nmodels struggle with conflict detection -- especially when multi-hop reasoning\nis required -- and often fail to pinpoint the exact source of contradictions.\nFinally, we present in-depth analyses that serve as a foundation for improving\nLLMs in integrating diverse, sometimes even conflicting, information."}
{"id": "2410.04177", "pdf": "https://arxiv.org/pdf/2410.04177.pdf", "abs": "https://arxiv.org/abs/2410.04177", "title": "Exploring Keyboard Positioning and Ten-Finger Typing in Mixed Reality", "authors": ["Cecilia Schmitz", "Joshua Reynolds", "Scott Kuhl", "Keith Vertanen"], "categories": ["cs.HC"], "comment": null, "summary": "Accuracy and speed are pivotal when typing. Mixed reality typing is typically\nperformed by typing on a midair keyboard with your index fingers. This deprives\nusers of both the tactile feedback available on physical devices and the\nability to press keys with the most convenient finger. Our first experiment\ninvestigated providing tactile feedback by positioning the virtual keyboard on\na table or wall. The keyboard was deterministic (without auto-correct),\nsupported mixed case typing with symbols, and relied only on the hand-tracking\nprovided by a commodity headset's egocentric cameras. Users preferred and had\nthe highest entry rate of 12 words-per-minute using a midair keyboard. Error\nrates were similar in all conditions. Our second experiment explored ten-finger\ntyping and used a novel eye-tracking technique to avoid accidental key presses.\nThis technique was preferred for ten-finger typing and halved corrections.\nHowever, participants were faster using their index fingers without\neye-tracking at 11 words-per-minute."}
{"id": "2507.21556", "pdf": "https://arxiv.org/pdf/2507.21556.pdf", "abs": "https://arxiv.org/abs/2507.21556", "title": "Evaluating the cognitive reality of Spanish irregular morphomic patterns: Humans vs. Transformers", "authors": ["Akhilesh Kakolu Ramarao", "Kevin Tang", "Dinah Baer-Henney"], "categories": ["cs.CL"], "comment": null, "summary": "This study investigates the cognitive plausibility of the Spanish irregular\nmorphomic pattern by directly comparing transformer-based neural networks to\nhuman behavioral data from \\citet{Nevins2015TheRA}. Using the same analytical\nframework as the original human study, we evaluate whether transformer models\ncan replicate human-like sensitivity to a complex linguistic phenomena, the\nmorphome, under controlled input conditions. Our experiments focus on three\nfrequency conditions: natural, low-frequency, and high-frequency distributions\nof verbs exhibiting irregular morphomic patterns. While the models outperformed\nhumans in stem and suffix accuracy, a clear divergence emerged in response\npreferences. Unlike humans, who consistently favored natural responses across\nall test items, models' preferred irregular responses and were influenced by\nthe proportion of irregular verbs in their training data. Additionally, models\ntrained on the natural and low-frequency distributions, but not the\nhigh-frequency distribution, were sensitive to the phonological similarity\nbetween test items and real Spanish L-shaped verbs."}
{"id": "2507.10044", "pdf": "https://arxiv.org/pdf/2507.10044.pdf", "abs": "https://arxiv.org/abs/2507.10044", "title": "MEDebiaser: A Human-AI Feedback System for Mitigating Bias in Multi-label Medical Image Classification", "authors": ["Shaohan Shi", "Yuheng Shao", "Haoran Jiang", "Yunjie Yao", "Zhijun Zhang", "Xu Ding", "Quan Li"], "categories": ["cs.HC"], "comment": "Will appear at UIST2025", "summary": "Medical images often contain multiple labels with imbalanced distributions\nand co-occurrence, leading to bias in multi-label medical image classification.\nClose collaboration between medical professionals and machine learning\npractitioners has significantly advanced medical image analysis. However,\ntraditional collaboration modes struggle to facilitate effective feedback\nbetween physicians and AI models, as integrating medical expertise into the\ntraining process via engineers can be time-consuming and labor-intensive. To\nbridge this gap, we introduce MEDebiaser, an interactive system enabling\nphysicians to directly refine AI models using local explanations. By combining\nprediction with attention loss functions and employing a customized ranking\nstrategy to alleviate scalability, MEDebiaser allows physicians to mitigate\nbiases without technical expertise, reducing reliance on engineers, and thus\nenhancing more direct human-AI feedback. Our mechanism and user studies\ndemonstrate that it effectively reduces biases, improves usability, and\nenhances collaboration efficiency, providing a practical solution for\nintegrating medical expertise into AI-driven healthcare."}
{"id": "2507.21568", "pdf": "https://arxiv.org/pdf/2507.21568.pdf", "abs": "https://arxiv.org/abs/2507.21568", "title": "Multi-Hypothesis Distillation of Multilingual Neural Translation Models for Low-Resource Languages", "authors": ["Aarón Galiano-Jiménez", "Juan Antonio Pérez-Ortiz", "Felipe Sánchez-Martínez", "Víctor M. Sánchez-Cartagena"], "categories": ["cs.CL"], "comment": "17 pages, 12 figures", "summary": "This paper explores sequence-level knowledge distillation (KD) of\nmultilingual pre-trained encoder-decoder translation models. We argue that the\nteacher model's output distribution holds valuable insights for the student,\nbeyond the approximated mode obtained through beam search (the standard\ndecoding method), and present Multi-Hypothesis Distillation (MHD), a\nsequence-level KD method that generates multiple translations for each source\nsentence. This provides a larger representation of the teacher model\ndistribution and exposes the student model to a wider range of target-side\nprefixes. We leverage $n$-best lists from beam search to guide the student's\nlearning and examine alternative decoding methods to address issues like low\nvariability and the under-representation of infrequent tokens. For low-resource\nlanguages, our research shows that while sampling methods may slightly\ncompromise translation quality compared to beam search based approaches, they\nenhance the generated corpora with greater variability and lexical richness.\nThis ultimately improves student model performance and mitigates the gender\nbias amplification often associated with KD."}
{"id": "2507.17943", "pdf": "https://arxiv.org/pdf/2507.17943.pdf", "abs": "https://arxiv.org/abs/2507.17943", "title": "Automated Brake Onset Detection in Naturalistic Driving Data", "authors": ["Shu-Yuan Liu", "Johan Engström", "Gustav Markkula"], "categories": ["cs.HC", "cs.RO"], "comment": null, "summary": "Response timing measures play a crucial role in the assessment of automated\ndriving systems (ADS) in collision avoidance scenarios, including but not\nlimited to establishing human benchmarks and comparing ADS to human driver\nresponse performance. For example, measuring the response time (of a human\ndriver or ADS) to a conflict requires the determination of a stimulus onset and\na response onset. In existing studies, response onset relies on manual\nannotation or vehicle control signals such as accelerator and brake pedal\nmovements. These methods are not applicable when analyzing large scale data\nwhere vehicle control signals are not available. This holds in particular for\nthe rapidly expanding sets of ADS log data where the behavior of surrounding\nroad users is observed via onboard sensors. To advance evaluation techniques\nfor ADS and enable measuring response timing when vehicle control signals are\nnot available, we developed a simple and efficient algorithm, based on a\npiecewise linear acceleration model, to automatically estimate brake onset that\ncan be applied to any type of driving data that includes vehicle longitudinal\ntime series data. We also proposed a manual annotation method to identify brake\nonset and used it as ground truth for validation. R^2 was used as a confidence\nmetric to measure the accuracy of the algorithm, and its classification\nperformance was analyzed using naturalistic collision avoidance data of both\nADS and humans, where our method was validated against human manual annotation.\nAlthough our algorithm is subject to certain limitations, it is efficient,\ngeneralizable, applicable to any road user and scenario types, and is highly\nconfigurable."}
{"id": "2507.21609", "pdf": "https://arxiv.org/pdf/2507.21609.pdf", "abs": "https://arxiv.org/abs/2507.21609", "title": "Multilingual JobBERT for Cross-Lingual Job Title Matching", "authors": ["Jens-Joris Decorte", "Matthias De Lange", "Jeroen Van Hautte"], "categories": ["cs.CL"], "comment": "Accepted to the TalentCLEF 2025 Workshop as part of CLEF 2025", "summary": "We introduce JobBERT-V3, a contrastive learning-based model for cross-lingual\njob title matching. Building on the state-of-the-art monolingual JobBERT-V2,\nour approach extends support to English, German, Spanish, and Chinese by\nleveraging synthetic translations and a balanced multilingual dataset of over\n21 million job titles. The model retains the efficiency-focused architecture of\nits predecessor while enabling robust alignment across languages without\nrequiring task-specific supervision. Extensive evaluations on the TalentCLEF\n2025 benchmark demonstrate that JobBERT-V3 outperforms strong multilingual\nbaselines and achieves consistent performance across both monolingual and\ncross-lingual settings. While not the primary focus, we also show that the\nmodel can be effectively used to rank relevant skills for a given job title,\ndemonstrating its broader applicability in multilingual labor market\nintelligence. The model is publicly available:\nhttps://huggingface.co/TechWolf/JobBERT-v3."}
{"id": "2507.17985", "pdf": "https://arxiv.org/pdf/2507.17985.pdf", "abs": "https://arxiv.org/abs/2507.17985", "title": "Decoding Instructional Dialogue: Human-AI Collaborative Analysis of Teacher Use of AI Tool at Scale", "authors": ["Alex Liu", "Lief Esbenshade", "Shawon Sarkar", "Victor Tian", "Zachary Zhang", "Kevin He", "Min Sun"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "The integration of large language models (LLMs) into educational tools has\nthe potential to substantially impact how teachers plan instruction, support\ndiverse learners, and engage in professional reflection. Yet little is known\nabout how educators actually use these tools in practice and how their\ninteractions with AI can be meaningfully studied at scale. This paper presents\na human-AI collaborative methodology for large-scale qualitative analysis of\nover 140,000 educator-AI messages drawn from a generative AI platform used by\nK-12 teachers. Through a four-phase coding pipeline, we combined inductive\ntheme discovery, codebook development, structured annotation, and model\nbenchmarking to examine patterns of educator engagement and evaluate the\nperformance of LLMs in qualitative coding tasks. We developed a hierarchical\ncodebook aligned with established teacher evaluation frameworks, capturing\neducators' instructional goals, contextual needs, and pedagogical strategies.\nOur findings demonstrate that LLMs, particularly Claude 3.5 Haiku, can reliably\nsupport theme identification, extend human recognition in complex scenarios,\nand outperform open-weight models in both accuracy and structural reliability.\nThe analysis also reveals substantive patterns in how educators inquire AI to\nenhance instructional practices (79.7 percent of total conversations), create\nor adapt content (76.1 percent), support assessment and feedback loop (46.9\npercent), attend to student needs for tailored instruction (43.3 percent), and\nassist other professional responsibilities (34.2 percent), highlighting\nemerging AI-related competencies that have direct implications for teacher\npreparation and professional development. This study offers a scalable,\ntransparent model for AI-augmented qualitative research and provides\nfoundational insights into the evolving role of generative AI in educational\npractice."}
{"id": "2507.21645", "pdf": "https://arxiv.org/pdf/2507.21645.pdf", "abs": "https://arxiv.org/abs/2507.21645", "title": "Libra: Assessing and Improving Reward Model by Learning to Think", "authors": ["Meng Zhou", "Bei Li", "Jiahao Liu", "Xiaowen Shi", "Yang Bai", "Rongxiang Weng", "Jingang Wang", "Xunliang Cai"], "categories": ["cs.CL"], "comment": "Work In Progress", "summary": "Reinforcement learning (RL) has significantly improved the reasoning ability\nof large language models. However, current reward models underperform in\nchallenging reasoning scenarios and predominant RL training paradigms rely on\nrule-based or reference-based rewards, which impose two critical limitations:\n1) the dependence on finely annotated reference answer to attain rewards; and\n2) the requirement for constrained output format. These limitations\nfundamentally hinder further RL data scaling and sustained enhancement of model\nreasoning performance. To address these limitations, we propose a comprehensive\nframework for evaluating and improving the performance of reward models in\ncomplex reasoning scenarios. We first present a reasoning-oriented benchmark\n(Libra Bench), systematically constructed from a diverse collection of\nchallenging mathematical problems and advanced reasoning models, to address the\nlimitations of existing reward model benchmarks in reasoning scenarios. We\nfurther introduce a novel approach for improving the generative reward model\nvia learning-to-think methodologies. Based on the proposed approach, we develop\nLibra-RM series, a collection of generative reward models with reasoning\ncapabilities that achieve state-of-the-art results on various benchmarks.\nComprehensive downstream experiments are conducted and the experimental results\ndemonstrate the correlation between our Libra Bench and downstream application,\nand the potential of Libra-RM to further improve reasoning models with\nunlabeled data."}
{"id": "2507.19490", "pdf": "https://arxiv.org/pdf/2507.19490.pdf", "abs": "https://arxiv.org/abs/2507.19490", "title": "RISEE: A Highly Interactive Naturalistic Driving Trajectories Dataset with Human Subjective Risk Perception and Eye-tracking Information", "authors": ["Xinzheng Wu", "Junyi Chen", "Peiyi Wang", "Shunxiang Chen", "Haolan Meng", "Yong Shen"], "categories": ["cs.HC", "cs.CV"], "comment": "Preprint accepted by ITSC 2025", "summary": "In the research and development (R&D) and verification and validation (V&V)\nphases of autonomous driving decision-making and planning systems, it is\nnecessary to integrate human factors to achieve decision-making and evaluation\nthat align with human cognition. However, most existing datasets primarily\nfocus on vehicle motion states and trajectories, neglecting human-related\ninformation. In addition, current naturalistic driving datasets lack sufficient\nsafety-critical scenarios while simulated datasets suffer from low\nauthenticity. To address these issues, this paper constructs the Risk-Informed\nSubjective Evaluation and Eye-tracking (RISEE) dataset which specifically\ncontains human subjective evaluations and eye-tracking data apart from regular\nnaturalistic driving trajectories. By leveraging the complementary advantages\nof drone-based (high realism and extensive scenario coverage) and\nsimulation-based (high safety and reproducibility) data collection methods, we\nfirst conduct drone-based traffic video recording at a highway ramp merging\narea. After that, the manually selected highly interactive scenarios are\nreconstructed in simulation software, and drivers' first-person view (FPV)\nvideos are generated, which are then viewed and evaluated by recruited\nparticipants. During the video viewing process, participants' eye-tracking data\nis collected. After data processing and filtering, 3567 valid subjective risk\nratings from 101 participants across 179 scenarios are retained, along with\n2045 qualified eye-tracking data segments. The collected data and examples of\nthe generated FPV videos are available in our website."}
{"id": "2507.21652", "pdf": "https://arxiv.org/pdf/2507.21652.pdf", "abs": "https://arxiv.org/abs/2507.21652", "title": "UnsafeChain: Enhancing Reasoning Model Safety via Hard Cases", "authors": ["Raj Vardhan Tomar", "Preslav Nakov", "Yuxia Wang"], "categories": ["cs.CL"], "comment": null, "summary": "As large reasoning models (LRMs) grow more capable, chain-of-thought (CoT)\nreasoning introduces new safety challenges. Existing SFT-based safety alignment\nstudies dominantly focused on filtering prompts with safe, high-quality\nresponses, while overlooking hard prompts that always elicit harmful outputs.\nTo fill this gap, we introduce UnsafeChain, a safety alignment dataset\nconstructed from hard prompts with diverse sources, where unsafe completions\nare identified and explicitly corrected into safe responses. By exposing models\nto unsafe behaviors and guiding their correction, UnsafeChain enhances safety\nwhile preserving general reasoning ability. We fine-tune three LRMs on\nUnsafeChain and compare them against recent SafeChain and STAR-1 across six\nout-of-distribution and five in-distribution benchmarks. UnsafeChain\nconsistently outperforms prior datasets, with even a 1K subset matching or\nsurpassing baseline performance, demonstrating the effectiveness and\ngeneralizability of correction-based supervision. We release our dataset and\ncode at https://github.com/mbzuai-nlp/UnsafeChain"}
{"id": "2507.20355", "pdf": "https://arxiv.org/pdf/2507.20355.pdf", "abs": "https://arxiv.org/abs/2507.20355", "title": "CineVision: An Interactive Pre-visualization Storyboard System for Director-Cinematographer Collaboration", "authors": ["Zheng Wei", "Hongtao Wu", "lvmin Zhang", "Xian Xu", "Yefeng Zheng", "Pan Hui", "Maneesh Agrawala", "Huamin Qu", "Anyi Rao"], "categories": ["cs.HC"], "comment": "UIST 2025", "summary": "Effective communication between directors and cinematographers is fundamental\nin film production, yet traditional approaches relying on visual references and\nhand-drawn storyboards often lack the efficiency and precision necessary during\npre-production. We present CineVision, an AI-driven platform that integrates\nscriptwriting with real-time visual pre-visualization to bridge this\ncommunication gap. By offering dynamic lighting control, style emulation based\non renowned filmmakers, and customizable character design, CineVision enables\ndirectors to convey their creative vision with heightened clarity and rapidly\niterate on scene composition. In a 24-participant lab study, CineVision yielded\nshorter task times and higher usability ratings than two baseline methods,\nsuggesting a potential to ease early-stage communication and accelerate\nstoryboard drafts under controlled conditions. These findings underscore\nCineVision's potential to streamline pre-production processes and foster deeper\ncreative synergy among filmmaking teams, particularly for new collaborators.\nOur code and demo are available at https://github.com/TonyHongtaoWu/CineVision."}
{"id": "2507.21750", "pdf": "https://arxiv.org/pdf/2507.21750.pdf", "abs": "https://arxiv.org/abs/2507.21750", "title": "Adversarial Defence without Adversarial Defence: Enhancing Language Model Robustness via Instance-level Principal Component Removal", "authors": ["Yang Wang", "Chenghao Xiao", "Yizhi Li", "Stuart E. Middleton", "Noura Al Moubayed", "Chenghua Lin"], "categories": ["cs.CL"], "comment": "This paper was accepted with an A-decision to Transactions of the\n  Association for Computational Linguistics. This version is the\n  pre-publication version prior to MIT Press production", "summary": "Pre-trained language models (PLMs) have driven substantial progress in\nnatural language processing but remain vulnerable to adversarial attacks,\nraising concerns about their robustness in real-world applications. Previous\nstudies have sought to mitigate the impact of adversarial attacks by\nintroducing adversarial perturbations into the training process, either\nimplicitly or explicitly. While both strategies enhance robustness, they often\nincur high computational costs. In this work, we propose a simple yet effective\nadd-on module that enhances the adversarial robustness of PLMs by removing\ninstance-level principal components, without relying on conventional\nadversarial defences or perturbing the original training data. Our approach\ntransforms the embedding space to approximate Gaussian properties, thereby\nreducing its susceptibility to adversarial perturbations while preserving\nsemantic relationships. This transformation aligns embedding distributions in a\nway that minimises the impact of adversarial noise on decision boundaries,\nenhancing robustness without requiring adversarial examples or costly\ntraining-time augmentation. Evaluations on eight benchmark datasets show that\nour approach improves adversarial robustness while maintaining comparable\nbefore-attack accuracy to baselines, achieving a balanced trade-off between\nrobustness and generalisation."}
{"id": "2504.05331", "pdf": "https://arxiv.org/pdf/2504.05331.pdf", "abs": "https://arxiv.org/abs/2504.05331", "title": "Not someone, but something: Rethinking trust in the age of medical AI", "authors": ["Jan Beger"], "categories": ["cs.CY", "cs.AI", "cs.HC"], "comment": null, "summary": "As artificial intelligence (AI) becomes embedded in healthcare, trust in\nmedical decision-making is changing fast. Nowhere is this shift more visible\nthan in radiology, where AI tools are increasingly embedded across the imaging\nworkflow - from scheduling and acquisition to interpretation, reporting, and\ncommunication with referrers and patients. This opinion paper argues that trust\nin AI isn't a simple transfer from humans to machines - it is a dynamic,\nevolving relationship that must be built and maintained. Rather than debating\nwhether AI belongs in medicine, it asks: what kind of trust must AI earn, and\nhow? Drawing from philosophy, bioethics, and system design, it explores the key\ndifferences between human trust and machine reliability - emphasizing\ntransparency, accountability, and alignment with the values of good care. It\nargues that trust in AI should not be built on mimicking empathy or intuition,\nbut on thoughtful design, responsible deployment, and clear moral\nresponsibility. The goal is a balanced view - one that avoids blind optimism\nand reflexive fear. Trust in AI must be treated not as a given, but as\nsomething to be earned over time."}
{"id": "2507.21773", "pdf": "https://arxiv.org/pdf/2507.21773.pdf", "abs": "https://arxiv.org/abs/2507.21773", "title": "AgriEval: A Comprehensive Chinese Agricultural Benchmark for Large Language Models", "authors": ["Lian Yan", "Haotian Wang", "Chen Tang", "Haifeng Liu", "Tianyang Sun", "Liangliang Liu", "Yi Guan", "Jingchi Jiang"], "categories": ["cs.CL"], "comment": "36 pages, 22 figures", "summary": "In the agricultural domain, the deployment of large language models (LLMs) is\nhindered by the lack of training data and evaluation benchmarks. To mitigate\nthis issue, we propose AgriEval, the first comprehensive Chinese agricultural\nbenchmark with three main characteristics: (1) Comprehensive Capability\nEvaluation. AgriEval covers six major agriculture categories and 29\nsubcategories within agriculture, addressing four core cognitive scenarios:\nmemorization, understanding, inference, and generation. (2) High-Quality Data.\nThe dataset is curated from university-level examinations and assignments,\nproviding a natural and robust benchmark for assessing the capacity of LLMs to\napply knowledge and make expert-like decisions. (3) Diverse Formats and\nExtensive Scale. AgriEval comprises 14,697 multiple-choice questions and 2,167\nopen-ended question-and-answer questions, establishing it as the most extensive\nagricultural benchmark available to date. We also present comprehensive\nexperimental results over 51 open-source and commercial LLMs. The experimental\nresults reveal that most existing LLMs struggle to achieve 60% accuracy,\nunderscoring the developmental potential in agricultural LLMs. Additionally, we\nconduct extensive experiments to investigate factors influencing model\nperformance and propose strategies for enhancement. AgriEval is available at\nhttps://github.com/YanPioneer/AgriEval/."}
{"id": "2505.04066", "pdf": "https://arxiv.org/pdf/2505.04066.pdf", "abs": "https://arxiv.org/abs/2505.04066", "title": "LLAMAPIE: Proactive In-Ear Conversation Assistants", "authors": ["Tuochao Chen", "Nicholas Batchelder", "Alisa Liu", "Noah Smith", "Shyamnath Gollakota"], "categories": ["cs.LG", "cs.CL", "cs.HC", "cs.SD", "eess.AS"], "comment": "Published by ACL2025 (Findings)", "summary": "We introduce LlamaPIE, the first real-time proactive assistant designed to\nenhance human conversations through discreet, concise guidance delivered via\nhearable devices. Unlike traditional language models that require explicit user\ninvocation, this assistant operates in the background, anticipating user needs\nwithout interrupting conversations. We address several challenges, including\ndetermining when to respond, crafting concise responses that enhance\nconversations, leveraging knowledge of the user for context-aware assistance,\nand real-time, on-device processing. To achieve this, we construct a\nsemi-synthetic dialogue dataset and propose a two-model pipeline: a small model\nthat decides when to respond and a larger model that generates the response. We\nevaluate our approach on real-world datasets, demonstrating its effectiveness\nin providing helpful, unobtrusive assistance. User studies with our assistant,\nimplemented on Apple Silicon M2 hardware, show a strong preference for the\nproactive assistant over both a baseline with no assistance and a reactive\nmodel, highlighting the potential of LlamaPie to enhance live conversations."}
{"id": "2507.21782", "pdf": "https://arxiv.org/pdf/2507.21782.pdf", "abs": "https://arxiv.org/abs/2507.21782", "title": "The Problem with Safety Classification is not just the Models", "authors": ["Sowmya Vajjala"], "categories": ["cs.CL"], "comment": "Pre-print, Short paper", "summary": "Studying the robustness of Large Language Models (LLMs) to unsafe behaviors\nis an important topic of research today. Building safety classification models\nor guard models, which are fine-tuned models for input/output safety\nclassification for LLMs, is seen as one of the solutions to address the issue.\nAlthough there is a lot of research on the safety testing of LLMs themselves,\nthere is little research on evaluating the effectiveness of such safety\nclassifiers or the evaluation datasets used for testing them, especially in\nmultilingual scenarios. In this position paper, we demonstrate how multilingual\ndisparities exist in 5 safety classification models by considering datasets\ncovering 18 languages. At the same time, we identify potential issues with the\nevaluation datasets, arguing that the shortcomings of current safety\nclassifiers are not only because of the models themselves. We expect that these\nfindings will contribute to the discussion on developing better methods to\nidentify harmful content in LLM inputs across languages."}
{"id": "2507.19855", "pdf": "https://arxiv.org/pdf/2507.19855.pdf", "abs": "https://arxiv.org/abs/2507.19855", "title": "Inducing Causal World Models in LLMs for Zero-Shot Physical Reasoning", "authors": ["Aditya Sharma", "Linh Nguyen", "Ananya Gupta", "Chengyu Wang", "Chiamaka Adebayo", "Jakub Kowalski"], "categories": ["cs.LG", "cs.HC", "68T05, 68T07, 68T40", "I.2.6; I.2.9; I.2.7; I.2.10; H.5.2"], "comment": "12 pages, 4 figures,", "summary": "Large Language Models (LLMs), despite their advanced linguistic capabilities,\nfundamentally lack an intuitive understanding of physical dynamics, which\nlimits their effectiveness in real-world scenarios that require causal\nreasoning. In this paper, we introduce Causal World Model Induction (CWMI), a\nnovel framework designed to embed an explicit model of causal physics within an\nLLM. Our approach incorporates a dedicated Causal Physics Module (CPM) and a\nnew training objective called Causal Intervention Loss, encouraging the model\nto learn cause-and-effect relationships from multimodal data. By training the\nmodel to predict the outcomes of hypothetical interventions instead of merely\ncapturing statistical correlations, CWMI develops a robust internal\nrepresentation of physical laws. Experimental results show that CWMI\nsignificantly outperforms state-of-the-art LLMs on zero-shot physical reasoning\ntasks, including the PIQA benchmark and our newly proposed PhysiCa-Bench\ndataset. These findings demonstrate that inducing a causal world model is a\ncritical step toward more reliable and generalizable AI systems."}
{"id": "2507.21810", "pdf": "https://arxiv.org/pdf/2507.21810.pdf", "abs": "https://arxiv.org/abs/2507.21810", "title": "ChartMark: A Structured Grammar for Chart Annotation", "authors": ["Yiyu Chen", "Yifan Wu", "Shuyu Shen", "Yupeng Xie", "Leixian Shen", "Hui Xiong", "Yuyu Luo"], "categories": ["cs.CL", "cs.SE"], "comment": "IEEE VIS 2025", "summary": "Chart annotations enhance visualization accessibility but suffer from\nfragmented, non-standardized representations that limit cross-platform reuse.\nWe propose ChartMark, a structured grammar that separates annotation semantics\nfrom visualization implementations. ChartMark features a hierarchical framework\nmapping onto annotation dimensions (e.g., task, chart context), supporting both\nabstract intents and precise visual details. Our toolkit demonstrates\nconverting ChartMark specifications into Vega-Lite visualizations, highlighting\nits flexibility, expressiveness, and practical applicability."}
{"id": "2507.20536", "pdf": "https://arxiv.org/pdf/2507.20536.pdf", "abs": "https://arxiv.org/abs/2507.20536", "title": "T2I-Copilot: A Training-Free Multi-Agent Text-to-Image System for Enhanced Prompt Interpretation and Interactive Generation", "authors": ["Chieh-Yun Chen", "Min Shi", "Gong Zhang", "Humphrey Shi"], "categories": ["cs.CV", "cs.AI", "cs.HC"], "comment": "ICCV 2025", "summary": "Text-to-Image (T2I) generative models have revolutionized content creation\nbut remain highly sensitive to prompt phrasing, often requiring users to\nrepeatedly refine prompts multiple times without clear feedback. While\ntechniques such as automatic prompt engineering, controlled text embeddings,\ndenoising, and multi-turn generation mitigate these issues, they offer limited\ncontrollability, or often necessitate additional training, restricting the\ngeneralization abilities. Thus, we introduce T2I-Copilot, a training-free\nmulti-agent system that leverages collaboration between (Multimodal) Large\nLanguage Models to automate prompt phrasing, model selection, and iterative\nrefinement. This approach significantly simplifies prompt engineering while\nenhancing generation quality and text-image alignment compared to direct\ngeneration. Specifically, T2I-Copilot consists of three agents: (1) Input\nInterpreter, which parses the input prompt, resolves ambiguities, and generates\na standardized report; (2) Generation Engine, which selects the appropriate\nmodel from different types of T2I models and organizes visual and textual\nprompts to initiate generation; and (3) Quality Evaluator, which assesses\naesthetic quality and text-image alignment, providing scores and feedback for\npotential regeneration. T2I-Copilot can operate fully autonomously while also\nsupporting human-in-the-loop intervention for fine-grained control. On\nGenAI-Bench, using open-source generation models, T2I-Copilot achieves a VQA\nscore comparable to commercial models RecraftV3 and Imagen 3, surpasses\nFLUX1.1-pro by 6.17% at only 16.59% of its cost, and outperforms FLUX.1-dev and\nSD 3.5 Large by 9.11% and 6.36%. Code will be released at:\nhttps://github.com/SHI-Labs/T2I-Copilot."}
{"id": "2507.21813", "pdf": "https://arxiv.org/pdf/2507.21813.pdf", "abs": "https://arxiv.org/abs/2507.21813", "title": "Overview of ADoBo at IberLEF 2025: Automatic Detection of Anglicisms in Spanish", "authors": ["Elena Alvarez-Mellado", "Jordi Porta-Zamorano", "Constantine Lignos", "Julio Gonzalo"], "categories": ["cs.CL"], "comment": "Accepted in the journal Procesamiento del Lenguaje Natural 75", "summary": "This paper summarizes the main findings of ADoBo 2025, the shared task on\nanglicism identification in Spanish proposed in the context of IberLEF 2025.\nParticipants of ADoBo 2025 were asked to detect English lexical borrowings (or\nanglicisms) from a collection of Spanish journalistic texts. Five teams\nsubmitted their solutions for the test phase. Proposed systems included LLMs,\ndeep learning models, Transformer-based models and rule-based systems. The\nresults range from F1 scores of 0.17 to 0.99, which showcases the variability\nin performance different systems can have for this task."}
{"id": "2507.21815", "pdf": "https://arxiv.org/pdf/2507.21815.pdf", "abs": "https://arxiv.org/abs/2507.21815", "title": "HRIPBench: Benchmarking LLMs in Harm Reduction Information Provision to Support People Who Use Drugs", "authors": ["Kaixuan Wang", "Chenxin Diao", "Jason T. Jacques", "Zhongliang Guo", "Shuai Zhao"], "categories": ["cs.CL", "cs.CY"], "comment": "15 pages, 5 figures, 12 tables, a dataset", "summary": "Millions of individuals' well-being are challenged by the harms of substance\nuse. Harm reduction as a public health strategy is designed to improve their\nhealth outcomes and reduce safety risks. Some large language models (LLMs) have\ndemonstrated a decent level of medical knowledge, promising to address the\ninformation needs of people who use drugs (PWUD). However, their performance in\nrelevant tasks remains largely unexplored. We introduce HRIPBench, a benchmark\ndesigned to evaluate LLM's accuracy and safety risks in harm reduction\ninformation provision. The benchmark dataset HRIP-Basic has 2,160\nquestion-answer-evidence pairs. The scope covers three tasks: checking safety\nboundaries, providing quantitative values, and inferring polysubstance use\nrisks. We build the Instruction and RAG schemes to evaluate model behaviours\nbased on their inherent knowledge and the integration of domain knowledge. Our\nresults indicate that state-of-the-art LLMs still struggle to provide accurate\nharm reduction information, and sometimes, carry out severe safety risks to\nPWUD. The use of LLMs in harm reduction contexts should be cautiously\nconstrained to avoid inducing negative health outcomes. WARNING: This paper\ncontains illicit content that potentially induces harms."}
{"id": "2507.21828", "pdf": "https://arxiv.org/pdf/2507.21828.pdf", "abs": "https://arxiv.org/abs/2507.21828", "title": "Modelling Adjectival Modification Effects on Semantic Plausibility", "authors": ["Anna Golub", "Beate Zywietz", "Annerose Eichel"], "categories": ["cs.CL"], "comment": "Accepted at ESSLLI 2025 Student Session", "summary": "While the task of assessing the plausibility of events such as ''news is\nrelevant'' has been addressed by a growing body of work, less attention has\nbeen paid to capturing changes in plausibility as triggered by event\nmodification. Understanding changes in plausibility is relevant for tasks such\nas dialogue generation, commonsense reasoning, and hallucination detection as\nit allows to correctly model, for example, ''gentle sarcasm'' as a sign of\ncloseness rather than unkindness among friends [9]. In this work, we tackle the\nADEPT challenge benchmark [6] consisting of 16K English sentence pairs\ndiffering by exactly one adjectival modifier. Our modeling experiments provide\na conceptually novel method by using sentence transformers, and reveal that\nboth they and transformer-based models struggle with the task at hand, and\nsentence transformers - despite their conceptual alignment with the task - even\nunder-perform in comparison to models like RoBERTa. Furthermore, an in-depth\ncomparison with prior work highlights the importance of a more realistic,\nbalanced evaluation method: imbalances distort model performance and evaluation\nmetrics, and weaken result trustworthiness."}
{"id": "2507.21831", "pdf": "https://arxiv.org/pdf/2507.21831.pdf", "abs": "https://arxiv.org/abs/2507.21831", "title": "Introducing HALC: A general pipeline for finding optimal prompting strategies for automated coding with LLMs in the computational social sciences", "authors": ["Andreas Reich", "Claudia Thoms", "Tobias Schrimpf"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "48 pages, 9 figures and 8 tables", "summary": "LLMs are seeing widespread use for task automation, including automated\ncoding in the social sciences. However, even though researchers have proposed\ndifferent prompting strategies, their effectiveness varies across LLMs and\ntasks. Often trial and error practices are still widespread. We propose\nHALC$-$a general pipeline that allows for the systematic and reliable\nconstruction of optimal prompts for any given coding task and model, permitting\nthe integration of any prompting strategy deemed relevant. To investigate LLM\ncoding and validate our pipeline, we sent a total of 1,512 individual prompts\nto our local LLMs in over two million requests. We test prompting strategies\nand LLM task performance based on few expert codings (ground truth). When\ncompared to these expert codings, we find prompts that code reliably for single\nvariables (${\\alpha}$climate = .76; ${\\alpha}$movement = .78) and across two\nvariables (${\\alpha}$climate = .71; ${\\alpha}$movement = .74) using the LLM\nMistral NeMo. Our prompting strategies are set up in a way that aligns the LLM\nto our codebook$-$we are not optimizing our codebook for LLM friendliness. Our\npaper provides insights into the effectiveness of different prompting\nstrategies, crucial influencing factors, and the identification of reliable\nprompts for each coding task and model."}
{"id": "2507.21836", "pdf": "https://arxiv.org/pdf/2507.21836.pdf", "abs": "https://arxiv.org/abs/2507.21836", "title": "AutoTIR: Autonomous Tools Integrated Reasoning via Reinforcement Learning", "authors": ["Yifan Wei", "Xiaoyan Yu", "Yixuan Weng", "Tengfei Pan", "Angsheng Li", "Li Du"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs), when enhanced through reasoning-oriented\npost-training, evolve into powerful Large Reasoning Models (LRMs).\nTool-Integrated Reasoning (TIR) further extends their capabilities by\nincorporating external tools, but existing methods often rely on rigid,\npredefined tool-use patterns that risk degrading core language competence.\nInspired by the human ability to adaptively select tools, we introduce AutoTIR,\na reinforcement learning framework that enables LLMs to autonomously decide\nwhether and which tool to invoke during the reasoning process, rather than\nfollowing static tool-use strategies. AutoTIR leverages a hybrid reward\nmechanism that jointly optimizes for task-specific answer correctness,\nstructured output adherence, and penalization of incorrect tool usage, thereby\nencouraging both precise reasoning and efficient tool integration. Extensive\nevaluations across diverse knowledge-intensive, mathematical, and general\nlanguage modeling tasks demonstrate that AutoTIR achieves superior overall\nperformance, significantly outperforming baselines and exhibits superior\ngeneralization in tool-use behavior. These results highlight the promise of\nreinforcement learning in building truly generalizable and scalable TIR\ncapabilities in LLMs. The code and data are available at\nhttps://github.com/weiyifan1023/AutoTIR."}
{"id": "2507.21892", "pdf": "https://arxiv.org/pdf/2507.21892.pdf", "abs": "https://arxiv.org/abs/2507.21892", "title": "Graph-R1: Towards Agentic GraphRAG Framework via End-to-end Reinforcement Learning", "authors": ["Haoran Luo", "Haihong E", "Guanting Chen", "Qika Lin", "Yikai Guo", "Fangzhi Xu", "Zemin Kuang", "Meina Song", "Xiaobao Wu", "Yifan Zhu", "Luu Anh Tuan"], "categories": ["cs.CL"], "comment": "Preprint", "summary": "Retrieval-Augmented Generation (RAG) mitigates hallucination in LLMs by\nincorporating external knowledge, but relies on chunk-based retrieval that\nlacks structural semantics. GraphRAG methods improve RAG by modeling knowledge\nas entity-relation graphs, but still face challenges in high construction cost,\nfixed one-time retrieval, and reliance on long-context reasoning and prompt\ndesign. To address these challenges, we propose Graph-R1, an agentic GraphRAG\nframework via end-to-end reinforcement learning (RL). It introduces lightweight\nknowledge hypergraph construction, models retrieval as a multi-turn\nagent-environment interaction, and optimizes the agent process via an\nend-to-end reward mechanism. Experiments on standard RAG datasets show that\nGraph-R1 outperforms traditional GraphRAG and RL-enhanced RAG methods in\nreasoning accuracy, retrieval efficiency, and generation quality."}
{"id": "2507.21914", "pdf": "https://arxiv.org/pdf/2507.21914.pdf", "abs": "https://arxiv.org/abs/2507.21914", "title": "Rote Learning Considered Useful: Generalizing over Memorized Data in LLMs", "authors": ["Qinyuan Wu", "Soumi Das", "Mahsa Amani", "Bishwamittra Ghosh", "Mohammad Aflah Khan", "Krishna P. Gummadi", "Muhammad Bilal Zafar"], "categories": ["cs.CL"], "comment": "Preprint", "summary": "Rote learning is a memorization technique based on repetition. It is commonly\nbelieved to hinder generalization by encouraging verbatim memorization rather\nthan deeper understanding. This insight holds for even learning factual\nknowledge that inevitably requires a certain degree of memorization. In this\nwork, we demonstrate that LLMs can be trained to generalize from rote memorized\ndata. We introduce a two-phase memorize-then-generalize framework, where the\nmodel first rote memorizes factual subject-object associations using a\nsemantically meaningless token and then learns to generalize by fine-tuning on\na small set of semantically meaningful prompts. Extensive experiments over 8\nLLMs show that the models can reinterpret rote memorized data through the\nsemantically meaningful prompts, as evidenced by the emergence of structured,\nsemantically aligned latent representations between the two. This surprising\nfinding opens the door to both effective and efficient knowledge injection and\npossible risks of repurposing the memorized data for malicious usage."}
{"id": "2507.21919", "pdf": "https://arxiv.org/pdf/2507.21919.pdf", "abs": "https://arxiv.org/abs/2507.21919", "title": "Training language models to be warm and empathetic makes them less reliable and more sycophantic", "authors": ["Lujain Ibrahim", "Franziska Sofia Hafner", "Luc Rocher"], "categories": ["cs.CL", "cs.AI", "cs.CY"], "comment": null, "summary": "Artificial intelligence (AI) developers are increasingly building language\nmodels with warm and empathetic personas that millions of people now use for\nadvice, therapy, and companionship. Here, we show how this creates a\nsignificant trade-off: optimizing language models for warmth undermines their\nreliability, especially when users express vulnerability. We conducted\ncontrolled experiments on five language models of varying sizes and\narchitectures, training them to produce warmer, more empathetic responses, then\nevaluating them on safety-critical tasks. Warm models showed substantially\nhigher error rates (+10 to +30 percentage points) than their original\ncounterparts, promoting conspiracy theories, providing incorrect factual\ninformation, and offering problematic medical advice. They were also\nsignificantly more likely to validate incorrect user beliefs, particularly when\nuser messages expressed sadness. Importantly, these effects were consistent\nacross different model architectures, and occurred despite preserved\nperformance on standard benchmarks, revealing systematic risks that current\nevaluation practices may fail to detect. As human-like AI systems are deployed\nat an unprecedented scale, our findings indicate a need to rethink how we\ndevelop and oversee these systems that are reshaping human relationships and\nsocial interaction."}
{"id": "2507.21931", "pdf": "https://arxiv.org/pdf/2507.21931.pdf", "abs": "https://arxiv.org/abs/2507.21931", "title": "Post-Training Large Language Models via Reinforcement Learning from Self-Feedback", "authors": ["Carel van Niekerk", "Renato Vukovic", "Benjamin Matthias Ruppik", "Hsien-chin Lin", "Milica Gašić"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) often produce plausible but poorly-calibrated\nanswers, limiting their reliability on reasoning-intensive tasks. We present\nReinforcement Learning from Self-Feedback (RLSF), a post-training stage that\nuses the model's own confidence as an intrinsic reward, mimicking how humans\nlearn in the absence of external feedback. After a frozen LLM generates several\nchain-of-thought solutions, we define and compute the confidence of each final\nanswer span and rank the traces accordingly. These synthetic preferences are\nthen used to fine-tune the policy with standard preference optimization,\nsimilar to RLHF yet requiring no human labels, gold answers, or externally\ncurated rewards.\n  RLSF simultaneously (i) refines the model's probability estimates --\nrestoring well-behaved calibration -- and (ii) strengthens step-by-step\nreasoning, yielding improved performance on arithmetic reasoning and\nmultiple-choice question answering.\n  By turning a model's own uncertainty into useful self-feedback, RLSF affirms\nreinforcement learning on intrinsic model behaviour as a principled and\ndata-efficient component of the LLM post-training pipeline and warrents further\nresearch in intrinsic rewards for LLM post-training."}
{"id": "2507.21934", "pdf": "https://arxiv.org/pdf/2507.21934.pdf", "abs": "https://arxiv.org/abs/2507.21934", "title": "Culinary Crossroads: A RAG Framework for Enhancing Diversity in Cross-Cultural Recipe Adaptation", "authors": ["Tianyi Hu", "Andrea Morales-Garzón", "Jingyi Zheng", "Maria Maistro", "Daniel Hershcovich"], "categories": ["cs.CL"], "comment": null, "summary": "In cross-cultural recipe adaptation, the goal is not only to ensure cultural\nappropriateness and retain the original dish's essence, but also to provide\ndiverse options for various dietary needs and preferences. Retrieval Augmented\nGeneration (RAG) is a promising approach, combining the retrieval of real\nrecipes from the target cuisine for cultural adaptability with large language\nmodels (LLMs) for relevance. However, it remains unclear whether RAG can\ngenerate diverse adaptation results. Our analysis shows that RAG tends to\noverly rely on a limited portion of the context across generations, failing to\nproduce diverse outputs even when provided with varied contextual inputs. This\nreveals a key limitation of RAG in creative tasks with multiple valid answers:\nit fails to leverage contextual diversity for generating varied responses. To\naddress this issue, we propose CARRIAGE, a plug-and-play RAG framework for\ncross-cultural recipe adaptation that enhances diversity in both retrieval and\ncontext organization. To our knowledge, this is the first RAG framework that\nexplicitly aims to generate highly diverse outputs to accommodate multiple user\npreferences. Our experiments show that CARRIAGE achieves Pareto efficiency in\nterms of diversity and quality of recipe adaptation compared to closed-book\nLLMs."}
{"id": "2507.21980", "pdf": "https://arxiv.org/pdf/2507.21980.pdf", "abs": "https://arxiv.org/abs/2507.21980", "title": "Predicting Microbial Ontology and Pathogen Risk from Environmental Metadata with Large Language Models", "authors": ["Hyunwoo Yoo", "Gail L. Rosen"], "categories": ["cs.CL"], "comment": null, "summary": "Traditional machine learning models struggle to generalize in microbiome\nstudies where only metadata is available, especially in small-sample settings\nor across studies with heterogeneous label formats. In this work, we explore\nthe use of large language models (LLMs) to classify microbial samples into\nontology categories such as EMPO 3 and related biological labels, as well as to\npredict pathogen contamination risk, specifically the presence of E. Coli,\nusing environmental metadata alone. We evaluate LLMs such as ChatGPT-4o, Claude\n3.7 Sonnet, Grok-3, and LLaMA 4 in zero-shot and few-shot settings, comparing\ntheir performance against traditional models like Random Forests across\nmultiple real-world datasets. Our results show that LLMs not only outperform\nbaselines in ontology classification, but also demonstrate strong predictive\nability for contamination risk, generalizing across sites and metadata\ndistributions. These findings suggest that LLMs can effectively reason over\nsparse, heterogeneous biological metadata and offer a promising metadata-only\napproach for environmental microbiology and biosurveillance applications."}
{"id": "2507.22050", "pdf": "https://arxiv.org/pdf/2507.22050.pdf", "abs": "https://arxiv.org/abs/2507.22050", "title": "DeepSieve: Information Sieving via LLM-as-a-Knowledge-Router", "authors": ["Minghao Guo", "Qingcheng Zeng", "Xujiang Zhao", "Yanchi Liu", "Wenchao Yu", "Mengnan Du", "Haifeng Chen", "Wei Cheng"], "categories": ["cs.CL"], "comment": "22 pages, work in progress", "summary": "Large Language Models (LLMs) excel at many reasoning tasks but struggle with\nknowledge-intensive queries due to their inability to dynamically access\nup-to-date or domain-specific information. Retrieval-Augmented Generation (RAG)\nhas emerged as a promising solution, enabling LLMs to ground their responses in\nexternal sources. However, existing RAG methods lack fine-grained control over\nboth the query and source sides, often resulting in noisy retrieval and shallow\nreasoning. In this work, we introduce DeepSieve, an agentic RAG framework that\nincorporates information sieving via LLM-as-a-knowledge-router. DeepSieve\ndecomposes complex queries into structured sub-questions and recursively routes\neach to the most suitable knowledge source, filtering irrelevant information\nthrough a multi-stage distillation process. Our design emphasizes modularity,\ntransparency, and adaptability, leveraging recent advances in agentic system\ndesign. Experiments on multi-hop QA tasks across heterogeneous sources\ndemonstrate improved reasoning depth, retrieval precision, and interpretability\nover conventional RAG approaches."}
{"id": "2507.17307", "pdf": "https://arxiv.org/pdf/2507.17307.pdf", "abs": "https://arxiv.org/abs/2507.17307", "title": "R-Stitch: Dynamic Trajectory Stitching for Efficient Reasoning", "authors": ["Zhuokun Chen", "Zeren Chen", "Jiahao He", "Mingkui Tan", "Jianfei Cai", "Bohan Zhuang"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "Chain-of-thought (CoT) reasoning enhances the problem-solving capabilities of\nlarge language models by encouraging step-by-step intermediate reasoning during\ninference. While effective, CoT introduces substantial computational overhead\ndue to its reliance on autoregressive decoding over long token sequences.\nExisting acceleration strategies either reduce sequence length through early\nstopping or compressive reward designs, or improve decoding speed via\nspeculative decoding with smaller models. However, speculative decoding suffers\nfrom limited speedup when the agreement between small and large models is low,\nand fails to exploit the potential advantages of small models in producing\nconcise intermediate reasoning. In this paper, we present R-Stitch, a\ntoken-level, confidence-based hybrid decoding framework that accelerates CoT\ninference by switching between a small language model (SLM) and a large\nlanguage model (LLM) along the reasoning trajectory. R-Stitch uses the SLM to\ngenerate tokens by default and delegates to the LLM only when the SLM's\nconfidence falls below a threshold. This design avoids full-sequence rollback\nand selectively invokes the LLM on uncertain steps, preserving both efficiency\nand answer quality. R-Stitch is model-agnostic, training-free, and compatible\nwith standard decoding pipelines. Experiments on math reasoning benchmarks\ndemonstrate that R-Stitch achieves up to 85\\% reduction in inference latency\nwith negligible accuracy drop, highlighting its practical effectiveness in\naccelerating CoT reasoning."}
{"id": "2507.21075", "pdf": "https://arxiv.org/pdf/2507.21075.pdf", "abs": "https://arxiv.org/abs/2507.21075", "title": "Can LLMs Reason About Trust?: A Pilot Study", "authors": ["Anushka Debnath", "Stephen Cranefield", "Emiliano Lorini", "Bastin Tony Roy Savarimuthu"], "categories": ["cs.HC", "cs.CL", "cs.CY", "cs.MA"], "comment": "17 pages, 5 figures, 3 tables Accepted for presentation as a full\n  paper at the COINE 2025 workshop at AAMAS 2025 see\n  https://coin-workshop.github.io/coine-2025-detroit/accepted_for_presentation.html", "summary": "In human society, trust is an essential component of social attitude that\nhelps build and maintain long-term, healthy relationships which creates a\nstrong foundation for cooperation, enabling individuals to work together\neffectively and achieve shared goals. As many human interactions occur through\nelectronic means such as using mobile apps, the potential arises for AI systems\nto assist users in understanding the social state of their relationships. In\nthis paper we investigate the ability of Large Language Models (LLMs) to reason\nabout trust between two individuals in an environment which requires fostering\ntrust relationships. We also assess whether LLMs are capable of inducing trust\nby role-playing one party in a trust based interaction and planning actions\nwhich can instil trust."}
{"id": "2507.21089", "pdf": "https://arxiv.org/pdf/2507.21089.pdf", "abs": "https://arxiv.org/abs/2507.21089", "title": "Emotionally Aware Moderation: The Potential of Emotion Monitoring in Shaping Healthier Social Media Conversations", "authors": ["Xiaotian Su", "Naim Zierau", "Soomin Kim", "April Yi Wang", "Thiemo Wambsganss"], "categories": ["cs.HC", "cs.CL"], "comment": null, "summary": "Social media platforms increasingly employ proactive moderation techniques,\nsuch as detecting and curbing toxic and uncivil comments, to prevent the spread\nof harmful content. Despite these efforts, such approaches are often criticized\nfor creating a climate of censorship and failing to address the underlying\ncauses of uncivil behavior. Our work makes both theoretical and practical\ncontributions by proposing and evaluating two types of emotion monitoring\ndashboards to users' emotional awareness and mitigate hate speech. In a study\ninvolving 211 participants, we evaluate the effects of the two mechanisms on\nuser commenting behavior and emotional experiences. The results reveal that\nthese interventions effectively increase users' awareness of their emotional\nstates and reduce hate speech. However, our findings also indicate potential\nunintended effects, including increased expression of negative emotions (Angry,\nFear, and Sad) when discussing sensitive issues. These insights provide a basis\nfor further research on integrating proactive emotion regulation tools into\nsocial media platforms to foster healthier digital interactions."}
{"id": "2507.21103", "pdf": "https://arxiv.org/pdf/2507.21103.pdf", "abs": "https://arxiv.org/abs/2507.21103", "title": "Analise Semantica Automatizada com LLM e RAG para Bulas Farmaceuticas", "authors": ["Daniel Meireles do Rego"], "categories": ["cs.IR", "cs.CL"], "comment": "in Portuguese language", "summary": "The production of digital documents has been growing rapidly in academic,\nbusiness, and health environments, presenting new challenges in the efficient\nextraction and analysis of unstructured information. This work investigates the\nuse of RAG (Retrieval-Augmented Generation) architectures combined with\nLarge-Scale Language Models (LLMs) to automate the analysis of documents in PDF\nformat. The proposal integrates vector search techniques by embeddings,\nsemantic data extraction and generation of contextualized natural language\nresponses. To validate the approach, we conducted experiments with drug package\ninserts extracted from official public sources. The semantic queries applied\nwere evaluated by metrics such as accuracy, completeness, response speed and\nconsistency. The results indicate that the combination of RAG with LLMs offers\nsignificant gains in intelligent information retrieval and interpretation of\nunstructured technical texts."}
{"id": "2507.21105", "pdf": "https://arxiv.org/pdf/2507.21105.pdf", "abs": "https://arxiv.org/abs/2507.21105", "title": "AgentMaster: A Multi-Agent Conversational Framework Using A2A and MCP Protocols for Multimodal Information Retrieval and Analysis", "authors": ["Callie C. Liao", "Duoduo Liao", "Sai Surya Gadiraju"], "categories": ["cs.IR", "cs.AI", "cs.CL"], "comment": null, "summary": "The rise of Multi-Agent Systems (MAS) in Artificial Intelligence (AI),\nespecially integrated with Large Language Models (LLMs), has greatly\nfacilitated the resolution of complex tasks. However, current systems are still\nfacing challenges of inter-agent communication, coordination, and interaction\nwith heterogeneous tools and resources. Most recently, the Model Context\nProtocol (MCP) by Anthropic and Agent-to-Agent (A2A) communication protocol by\nGoogle have been introduced, and to the best of our knowledge, very few\napplications exist where both protocols are employed within a single MAS\nframework. We present a pilot study of AgentMaster, a novel modular\nmulti-protocol MAS framework with self-implemented A2A and MCP, enabling\ndynamic coordination and flexible communication. Through a unified\nconversational interface, the system supports natural language interaction\nwithout prior technical expertise and responds to multimodal queries for tasks\nincluding information retrieval, question answering, and image analysis.\nEvaluation through the BERTScore F1 and LLM-as-a-Judge metric G-Eval averaged\n96.3\\% and 87.1\\%, revealing robust inter-agent coordination, query\ndecomposition, dynamic routing, and domain-specific, relevant responses.\nOverall, our proposed framework contributes to the potential capabilities of\ndomain-specific, cooperative, and scalable conversational AI powered by MAS."}
{"id": "2507.21170", "pdf": "https://arxiv.org/pdf/2507.21170.pdf", "abs": "https://arxiv.org/abs/2507.21170", "title": "OneShield -- the Next Generation of LLM Guardrails", "authors": ["Chad DeLuca", "Anna Lisa Gentile", "Shubhi Asthana", "Bing Zhang", "Pawan Chowdhary", "Kellen Cheng", "Basel Shbita", "Pengyuan Li", "Guang-Jie Ren", "Sandeep Gopisetty"], "categories": ["cs.CR", "cs.AI", "cs.CL"], "comment": null, "summary": "The rise of Large Language Models has created a general excitement about the\ngreat potential for a myriad of applications. While LLMs offer many\npossibilities, questions about safety, privacy, and ethics have emerged, and\nall the key actors are working to address these issues with protective measures\nfor their own models and standalone solutions. The constantly evolving nature\nof LLMs makes the task of universally shielding users against their potential\nrisks extremely challenging, and one-size-fits-all solutions unfeasible. In\nthis work, we propose OneShield, our stand-alone, model-agnostic and\ncustomizable solution to safeguard LLMs. OneShield aims to provide facilities\nfor defining risk factors, expressing and declaring contextual safety and\ncompliance policies, and mitigating LLM risks, with a focus on each specific\ncustomer. We describe the implementation of the framework, the scalability\nconsiderations and provide usage statistics of OneShield since its first\ndeployment."}
{"id": "2507.21183", "pdf": "https://arxiv.org/pdf/2507.21183.pdf", "abs": "https://arxiv.org/abs/2507.21183", "title": "MaPPO: Maximum a Posteriori Preference Optimization with Prior Knowledge", "authors": ["Guangchen Lan", "Sipeng Zhang", "Tianle Wang", "Yuwei Zhang", "Daoan Zhang", "Xinpeng Wei", "Xiaoman Pan", "Hongming Zhang", "Dong-Jun Han", "Christopher G. Brinton"], "categories": ["cs.LG", "cs.AI", "cs.CL", "I.2.6; I.2.7"], "comment": null, "summary": "As the era of large language models (LLMs) on behalf of users unfolds,\nPreference Optimization (PO) methods have become a central approach to aligning\nLLMs with human preferences and improving performance. We propose Maximum a\nPosteriori Preference Optimization (MaPPO), a framework for learning from\npreferences that explicitly incorporates prior reward knowledge into the\noptimization objective. While existing methods such as Direct Preference\nOptimization (DPO) and its variants treat preference learning as a Maximum\nLikelihood Estimation (MLE) problem, MaPPO extends this paradigm by integrating\nprior reward estimates into a principled Maximum a Posteriori (MaP) objective.\nThis not only generalizes DPO and its variants, but also enhances alignment by\nmitigating the oversimplified binary classification of responses. More\nimportantly, MaPPO introduces no additional hyperparameter, and supports\npreference optimization in both offline and online settings. In addition, MaPPO\ncan be used as a plugin with consistent improvement on DPO variants, including\nwidely used SimPO, IPO, and CPO. Extensive empirical evaluations of different\nmodel sizes and model series on three standard benchmarks, including MT-Bench,\nAlpacaEval 2.0, and Arena-Hard, demonstrate consistent improvements in\nalignment performance without sacrificing computational efficiency."}
{"id": "2507.21184", "pdf": "https://arxiv.org/pdf/2507.21184.pdf", "abs": "https://arxiv.org/abs/2507.21184", "title": "EvoSLD: Automated Neural Scaling Law Discovery With Large Language Models", "authors": ["Haowei Lin", "Xiangyu Wang", "Jianzhu Ma", "Yitao Liang"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "Scaling laws are fundamental mathematical relationships that predict how\nneural network performance evolves with changes in variables such as model\nsize, dataset size, and computational resources. Traditionally, discovering\nthese laws requires extensive human expertise and manual experimentation. We\nintroduce EvoSLD, an automated framework for Scaling Law Discovery (SLD) that\nleverages evolutionary algorithms guided by Large Language Models (LLMs) to\nco-evolve symbolic expressions and their optimization routines. Formulated to\nhandle scaling variables, control variables, and response metrics across\ndiverse experimental settings, EvoSLD searches for parsimonious, universal\nfunctional forms that minimize fitting errors on grouped data subsets.\nEvaluated on five real-world scenarios from recent literature, EvoSLD\nrediscovers exact human-derived laws in two cases and surpasses them in others,\nachieving up to orders-of-magnitude reductions in normalized mean squared error\non held-out test sets. Compared to baselines like symbolic regression and\nablated variants, EvoSLD demonstrates superior accuracy, interpretability, and\nefficiency, highlighting its potential to accelerate AI research. Code is\navailable at https://github.com/linhaowei1/SLD."}
{"id": "2507.21257", "pdf": "https://arxiv.org/pdf/2507.21257.pdf", "abs": "https://arxiv.org/abs/2507.21257", "title": "CompoST: A Benchmark for Analyzing the Ability of LLMs To Compositionally Interpret Questions in a QALD Setting", "authors": ["David Maria Schmidt", "Raoul Schubert", "Philipp Cimiano"], "categories": ["cs.AI", "cs.CL"], "comment": "Research Track, 24th International Semantic Web Conference (ISWC\n  2025), November 2-6, 2025, Nara, Japan", "summary": "Language interpretation is a compositional process, in which the meaning of\nmore complex linguistic structures is inferred from the meaning of their parts.\nLarge language models possess remarkable language interpretation capabilities\nand have been successfully applied to interpret questions by mapping them to\nSPARQL queries. An open question is how systematic this interpretation process\nis. Toward this question, in this paper, we propose a benchmark for\ninvestigating to what extent the abilities of LLMs to interpret questions are\nactually compositional. For this, we generate three datasets of varying\ndifficulty based on graph patterns in DBpedia, relying on Lemon lexica for\nverbalization. Our datasets are created in a very controlled fashion in order\nto test the ability of LLMs to interpret structurally complex questions, given\nthat they have seen the atomic building blocks. This allows us to evaluate to\nwhat degree LLMs are able to interpret complex questions for which they\n\"understand\" the atomic parts. We conduct experiments with models of different\nsizes using both various prompt and few-shot optimization techniques as well as\nfine-tuning. Our results show that performance in terms of macro $F_1$ degrades\nfrom $0.45$ over $0.26$ down to $0.09$ with increasing deviation from the\nsamples optimized on. Even when all necessary information was provided to the\nmodel in the input, the $F_1$ scores do not exceed $0.57$ for the dataset of\nlowest complexity. We thus conclude that LLMs struggle to systematically and\ncompositionally interpret questions and map them into SPARQL queries."}
{"id": "2507.21276", "pdf": "https://arxiv.org/pdf/2507.21276.pdf", "abs": "https://arxiv.org/abs/2507.21276", "title": "LeMix: Unified Scheduling for LLM Training and Inference on Multi-GPU Systems", "authors": ["Yufei Li", "Zexin Li", "Yinglun Zhu", "Cong Liu"], "categories": ["cs.AI", "cs.CL", "cs.DC"], "comment": "Accepted by RTSS 2025", "summary": "Modern deployment of large language models (LLMs) frequently involves both\ninference serving and continuous retraining to stay aligned with evolving data\nand user feedback. Common practices separate these workloads onto distinct\nservers in isolated phases, causing substantial inefficiencies (e.g., GPU\nidleness) and delayed adaptation to new data in distributed settings. Our\nempirical analysis reveals that these inefficiencies stem from dynamic request\narrivals during serving and workload heterogeneity in pipeline-parallel\ntraining. To address these challenges, we propose LeMix, a system for\nco-locating and managing concurrent LLM serving and training workloads. LeMix\nintegrates offline profiling, execution prediction mechanisms, and runtime\nscheduling to dynamically adapt resource allocation based on workload\ncharacteristics and system conditions. By understanding task-specific behaviors\nand co-execution interference across shared nodes, LeMix improves utilization\nand serving quality without compromising serving responsiveness. Our evaluation\nshows that LeMix improves throughput by up to 3.53x, reduces inference loss by\nup to 0.61x, and delivers up to 2.12x higher response time SLO attainment over\ntraditional separate setups. To our knowledge, this is the first work to\nuncover and exploit the opportunities of joint LLM inference and training,\npaving the way for more resource-efficient deployment of LLMs in production\nenvironments."}
{"id": "2507.21389", "pdf": "https://arxiv.org/pdf/2507.21389.pdf", "abs": "https://arxiv.org/abs/2507.21389", "title": "Teaching Language Models To Gather Information Proactively", "authors": ["Tenghao Huang", "Sihao Chen", "Muhao Chen", "Jonathan May", "Longqi Yang", "Mengting Wan", "Pei Zhou"], "categories": ["cs.AI", "cs.CL"], "comment": null, "summary": "Large language models (LLMs) are increasingly expected to function as\ncollaborative partners, engaging in back-and-forth dialogue to solve complex,\nambiguous problems. However, current LLMs often falter in real-world settings,\ndefaulting to passive responses or narrow clarifications when faced with\nincomplete or under-specified prompts, falling short of proactively gathering\nthe missing information that is crucial for high-quality solutions. In this\nwork, we introduce a new task paradigm: proactive information gathering, where\nLLMs must identify gaps in the provided context and strategically elicit\nimplicit user knowledge through targeted questions. To systematically study and\ntrain this capability, we design a scalable framework that generates partially\nspecified, real-world tasks, masking key information and simulating authentic\nambiguity. Within this setup, our core innovation is a reinforcement finetuning\nstrategy that rewards questions that elicit genuinely new, implicit user\ninformation -- such as hidden domain expertise or fine-grained requirements --\nthat would otherwise remain unspoken. Experiments demonstrate that our trained\nQwen-2.5-7B model significantly outperforms o3-mini by 18% on automatic\nevaluation metrics. More importantly, human evaluation reveals that\nclarification questions and final outlines generated by our model are favored\nby human annotators by 42% and 28% respectively. Together, these results\nhighlight the value of proactive clarification in elevating LLMs from passive\ntext generators to genuinely collaborative thought partners."}
{"id": "2507.21391", "pdf": "https://arxiv.org/pdf/2507.21391.pdf", "abs": "https://arxiv.org/abs/2507.21391", "title": "Multimodal LLMs as Customized Reward Models for Text-to-Image Generation", "authors": ["Shijie Zhou", "Ruiyi Zhang", "Huaisheng Zhu", "Branislav Kveton", "Yufan Zhou", "Jiuxiang Gu", "Jian Chen", "Changyou Chen"], "categories": ["cs.CV", "cs.AI", "cs.CL"], "comment": "Accepted at ICCV 2025. Code available at\n  https://github.com/sjz5202/LLaVA-Reward", "summary": "We introduce LLaVA-Reward, an efficient reward model designed to\nautomatically evaluate text-to-image (T2I) generations across multiple\nperspectives, leveraging pretrained multimodal large language models (MLLMs).\nExisting MLLM-based approaches require instruction-following data for\nsupervised fine-tuning and evaluate generation quality on analyzing text\nresponse, which is time-consuming and difficult to train. To address this\nproblem, we propose LLaVA-Reward, which directly utilizes the hidden states of\nMLLMs given text-image pairs. To enhance the bidirectional interaction between\nvisual and textual representations in decoder-only MLLMs, we further propose\nadding a Skip-connection Cross Attention (SkipCA) module. This design enhances\ntext-image correlation reasoning by connecting early-layer visual features with\nlater-layer hidden representations.In addition, LLaVA-Reward supports different\ntypes of preference data for efficient fine-tuning, including paired preference\ndata and unpaired data. We train LLaVA-Reward on four evaluation perspectives:\ntext-image alignment, fidelity/artifact, safety, and overall ranking. Empirical\nresults demonstrate that LLaVA-Reward outperforms conventional and MLLM-based\nmethods in generating human-aligned scores for automatic evaluations and\ninference-time scaling in text-to-image generations."}
{"id": "2507.21420", "pdf": "https://arxiv.org/pdf/2507.21420.pdf", "abs": "https://arxiv.org/abs/2507.21420", "title": "ReGATE: Learning Faster and Better with Fewer Tokens in MLLMs", "authors": ["Chaoyu Li", "Yogesh Kulkarni", "Pooyan Fazli"], "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "The computational cost of training multimodal large language models (MLLMs)\nrapidly increases with the number of tokens involved. Existing efficiency\nmethods primarily target inference and rely on token reduction or merging,\noffering limited benefit during training. In this paper, we propose ReGATE\n(Reference$-$Guided Adaptive Token Elision), an adaptive token pruning method\nfor accelerating MLLM training. Specifically, ReGATE adopts a teacher-student\nframework in which the MLLM being trained serves as the student, and a frozen\nreference large language model (LLM) acts as the teacher. The teacher computes\nper-token reference losses, which are combined with an exponential moving\naverage (EMA) of the student's own difficulty scores. This adaptive\ndifficulty-based scoring enables the selective processing of crucial tokens\nwhile bypassing less informative ones in the forward pass, significantly\nreducing computational overhead. Experiments demonstrate that ReGATE, when\napplied to VideoLLaMA2, matches the peak accuracy of standard training on\nMVBench up to 2$\\times$ faster, using only 35% of the tokens. With additional\ntraining, it even surpasses the baseline on several multimodal benchmarks, all\nwhile reducing the total token count by over 41%. Code and models will be\nreleased soon."}
{"id": "2507.21513", "pdf": "https://arxiv.org/pdf/2507.21513.pdf", "abs": "https://arxiv.org/abs/2507.21513", "title": "What Does it Mean for a Neural Network to Learn a \"World Model\"?", "authors": ["Kenneth Li", "Fernanda Viégas", "Martin Wattenberg"], "categories": ["cs.AI", "cs.CL"], "comment": null, "summary": "We propose a set of precise criteria for saying a neural net learns and uses\na \"world model.\" The goal is to give an operational meaning to terms that are\noften used informally, in order to provide a common language for experimental\ninvestigation. We focus specifically on the idea of representing a latent\n\"state space\" of the world, leaving modeling the effect of actions to future\nwork. Our definition is based on ideas from the linear probing literature, and\nformalizes the notion of a computation that factors through a representation of\nthe data generation process. An essential addition to the definition is a set\nof conditions to check that such a \"world model\" is not a trivial consequence\nof the neural net's data or task."}
{"id": "2507.21903", "pdf": "https://arxiv.org/pdf/2507.21903.pdf", "abs": "https://arxiv.org/abs/2507.21903", "title": "Who's important? -- SUnSET: Synergistic Understanding of Stakeholder, Events and Time for Timeline Generation", "authors": ["Tiviatis Sim", "Kaiwen Yang", "Shen Xin", "Kenji Kawaguchi"], "categories": ["cs.SI", "cs.CL", "cs.IR"], "comment": null, "summary": "As news reporting becomes increasingly global and decentralized online,\ntracking related events across multiple sources presents significant\nchallenges. Existing news summarization methods typically utilizes Large\nLanguage Models and Graphical methods on article-based summaries. However, this\nis not effective since it only considers the textual content of similarly dated\narticles to understand the gist of the event. To counteract the lack of\nanalysis on the parties involved, it is essential to come up with a novel\nframework to gauge the importance of stakeholders and the connection of related\nevents through the relevant entities involved. Therefore, we present SUnSET:\nSynergistic Understanding of Stakeholder, Events and Time for the task of\nTimeline Summarization (TLS). We leverage powerful Large Language Models (LLMs)\nto build SET triplets and introduced the use of stakeholder-based ranking to\nconstruct a $Relevancy$ metric, which can be extended into general situations.\nOur experimental results outperform all prior baselines and emerged as the new\nState-of-the-Art, highlighting the impact of stakeholder information within\nnews article."}
{"id": "2507.22025", "pdf": "https://arxiv.org/pdf/2507.22025.pdf", "abs": "https://arxiv.org/abs/2507.22025", "title": "UI-AGILE: Advancing GUI Agents with Effective Reinforcement Learning and Precise Inference-Time Grounding", "authors": ["Shuquan Lian", "Yuhang Wu", "Jia Ma", "Zihan Song", "Bingqi Chen", "Xiawu Zheng", "Hui Li"], "categories": ["cs.AI", "cs.CL", "cs.CV"], "comment": null, "summary": "The emergence of Multimodal Large Language Models (MLLMs) has driven\nsignificant advances in Graphical User Interface (GUI) agent capabilities.\nNevertheless, existing GUI agent training and inference techniques still suffer\nfrom a dilemma for reasoning designs, ineffective reward, and visual noise. To\naddress these issues, we introduce UI-AGILE, a comprehensive framework\nenhancing GUI agents at both the training and inference stages. For training,\nwe propose a suite of improvements to the Supervised Fine-Tuning (SFT) process:\n1) a Continuous Reward function to incentivize high-precision grounding; 2) a\n\"Simple Thinking\" reward to balance planning with speed and grounding accuracy;\nand 3) a Cropping-based Resampling strategy to mitigate the sparse reward\nproblem and improve learning on complex tasks. For inference, we present\nDecomposed Grounding with Selection, a novel method that dramatically improves\ngrounding accuracy on high-resolution displays by breaking the image into\nsmaller, manageable parts. Experiments show that UI-AGILE achieves the\nstate-of-the-art performance on two benchmarks ScreenSpot-Pro and\nScreenSpot-v2. For instance, using both our proposed training and inference\nenhancement methods brings 23% grounding accuracy improvement over the best\nbaseline on ScreenSpot-Pro."}
{"id": "2507.22034", "pdf": "https://arxiv.org/pdf/2507.22034.pdf", "abs": "https://arxiv.org/abs/2507.22034", "title": "UserBench: An Interactive Gym Environment for User-Centric Agents", "authors": ["Cheng Qian", "Zuxin Liu", "Akshara Prabhakar", "Zhiwei Liu", "Jianguo Zhang", "Haolin Chen", "Heng Ji", "Weiran Yao", "Shelby Heinecke", "Silvio Savarese", "Caiming Xiong", "Huan Wang"], "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": "25 Pages, 17 Figures, 6 Tables", "summary": "Large Language Models (LLMs)-based agents have made impressive progress in\nreasoning and tool use, enabling them to solve complex tasks. However, their\nability to proactively collaborate with users, especially when goals are vague,\nevolving, or indirectly expressed, remains underexplored. To address this gap,\nwe introduce UserBench, a user-centric benchmark designed to evaluate agents in\nmulti-turn, preference-driven interactions. UserBench features simulated users\nwho start with underspecified goals and reveal preferences incrementally,\nrequiring agents to proactively clarify intent and make grounded decisions with\ntools. Our evaluation of leading open- and closed-source LLMs reveals a\nsignificant disconnect between task completion and user alignment. For\ninstance, models provide answers that fully align with all user intents only\n20% of the time on average, and even the most advanced models uncover fewer\nthan 30% of all user preferences through active interaction. These results\nhighlight the challenges of building agents that are not just capable task\nexecutors, but true collaborative partners. UserBench offers an interactive\nenvironment to measure and advance this critical capability."}
{"id": "2507.22062", "pdf": "https://arxiv.org/pdf/2507.22062.pdf", "abs": "https://arxiv.org/abs/2507.22062", "title": "MetaCLIP 2: A Worldwide Scaling Recipe", "authors": ["Yung-Sung Chuang", "Yang Li", "Dong Wang", "Ching-Feng Yeh", "Kehan Lyu", "Ramya Raghavendra", "James Glass", "Lifei Huang", "Jason Weston", "Luke Zettlemoyer", "Xinlei Chen", "Zhuang Liu", "Saining Xie", "Wen-tau Yih", "Shang-Wen Li", "Hu Xu"], "categories": ["cs.CV", "cs.CL"], "comment": "10 pages", "summary": "Contrastive Language-Image Pretraining (CLIP) is a popular foundation model,\nsupporting from zero-shot classification, retrieval to encoders for multimodal\nlarge language models (MLLMs). Although CLIP is successfully trained on\nbillion-scale image-text pairs from the English world, scaling CLIP's training\nfurther to learning from the worldwide web data is still challenging: (1) no\ncuration method is available to handle data points from non-English world; (2)\nthe English performance from existing multilingual CLIP is worse than its\nEnglish-only counterpart, i.e., \"curse of multilinguality\" that is common in\nLLMs. Here, we present MetaCLIP 2, the first recipe training CLIP from scratch\non worldwide web-scale image-text pairs. To generalize our findings, we conduct\nrigorous ablations with minimal changes that are necessary to address the above\nchallenges and present a recipe enabling mutual benefits from English and\nnon-English world data. In zero-shot ImageNet classification, MetaCLIP 2\nViT-H/14 surpasses its English-only counterpart by 0.8% and mSigLIP by 0.7%,\nand surprisingly sets new state-of-the-art without system-level confounding\nfactors (e.g., translation, bespoke architecture changes) on multilingual\nbenchmarks, such as CVQA with 57.4%, Babel-ImageNet with 50.2% and XM3600 with\n64.3% on image-to-text retrieval."}
{"id": "2403.06963", "pdf": "https://arxiv.org/pdf/2403.06963.pdf", "abs": "https://arxiv.org/abs/2403.06963", "title": "The pitfalls of next-token prediction", "authors": ["Gregor Bachmann", "Vaishnavh Nagarajan"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "ICML 2024", "summary": "Can a mere next-token predictor faithfully model human intelligence? We\ncrystallize this emerging concern and correct popular misconceptions\nsurrounding it, and advocate a simple multi-token objective.\n  As a starting point, we argue that the two often-conflated phases of\nnext-token prediction -- autoregressive inference and teacher-forced training\n-- must be treated distinctly. The popular criticism that errors can compound\nduring autoregressive inference, crucially assumes that teacher-forcing has\nlearned an accurate next-token predictor. This assumption sidesteps a more\ndeep-rooted problem we expose: in certain classes of tasks, teacher-forcing can\nsimply fail to learn an accurate next-token predictor in the first place. We\ndescribe a general mechanism of how teacher-forcing can fail, and design a\nminimal planning task where both the Transformer and the Mamba architecture\nempirically fail in that manner -- remarkably, despite the task being\nstraightforward to learn.\n  Finally, we provide preliminary evidence that this failure can be resolved\nusing _teacherless_ training, a simple modification using dummy tokens that\npredicts multiple tokens in advance. We hope this finding can ground future\ndebates and inspire explorations beyond the next-token prediction paradigm. We\nmake our code available under\nhttps://github.com/gregorbachmann/Next-Token-Failures"}
{"id": "2409.11274", "pdf": "https://arxiv.org/pdf/2409.11274.pdf", "abs": "https://arxiv.org/abs/2409.11274", "title": "Task Arithmetic for Language Expansion in Speech Translation", "authors": ["Yao-Fei Cheng", "Hayato Futami", "Yosuke Kashiwagi", "Emiru Tsunoo", "Wen Shen Teo", "Siddhant Arora", "Shinji Watanabe"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Recent progress in large language models (LLMs) has gained interest in\nspeech-text multimodal foundation models, achieving strong performance on\ninstruction-tuned speech translation (ST). However, expanding language pairs is\ncostly due to re-training on combined new and previous datasets. To address\nthis, we aim to build a one-to-many ST system from existing one-to-one ST\nsystems using task arithmetic without re-training. Direct application of task\narithmetic in ST leads to language confusion; therefore, we introduce an\naugmented task arithmetic method incorporating a language control model to\nensure correct target language generation. Our experiments on MuST-C and\nCoVoST-2 show BLEU score improvements of up to 4.66 and 4.92, with COMET gains\nof 8.87 and 11.83. In addition, we demonstrate our framework can extend to\nlanguage pairs lacking paired ST training data or pre-trained ST models by\nsynthesizing ST models based on existing machine translation (MT) and ST models\nvia task analogies."}
{"id": "2409.18924", "pdf": "https://arxiv.org/pdf/2409.18924.pdf", "abs": "https://arxiv.org/abs/2409.18924", "title": "Simulated patient systems are intelligent when powered by large language model-based AI agents", "authors": ["Huizi Yu", "Jiayan Zhou", "Lingyao Li", "Shan Chen", "Jack Gallifant", "Anye Shi", "Xiang Li", "Jingxian He", "Wenyue Hua", "Mingyu Jin", "Guang Chen", "Yang Zhou", "Zhao Li", "Trisha Gupte", "Ming-Li Chen", "Zahra Azizi", "Yongfeng Zhang", "Yanqiu Xing", "Themistocles L. Danielle S. Bitterman", "Themistocles L. Assimes", "Xin Ma", "Lin Lu", "Lizhou Fan"], "categories": ["cs.CL", "cs.AI"], "comment": "64 pages, 14 figures, 16 tables", "summary": "Simulated patient systems play an important role in modern medical education\nand research, providing safe, integrative medical training environments and\nsupporting clinical decision-making simulations. We developed AIPatient, an\nintelligent simulated patient system powered by large language model-based AI\nagents. The system incorporates the Retrieval Augmented Generation (RAG)\nframework, powered by six task-specific LLM-based AI agents for complex\nreasoning. For simulation reality, the system is also powered by the AIPatient\nKG (Knowledge Graph), built with de-identified real patient data from the\nMedical Information Mart for Intensive Care (MIMIC)-III database. Primary\noutcomes showcase the system's intelligence, including the system's accuracy in\nElectronic Record (EHR)-based medical Question Answering (QA), readability,\nrobustness, and stability. The system achieved a QA accuracy of 94.15% when all\nsix AI agents present, surpassing benchmarks with partial or no agent\nintegration. Its knowledgebase demonstrated high validity (F1 score=0.89).\nReadability scores showed median Flesch Reading Ease at 77.23 and median Flesch\nKincaid Grade at 5.6, indicating accessibility to all medical professionals.\nRobustness and stability were confirmed with non-significant variance (ANOVA\nF-value=0.6126, p > 0.1; F-value=0.782, p > 0.1). A user study with medical\nstudents further demonstrated that AIPatient offers high fidelity, strong\nusability, and effective educational value, performing comparably or better\nthan human-simulated patients in medical history-taking scenarios. The\npromising intelligence of the AIPatient system highlights its potential to\nsupport a wide range of applications, including medical education, model\nevaluation, and system integration."}
{"id": "2410.16491", "pdf": "https://arxiv.org/pdf/2410.16491.pdf", "abs": "https://arxiv.org/abs/2410.16491", "title": "BIG5-CHAT: Shaping LLM Personalities Through Training on Human-Grounded Data", "authors": ["Wenkai Li", "Jiarui Liu", "Andy Liu", "Xuhui Zhou", "Mona Diab", "Maarten Sap"], "categories": ["cs.CL"], "comment": null, "summary": "In this work, we tackle the challenge of embedding realistic human\npersonality traits into LLMs. Previous approaches have primarily focused on\nprompt-based methods that describe the behavior associated with the desired\npersonality traits, suffering from realism and validity issues. To address\nthese limitations, we introduce BIG5-CHAT, a large-scale dataset containing\n100,000 dialogues designed to ground models in how humans express their\npersonality in language. Leveraging this dataset, we explore Supervised\nFine-Tuning and Direct Preference Optimization as training-based methods to\nalign LLMs more naturally with human personality patterns. Our methods\noutperform prompting on personality assessments such as BFI and IPIP-NEO, with\ntrait correlations more closely matching human data. Furthermore, our\nexperiments reveal that models trained to exhibit higher conscientiousness,\nhigher agreeableness, lower extraversion, and lower neuroticism display better\nperformance on reasoning tasks, aligning with psychological findings on how\nthese traits impact human cognitive performance. To our knowledge, this work is\nthe first comprehensive study to demonstrate how training-based methods can\nshape LLM personalities through learning from real human behaviors."}
{"id": "2411.19096", "pdf": "https://arxiv.org/pdf/2411.19096.pdf", "abs": "https://arxiv.org/abs/2411.19096", "title": "Pralekha: Cross-Lingual Document Alignment for Indic Languages", "authors": ["Sanjay Suryanarayanan", "Haiyue Song", "Mohammed Safi Ur Rahman Khan", "Anoop Kunchukuttan", "Raj Dabre"], "categories": ["cs.CL"], "comment": null, "summary": "Mining parallel document pairs for document-level machine translation (MT)\nremains challenging due to the limitations of existing Cross-Lingual Document\nAlignment (CLDA) techniques. Most approaches rely on metadata such as URLs,\nwhich is often unavailable in low-resource language settings, while others\nrepresent documents using pooled sentence embeddings, which fail to capture\nfine-grained alignment cues. Moreover, current sentence embedding models have\nlimited context windows, hindering their ability to represent document-level\ninformation effectively. To address these challenges for Indic languages, we\nintroduce PRALEKHA, a large-scale benchmark for evaluating document-level\nalignment techniques. It contains over 3 million aligned document pairs across\n11 Indic languages and English, of which 1.5 million are English--Indic pairs.\nFurthermore, we propose Document Alignment Coefficient (DAC), a novel metric\nfor fine-grained document alignment. Unlike pooling-based approaches, DAC\naligns documents by matching smaller chunks and computes similarity as the\nratio of aligned chunks to the average number of chunks in a pair. Intrinsic\nevaluation shows that DAC achieves substantial improvements over pooling-based\nbaselines, particularly in noisy scenarios. Extrinsic evaluation further\ndemonstrates that document MT models trained on DAC-aligned pairs consistently\noutperform those using baseline alignment methods. These results highlight\nDAC's effectiveness for parallel document mining. The PRALEKHA dataset and CLDA\nevaluation framework will be made publicly available."}
{"id": "2502.03387", "pdf": "https://arxiv.org/pdf/2502.03387.pdf", "abs": "https://arxiv.org/abs/2502.03387", "title": "LIMO: Less is More for Reasoning", "authors": ["Yixin Ye", "Zhen Huang", "Yang Xiao", "Ethan Chern", "Shijie Xia", "Pengfei Liu"], "categories": ["cs.CL", "cs.AI"], "comment": "COLM 2025", "summary": "We challenge the prevailing assumption that complex reasoning in large\nlanguage models (LLMs) necessitates massive training data. We demonstrate that\nsophisticated mathematical reasoning can emerge with only a few examples.\nSpecifically, through simple supervised fine-tuning, our model, LIMO, achieves\n63.3\\% accuracy on AIME24 and 95.6\\% on MATH500, surpassing previous fine-tuned\nmodels (6.5\\% on AIME24, 59.2\\% on MATH500) while using only 1\\% of the\ntraining data required by prior approaches. Furthermore, LIMO exhibits strong\nout-of-distribution generalization, achieving a 45.8\\% absolute improvement\nacross diverse benchmarks, outperforming models trained on 100x more data.\nSynthesizing these findings, we propose the Less-Is-More Reasoning Hypothesis\n(LIMO Hypothesis): In foundation models where domain knowledge has been\ncomprehensively encoded during pre-training, sophisticated reasoning can emerge\nthrough minimal but strategically designed demonstrations of cognitive\nprocesses. This hypothesis suggests that the threshold for eliciting complex\nreasoning is not dictated by task complexity but rather by two key factors: (1)\nthe completeness of the model's pre-trained knowledge base and (2) the\neffectiveness of post-training examples in serving as \"cognitive templates\"\nthat guide reasoning."}
{"id": "2502.18978", "pdf": "https://arxiv.org/pdf/2502.18978.pdf", "abs": "https://arxiv.org/abs/2502.18978", "title": "Low-Confidence Gold: Refining Low-Confidence Samples for Efficient Instruction Tuning", "authors": ["Hongyi Cai", "Jie Li", "Mohammad Mahdinur Rahman", "Wenzhen Dong"], "categories": ["cs.CL", "cs.AI"], "comment": "8 pages", "summary": "The effectiveness of instruction fine-tuning for Large Language Models is\nfundamentally constrained by the quality and efficiency of training datasets.\nThis work introduces Low-Confidence Gold (LCG), a novel filtering framework\nthat employs centroid-based clustering and confidence-guided selection for\nidentifying valuable instruction pairs. Through a semi-supervised approach\nusing a lightweight classifier trained on representative samples, LCG curates\nhigh-quality subsets while preserving data diversity. Experimental evaluation\ndemonstrates that models fine-tuned on LCG-filtered subsets of 6K samples\nachieve superior performance compared to existing methods, with substantial\nimprovements on MT-bench and consistent gains across comprehensive evaluation\nmetrics. The framework's efficacy while maintaining model performance\nestablishes a promising direction for efficient instruction tuning."}
{"id": "2503.04844", "pdf": "https://arxiv.org/pdf/2503.04844.pdf", "abs": "https://arxiv.org/abs/2503.04844", "title": "Narrative Context Protocol: An Open-Source Storytelling Framework for Generative AI", "authors": ["Hank Gerba"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Here we introduce Narrative Context Protocol (NCP), an open-source narrative\nstandard designed to enable narrative interoperability, AI-driven authoring\ntools, real-time emergent narratives, and more. By encoding a story's structure\nin a \"Storyform,\" which is a structured register of its narrative features, NCP\nenables narrative portability across systems as well as intent-based\nconstraints for generative storytelling systems. We demonstrate the\ncapabilities of NCP through a year-long experiment, during which an author used\nNCP and a custom authoring platform to create a playable, text-based experience\nbased on her pre-existing novella. This experience is driven by generative AI,\nwith unconstrained natural language input. NCP functions as a set of\n\"guardrails\" that allows the generative system to accommodate player agency\nwhile also ensuring that narrative context and coherence are maintained."}
{"id": "2503.06424", "pdf": "https://arxiv.org/pdf/2503.06424.pdf", "abs": "https://arxiv.org/abs/2503.06424", "title": "Training LLM-based Tutors to Improve Student Learning Outcomes in Dialogues", "authors": ["Alexander Scarlatos", "Naiming Liu", "Jaewook Lee", "Richard Baraniuk", "Andrew Lan"], "categories": ["cs.CL", "cs.CY"], "comment": "Published in AIED 2025: The 26th International Conference on\n  Artificial Intelligence in Education", "summary": "Generative artificial intelligence (AI) has the potential to scale up\npersonalized tutoring through large language models (LLMs). Recent AI tutors\nare adapted for the tutoring task by training or prompting LLMs to follow\neffective pedagogical principles, though they are not trained to maximize\nstudent learning throughout the course of a dialogue. Therefore, they may\nengage with students in a suboptimal way. We address this limitation by\nintroducing an approach to train LLMs to generate tutor utterances that\nmaximize the likelihood of student correctness, while still encouraging the\nmodel to follow good pedagogical practice. Specifically, we generate a set of\ncandidate tutor utterances and score them using (1) an LLM-based student model\nto predict the chance of correct student responses and (2) a pedagogical rubric\nevaluated by GPT-4o. We then use the resulting data to train an open-source\nLLM, Llama 3.1 8B, using direct preference optimization. We show that tutor\nutterances generated by our model lead to significantly higher chances of\ncorrect student responses while maintaining the pedagogical quality of GPT-4o.\nWe also conduct qualitative analyses and a human evaluation to demonstrate that\nour model generates high quality tutor utterances."}
{"id": "2503.13401", "pdf": "https://arxiv.org/pdf/2503.13401.pdf", "abs": "https://arxiv.org/abs/2503.13401", "title": "Levels of Analysis for Large Language Models", "authors": ["Alexander Ku", "Declan Campbell", "Xuechunzi Bai", "Jiayi Geng", "Ryan Liu", "Raja Marjieh", "R. Thomas McCoy", "Andrew Nam", "Ilia Sucholutsky", "Veniamin Veselovsky", "Liyi Zhang", "Jian-Qiao Zhu", "Thomas L. Griffiths"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Modern artificial intelligence systems, such as large language models, are\nincreasingly powerful but also increasingly hard to understand. Recognizing\nthis problem as analogous to the historical difficulties in understanding the\nhuman mind, we argue that methods developed in cognitive science can be useful\nfor understanding large language models. We propose a framework for applying\nthese methods based on the levels of analysis that David Marr proposed for\nstudying information processing systems. By revisiting established cognitive\nscience techniques relevant to each level and illustrating their potential to\nyield insights into the behavior and internal organization of large language\nmodels, we aim to provide a toolkit for making sense of these new kinds of\nminds."}
{"id": "2503.16531", "pdf": "https://arxiv.org/pdf/2503.16531.pdf", "abs": "https://arxiv.org/abs/2503.16531", "title": "EEG-CLIP : Learning EEG representations from natural language descriptions", "authors": ["Tidiane Camaret Ndir", "Robin Tibor Schirrmeister", "Tonio Ball"], "categories": ["cs.CL", "cs.LG", "eess.SP"], "comment": null, "summary": "Deep networks for electroencephalogram (EEG) decoding are often only trained\nto solve one specific task, such as pathology or age decoding. A more general\ntask-agnostic approach is to train deep networks to match a (clinical) EEG\nrecording to its corresponding textual medical report and vice versa. This\napproach was pioneered in the computer vision domain matching images and their\ntext captions and subsequently allowed to do successful zero-shot decoding\nusing textual class prompts. In this work, we follow this approach and develop\na contrastive learning framework, EEG-CLIP, that aligns the EEG time series and\nthe descriptions of the corresponding clinical text in a shared embedding\nspace. We investigated its potential for versatile EEG decoding, evaluating\nperformance in a range of few-shot and zero-shot settings. Overall, we show\nthat EEG-CLIP manages to non-trivially align text and EEG representations. Our\nwork presents a promising approach to learn general EEG representations, which\ncould enable easier analyses of diverse decoding questions through zero-shot\ndecoding or training task-specific models from fewer training examples. The\ncode for reproducing our results is available at\nhttps://github.com/tidiane-camaret/EEGClip"}
{"id": "2503.20797", "pdf": "https://arxiv.org/pdf/2503.20797.pdf", "abs": "https://arxiv.org/abs/2503.20797", "title": "\"Whose Side Are You On?\" Estimating Ideology of Political and News Content Using Large Language Models and Few-shot Demonstration Selection", "authors": ["Muhammad Haroon", "Magdalena Wojcieszak", "Anshuman Chhabra"], "categories": ["cs.CL", "cs.CY", "cs.SI"], "comment": null, "summary": "The rapid growth of social media platforms has led to concerns about\nradicalization, filter bubbles, and content bias. Existing approaches to\nclassifying ideology are limited in that they require extensive human effort,\nthe labeling of large datasets, and are not able to adapt to evolving\nideological contexts. This paper explores the potential of Large Language\nModels (LLMs) for classifying the political ideology of online content in the\ncontext of the two-party US political spectrum through in-context learning\n(ICL). Our extensive experiments involving demonstration selection in\nlabel-balanced fashion, conducted on three datasets comprising news articles\nand YouTube videos, reveal that our approach significantly outperforms\nzero-shot and traditional supervised methods. Additionally, we evaluate the\ninfluence of metadata (e.g., content source and descriptions) on ideological\nclassification and discuss its implications. Finally, we show how providing the\nsource for political and non-political content influences the LLM's\nclassification."}
{"id": "2504.00042", "pdf": "https://arxiv.org/pdf/2504.00042.pdf", "abs": "https://arxiv.org/abs/2504.00042", "title": "Beyond the Reported Cutoff: Where Large Language Models Fall Short on Financial Knowledge", "authors": ["Agam Shah", "Liqin Ye", "Sebastian Jaskowski", "Wei Xu", "Sudheer Chava"], "categories": ["cs.CL"], "comment": "Paper accepted at CoLM 2025", "summary": "Large Language Models (LLMs) are frequently utilized as sources of knowledge\nfor question-answering. While it is known that LLMs may lack access to\nreal-time data or newer data produced after the model's cutoff date, it is less\nclear how their knowledge spans across historical information. In this study,\nwe assess the breadth of LLMs' knowledge using financial data of U.S. publicly\ntraded companies by evaluating more than 197k questions and comparing model\nresponses to factual data. We further explore the impact of company\ncharacteristics, such as size, retail investment, institutional attention, and\nreadability of financial filings, on the accuracy of knowledge represented in\nLLMs. Our results reveal that LLMs are less informed about past financial\nperformance, but they display a stronger awareness of larger companies and more\nrecent information. Interestingly, at the same time, our analysis also reveals\nthat LLMs are more likely to hallucinate for larger companies, especially for\ndata from more recent years. The code, prompts, and model outputs are available\non GitHub."}
{"id": "2504.04142", "pdf": "https://arxiv.org/pdf/2504.04142.pdf", "abs": "https://arxiv.org/abs/2504.04142", "title": "My Life in Artificial Intelligence: People, anecdotes, and some lessons learnt", "authors": ["Kees van Deemter"], "categories": ["cs.CL", "cs.AI"], "comment": "34 pages", "summary": "In this very personal workography, I relate my 40-year experiences as a\nresearcher and educator in and around Artificial Intelligence (AI), more\nspecifically Natural Language Processing. I describe how curiosity, and the\ncircumstances of the day, led me to work in both industry and academia, and in\nvarious countries, including The Netherlands (Amsterdam, Eindhoven, and\nUtrecht), the USA (Stanford), England (Brighton), Scotland (Aberdeen), and\nChina (Beijing and Harbin). People and anecdotes play a large role in my story;\nthe history of AI forms its backdrop. I focus on things that might be of\ninterest to (even) younger colleagues, given the choices they face in their own\nwork and life at a time when AI is finally emerging from the shadows."}
{"id": "2504.10227", "pdf": "https://arxiv.org/pdf/2504.10227.pdf", "abs": "https://arxiv.org/abs/2504.10227", "title": "Probing then Editing Response Personality of Large Language Models", "authors": ["Tianjie Ju", "Zhenyu Shao", "Bowen Wang", "Yujia Chen", "Zhuosheng Zhang", "Hao Fei", "Mong-Li Lee", "Wynne Hsu", "Sufeng Duan", "Gongshen Liu"], "categories": ["cs.CL"], "comment": "Accepted at COLM 2025", "summary": "Large Language Models (LLMs) have demonstrated promising capabilities to\ngenerate responses that simulate consistent personality traits. Despite the\nmajor attempts to analyze personality expression through output-based\nevaluations, little is known about how such traits are internally encoded\nwithin LLM parameters. In this paper, we introduce a layer-wise probing\nframework to systematically investigate the layer-wise capability of LLMs in\nsimulating personality for responding. We conduct probing experiments on 11\nopen-source LLMs over the PersonalityEdit benchmark and find that LLMs\npredominantly simulate personality for responding in their middle and upper\nlayers, with instruction-tuned models demonstrating a slightly clearer\nseparation of personality traits. Furthermore, by interpreting the trained\nprobing hyperplane as a layer-wise boundary for each personality category, we\npropose a layer-wise perturbation method to edit the personality expressed by\nLLMs during inference. Our results show that even when the prompt explicitly\nspecifies a particular personality, our method can still successfully alter the\nresponse personality of LLMs. Interestingly, the difficulty of converting\nbetween certain personality traits varies substantially, which aligns with the\nrepresentational distances in our probing experiments. Finally, we conduct a\ncomprehensive MMLU benchmark evaluation and time overhead analysis,\ndemonstrating that our proposed personality editing method incurs only minimal\ndegradation in general capabilities while maintaining low training costs and\nacceptable inference latency. Our code is publicly available at\nhttps://github.com/universe-sky/probing-then-editing-personality."}
{"id": "2504.10861", "pdf": "https://arxiv.org/pdf/2504.10861.pdf", "abs": "https://arxiv.org/abs/2504.10861", "title": "Ai2 Scholar QA: Organized Literature Synthesis with Attribution", "authors": ["Amanpreet Singh", "Joseph Chee Chang", "Chloe Anastasiades", "Dany Haddad", "Aakanksha Naik", "Amber Tanaka", "Angele Zamarron", "Cecile Nguyen", "Jena D. Hwang", "Jason Dunkleberger", "Matt Latzke", "Smita Rao", "Jaron Lochner", "Rob Evans", "Rodney Kinney", "Daniel S. Weld", "Doug Downey", "Sergey Feldman"], "categories": ["cs.CL"], "comment": "7 pages", "summary": "Retrieval-augmented generation is increasingly effective in answering\nscientific questions from literature, but many state-of-the-art systems are\nexpensive and closed-source. We introduce Ai2 Scholar QA, a free online\nscientific question answering application. To facilitate research, we make our\nentire pipeline public: as a customizable open-source Python package and\ninteractive web app, along with paper indexes accessible through public APIs\nand downloadable datasets. We describe our system in detail and present\nexperiments analyzing its key design decisions. In an evaluation on a recent\nscientific QA benchmark, we find that Ai2 Scholar QA outperforms competing\nsystems."}
{"id": "2505.17206", "pdf": "https://arxiv.org/pdf/2505.17206.pdf", "abs": "https://arxiv.org/abs/2505.17206", "title": "FB-RAG: Improving RAG with Forward and Backward Lookup", "authors": ["Kushal Chawla", "Alfy Samuel", "Anoop Kumar", "Daben Liu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Traditional Retrieval-Augmented Generation (RAG) struggles with complex\nqueries that lack strong signals to retrieve the most relevant context, forcing\na trade-off between choosing a small context that misses key information and a\nlarge context that confuses the LLM. To address this, we propose\nForward-Backward RAG (FB-RAG), a new training-free framework based on a simple\nyet powerful forward-looking strategy. FB-RAG employs a light-weight LLM to\npeek into potential future generations, using evidence from multiple sampled\noutputs to precisely identify the most relevant context for a final, more\npowerful generator. This improves performance without complex finetuning or\nReinforcement Learning common in prior work. Across 9 datasets, FB-RAG\nconsistently delivers strong results. Further, the performance gains can be\nachieved with reduced latency due to a shorter, more focused prompt for the\npowerful generator. On EN.QA dataset, FB-RAG matches the leading baseline with\nover 48% latency reduction or achieves an 8% performance improvement with a 10%\nlatency reduction. Our analysis finds cases where even when the forward-looking\nLLM fails to generate correct answers, its attempts are sufficient to guide the\nfinal model to an accurate response, demonstrating how smaller LLMs can\nsystematically improve the performance and efficiency of larger ones."}
{"id": "2505.20779", "pdf": "https://arxiv.org/pdf/2505.20779.pdf", "abs": "https://arxiv.org/abs/2505.20779", "title": "CHIMERA: A Knowledge Base of Scientific Idea Recombinations for Research Analysis and Ideation", "authors": ["Noy Sternlicht", "Tom Hope"], "categories": ["cs.CL"], "comment": "Project page: https://noy-sternlicht.github.io/CHIMERA-Web", "summary": "A hallmark of human innovation is recombination -- the creation of novel\nideas by integrating elements from existing concepts and mechanisms. In this\nwork, we introduce CHIMERA, a large-scale Knowledge Base (KB) of over 28K\nrecombination examples automatically mined from the scientific literature.\nCHIMERA enables large-scale empirical analysis of how scientists recombine\nconcepts and draw inspiration from different areas, and enables training models\nthat propose novel, cross-disciplinary research directions. To construct this\nKB, we define a new information extraction task: identifying recombination\ninstances in scientific abstracts. We curate a high-quality, expert-annotated\ndataset and use it to fine-tune a large language model, which we apply to a\nbroad corpus of AI papers. We showcase the utility of CHIMERA through two\napplications. First, we analyze patterns of recombination across AI subfields.\nSecond, we train a scientific hypothesis generation model using the KB, showing\nthat it can propose novel research directions that researchers rate as\ninspiring. We release our data and code at\nhttps://github.com/noy-sternlicht/CHIMERA-KB."}
{"id": "2505.23966", "pdf": "https://arxiv.org/pdf/2505.23966.pdf", "abs": "https://arxiv.org/abs/2505.23966", "title": "FLAT-LLM: Fine-grained Low-rank Activation Space Transformation for Large Language Model Compression", "authors": ["Jiayi Tian", "Ryan Solgi", "Jinming Lu", "Yifan Yang", "Hai Li", "Zheng Zhang"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) have enabled remarkable progress in natural\nlanguage processing, yet their high computational and memory demands pose\nchallenges for deployment in resource-constrained environments. Although recent\nlow-rank decomposition methods offer a promising path for structural\ncompression, they often suffer from accuracy degradation, expensive calibration\nprocedures, and result in inefficient model architectures that hinder\nreal-world inference speedups. In this paper, we propose FLAT-LLM, a fast and\naccurate, training-free structural compression method based on fine-grained\nlow-rank transformations in the activation space. Specifically, we reduce the\nhidden dimension by transforming the weights using truncated eigenvectors\ncomputed via head-wise Principal Component Analysis, and employ a greedy budget\nredistribution strategy to adaptively allocate ranks across decoders. FLAT-LLM\nachieves efficient and effective weight compression without recovery\nfine-tuning, which could complete the calibration within a few minutes.\nEvaluated across 5 models and 11 datasets, FLAT-LLM outperforms structural\npruning baselines in generalization and downstream performance, while\ndelivering inference speedups over decomposition-based methods."}
{"id": "2506.05413", "pdf": "https://arxiv.org/pdf/2506.05413.pdf", "abs": "https://arxiv.org/abs/2506.05413", "title": "SmoothRot: Combining Channel-Wise Scaling and Rotation for Quantization-Friendly LLMs", "authors": ["Patrik Czakó", "Gábor Kertész", "Sándor Szénási"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "6 pages, 3 figures, 5 tables. Accepted to IEEE SMC 2025 conference\n  proceedings", "summary": "We present SmoothRot, a novel post-training quantization technique to enhance\nthe efficiency of 4-bit quantization in Large Language Models (LLMs). SmoothRot\naddresses the critical challenge of massive activation outliers, by integrating\nchannel-wise scaling with Hadamard transformations. Our technique effectively\ntransforms extreme outliers into quantization-friendly activations,\nsignificantly improving quantization accuracy. Experiments conducted on popular\nLLMs (LLaMA2 7B, LLaMA3.1 8B, and Mistral 7B) demonstrate that SmoothRot\nconsistently reduces the performance gap between quantized and FP16 models by\napproximately 10-30\\% across language generation and zero-shot reasoning tasks,\nwithout introducing additional inference latency. Code is available at\nhttps://github.com/czakop/smoothrot."}
{"id": "2507.05714", "pdf": "https://arxiv.org/pdf/2507.05714.pdf", "abs": "https://arxiv.org/abs/2507.05714", "title": "HIRAG: Hierarchical-Thought Instruction-Tuning Retrieval-Augmented Generation", "authors": ["YiHan Jiao", "ZheHao Tan", "Dan Yang", "DuoLin Sun", "Jie Feng", "Yue Shen", "Jian Wang", "Peng Wei"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Retrieval-augmented generation (RAG) has become a fundamental paradigm for\naddressing the challenges faced by large language models in handling real-time\ninformation and domain-specific problems. Traditional RAG systems primarily\nrely on the in-context learning (ICL) capabilities of the large language model\nitself. Still, in-depth research on the specific capabilities needed by the RAG\ngeneration model is lacking, leading to challenges with inconsistent document\nquality and retrieval system imperfections. Even the limited studies that\nfine-tune RAG generative models often \\textit{lack a granular focus on RAG\ntask} or \\textit{a deeper utilization of chain-of-thought processes}. To\naddress this, we propose that RAG models should possess three progressively\nhierarchical abilities (1) Filtering: the ability to select relevant\ninformation; (2) Combination: the ability to combine semantic information\nacross paragraphs; and (3) RAG-specific reasoning: the ability to further\nprocess external knowledge using internal knowledge. Thus, we introduce our new\nRAG instruction fine-tuning method, Hierarchical-Thought Instruction-Tuning\nRetrieval-Augmented Generation (HIRAG) incorporates a \"think before answering\"\nstrategy. This method enhances the model's open-book examination capability by\nutilizing multi-level progressive chain-of-thought. Experiments show that the\nHIRAG training strategy significantly improves the model's performance on\ndatasets such as RGB, PopQA, MuSiQue, HotpotQA, and PubmedQA."}
{"id": "2507.07634", "pdf": "https://arxiv.org/pdf/2507.07634.pdf", "abs": "https://arxiv.org/abs/2507.07634", "title": "FrugalRAG: Learning to retrieve and reason for multi-hop QA", "authors": ["Abhinav Java", "Srivathsan Koundinyan", "Nagarajan Natarajan", "Amit Sharma"], "categories": ["cs.CL"], "comment": "Accepted at ICML Workshop: Efficient Systems for Foundation Models", "summary": "We consider the problem of answering complex questions, given access to a\nlarge unstructured document corpus. The de facto approach to solving the\nproblem is to leverage language models that (iteratively) retrieve and reason\nthrough the retrieved documents, until the model has sufficient information to\ngenerate an answer. Attempts at improving this approach focus on\nretrieval-augmented generation (RAG) metrics such as accuracy and recall and\ncan be categorized into two types: (a) fine-tuning on large question answering\n(QA) datasets augmented with chain-of-thought traces, and (b) leveraging\nRL-based fine-tuning techniques that rely on question-document relevance\nsignals. However, efficiency in the number of retrieval searches is an equally\nimportant metric, which has received less attention. In this work, we show\nthat: (1) Large-scale fine-tuning is not needed to improve RAG metrics,\ncontrary to popular claims in recent literature. Specifically, a standard ReAct\npipeline with improved prompts can outperform state-of-the-art methods on\nbenchmarks such as HotPotQA. (2) Supervised and RL-based fine-tuning can help\nRAG from the perspective of frugality, i.e., the latency due to number of\nsearches at inference time. For example, we show that we can achieve\ncompetitive RAG metrics at nearly half the cost (in terms of number of\nsearches) on popular RAG benchmarks, using the same base model, and at a small\ntraining cost (1000 examples)."}
{"id": "2507.11230", "pdf": "https://arxiv.org/pdf/2507.11230.pdf", "abs": "https://arxiv.org/abs/2507.11230", "title": "Sparse Autoencoders Can Capture Language-Specific Concepts Across Diverse Languages", "authors": ["Lyzander Marciano Andrylie", "Inaya Rahmanisa", "Mahardika Krisna Ihsani", "Alfan Farizki Wicaksono", "Haryo Akbarianto Wibowo", "Alham Fikri Aji"], "categories": ["cs.CL", "68T50"], "comment": null, "summary": "Understanding the multilingual mechanisms of large language models (LLMs)\nprovides insight into how they process different languages, yet this remains\nchallenging. Existing studies often focus on individual neurons, but their\npolysemantic nature makes it difficult to isolate language-specific units from\ncross-lingual representations. To address this, we explore sparse autoencoders\n(SAEs) for their ability to learn monosemantic features that represent concrete\nand abstract concepts across languages in LLMs. While some of these features\nare language-independent, the presence of language-specific features remains\nunderexplored. In this work, we introduce SAE-LAPE, a method based on feature\nactivation probability, to identify language-specific features within the\nfeed-forward network. We find that many such features predominantly appear in\nthe middle to final layers of the model and are interpretable. These features\ninfluence the model's multilingual performance and language output and can be\nused for language identification with performance comparable to fastText along\nwith more interpretability. Our code is available at\nhttps://github.com/LyzanderAndrylie/language-specific-features"}
{"id": "2507.13614", "pdf": "https://arxiv.org/pdf/2507.13614.pdf", "abs": "https://arxiv.org/abs/2507.13614", "title": "Linguistic and Embedding-Based Profiling of Texts generated by Humans and Large Language Models", "authors": ["Sergio E. Zanotto", "Segun Aroyehun"], "categories": ["cs.CL", "cs.AI"], "comment": "arXiv admin note: text overlap with arXiv:2412.03025", "summary": "The rapid advancements in large language models (LLMs) have significantly\nimproved their ability to generate natural language, making texts generated by\nLLMs increasingly indistinguishable from human-written texts. While recent\nresearch has primarily focused on using LLMs to classify text as either\nhuman-written and machine-generated texts, our study focus on characterizing\nthese texts using a set of linguistic features across different linguistic\nlevels such as morphology, syntax, and semantics. We select a dataset of\nhuman-written and machine-generated texts spanning 8 domains and produced by 11\ndifferent LLMs. We calculate different linguistic features such as dependency\nlength and emotionality and we use them for characterizing human-written and\nmachine-generated texts along with different sampling strategies, repetition\ncontrols and model release date. Our statistical analysis reveals that\nhuman-written texts tend to exhibit simpler syntactic structures and more\ndiverse semantic content. Furthermore, we calculate the variability of our set\nof features across models and domains. Both human and machine texts show\nstylistic diversity across domains, with humans displaying greater variation in\nour features. Finally, we apply style embeddings to further test variability\namong human-written and machine-generated texts. Notably, newer models output\ntext that is similarly variable, pointing to an homogenization of\nmachine-generated texts."}
{"id": "2507.16199", "pdf": "https://arxiv.org/pdf/2507.16199.pdf", "abs": "https://arxiv.org/abs/2507.16199", "title": "WakenLLM: Evaluating Reasoning Potential and Stability in LLMs via Fine-Grained Benchmarking", "authors": ["Zipeng Ling", "Yuehao Tang", "Shuliang Liu", "Junqi Yang", "Shenghong Fu", "Chen Huang", "Kejia Huang", "Yao Wan", "Zhichao Hou", "Xuming Hu"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) frequently output the label Unknown in reasoning\ntasks, where two scenarios may appear: (i) an input sample is genuinely\nunverifiable, but the model cannot understand why; and (ii) a verifiable\nproblem that the model fails to solve, thus outputs Unknown. We refer to these\ncases collectively as the Vague Perception phenomenon. Current evaluations\nfocus on whether such answers are honest, rather than analyzing the limits of\nLLM reasoning.\n  To address this, we introduce WakenLLM, a framework that quantifies the\nportion of Unknown output attributable to model incapacity and evaluates\nwhether stimulation can convert them into either correct answers (verifiable)\nor justified (unverifiable) responses with valid reasoning. Our method offers a\nclearer picture of the limits of LLM reasoning and the potential for\ncorrections across various datasets. Comprehensive experiments on six LLMs\nsuggest that, without any training or parameter revision, LLMs can achieve up\nto a 68.53% accuracy improvement on Vague Perception samples through guided\nunderstanding.\n  Our work reveals that current baseline methods only activate a small portion\nof LLMs' reasoning potential, indicating considerable unexplored capacity. This\nextends the theoretical upper bounds of reasoning accuracy in LLMs.\nConsequently, this study deepens our understanding of the latent reasoning\ncapacity of LLMs and offers a new perspective on addressing the Vague\nPerception phenomenon."}
{"id": "2507.18013", "pdf": "https://arxiv.org/pdf/2507.18013.pdf", "abs": "https://arxiv.org/abs/2507.18013", "title": "Technical Report of TeleChat2, TeleChat2.5 and T1", "authors": ["Zihan Wang", "Xinzhang Liu", "Yitong Yao", "Chao Wang", "Yu Zhao", "Zhihao Yang", "Wenmin Deng", "Kaipeng Jia", "Jiaxin Peng", "Yuyao Huang", "Sishi Xiong", "Zhuo Jiang", "Kaidong Yu", "Xiaohui Hu", "Fubei Yao", "Ruiyu Fang", "Zhuoru Jiang", "Ruiting Song", "Qiyi Xie", "Rui Xue", "Xuewei He", "Yanlei Xue", "Zhu Yuan", "Zhaoxi Zhang", "Zilu Huang", "Shiquan Wang", "Xin Wang", "Hanming Wu", "Mingyuan Wang", "Xufeng Zhan", "Yuhan Sun", "Zhaohu Xing", "Yuhao Jiang", "Bingkai Yang", "Shuangyong Song", "Yongxiang Li", "Zhongjiang He", "Xuelong Li"], "categories": ["cs.CL", "I.2.7"], "comment": "32 pages, 5 figures", "summary": "We introduce the latest series of TeleChat models: \\textbf{TeleChat2},\n\\textbf{TeleChat2.5}, and \\textbf{T1}, offering a significant upgrade over\ntheir predecessor, TeleChat. Despite minimal changes to the model architecture,\nthe new series achieves substantial performance gains through enhanced training\nstrategies in both pre-training and post-training stages. The series begins\nwith \\textbf{TeleChat2}, which undergoes pretraining on 10 trillion\nhigh-quality and diverse tokens. This is followed by Supervised Fine-Tuning\n(SFT) and Direct Preference Optimization (DPO) to further enhance its\ncapabilities. \\textbf{TeleChat2.5} and \\textbf{T1} expand the pipeline by\nincorporating a continual pretraining phase with domain-specific datasets,\ncombined with reinforcement learning (RL) to improve performance in code\ngeneration and mathematical reasoning tasks. The \\textbf{T1} variant is\ndesigned for complex reasoning, supporting long Chain-of-Thought (CoT)\nreasoning and demonstrating substantial improvements in mathematics and coding.\nIn contrast, \\textbf{TeleChat2.5} prioritizes speed, delivering rapid\ninference. Both flagship models of \\textbf{T1} and \\textbf{TeleChat2.5} are\ndense Transformer-based architectures with 115B parameters, showcasing\nsignificant advancements in reasoning and general task performance compared to\nthe original TeleChat. Notably, \\textbf{T1-115B} outperform proprietary models\nsuch as OpenAI's o1-mini and GPT-4o. We publicly release \\textbf{TeleChat2},\n\\textbf{TeleChat2.5} and \\textbf{T1}, including post-trained versions with 35B\nand 115B parameters, to empower developers and researchers with\nstate-of-the-art language models tailored for diverse applications."}
{"id": "2507.19537", "pdf": "https://arxiv.org/pdf/2507.19537.pdf", "abs": "https://arxiv.org/abs/2507.19537", "title": "Mind the Language Gap in Digital Humanities: LLM-Aided Translation of SKOS Thesauri", "authors": ["Felix Kraus", "Nicolas Blumenröhr", "Danah Tonne", "Achim Streit"], "categories": ["cs.CL"], "comment": null, "summary": "We introduce WOKIE, an open-source, modular, and ready-to-use pipeline for\nthe automated translation of SKOS thesauri. This work addresses a critical need\nin the Digital Humanities (DH), where language diversity can limit access,\nreuse, and semantic interoperability of knowledge resources. WOKIE combines\nexternal translation services with targeted refinement using Large Language\nModels (LLMs), balancing translation quality, scalability, and cost. Designed\nto run on everyday hardware and be easily extended, the application requires no\nprior expertise in machine translation or LLMs. We evaluate WOKIE across\nseveral DH thesauri in 15 languages with different parameters, translation\nservices and LLMs, systematically analysing translation quality, performance,\nand ontology matching improvements. Our results show that WOKIE is suitable to\nenhance the accessibility, reuse, and cross-lingual interoperability of\nthesauri by hurdle-free automated translation and improved ontology matching\nperformance, supporting more inclusive and multilingual research\ninfrastructures."}
{"id": "2507.19980", "pdf": "https://arxiv.org/pdf/2507.19980.pdf", "abs": "https://arxiv.org/abs/2507.19980", "title": "Exploring LLM Autoscoring Reliability in Large-Scale Writing Assessments Using Generalizability Theory", "authors": ["Dan Song", "Won-Chan Lee", "Hong Jiao"], "categories": ["cs.CL"], "comment": null, "summary": "This study investigates the estimation of reliability for large language\nmodels (LLMs) in scoring writing tasks from the AP Chinese Language and Culture\nExam. Using generalizability theory, the research evaluates and compares score\nconsistency between human and AI raters across two types of AP Chinese\nfree-response writing tasks: story narration and email response. These essays\nwere independently scored by two trained human raters and seven AI raters. Each\nessay received four scores: one holistic score and three analytic scores\ncorresponding to the domains of task completion, delivery, and language use.\nResults indicate that although human raters produced more reliable scores\noverall, LLMs demonstrated reasonable consistency under certain conditions,\nparticularly for story narration tasks. Composite scoring that incorporates\nboth human and AI raters improved reliability, which supports that hybrid\nscoring models may offer benefits for large-scale writing assessments."}
{"id": "2507.20133", "pdf": "https://arxiv.org/pdf/2507.20133.pdf", "abs": "https://arxiv.org/abs/2507.20133", "title": "Sem-DPO: Mitigating Semantic Inconsistency in Preference Optimization for Prompt Engineering", "authors": ["Anas Mohamed", "Azal Ahmad Khan", "Xinran Wang", "Ahmad Faraz Khan", "Shuwen Ge", "Saman Bahzad Khan", "Ayaan Ahmad", "Ali Anwar"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Generative AI can now synthesize strikingly realistic images from text, yet\noutput quality remains highly sensitive to how prompts are phrased. Direct\nPreference Optimization (DPO) offers a lightweight, off-policy alternative to\nRL for automatic prompt engineering, but its token-level regularization leaves\nsemantic inconsistency unchecked as prompts that win higher preference scores\ncan still drift away from the user's intended meaning.\n  We introduce Sem-DPO, a variant of DPO that preserves semantic consistency\nyet retains its simplicity and efficiency. Sem-DPO adjusts the DPO loss using a\nweight based on how different the winning prompt is from the original, reducing\nthe impact of training examples that are semantically misaligned. We provide\nthe first analytical bound on semantic drift for preference-tuned prompt\ngenerators, showing that Sem-DPO keeps learned prompts within a provably\nbounded neighborhood of the original text. On three standard text-to-image\nprompt-optimization benchmarks and two language models, Sem-DPO achieves 8-12%\nhigher CLIP similarity and 5-9% higher human-preference scores (HPSv2.1,\nPickScore) than DPO, while also outperforming state-of-the-art baselines. These\nfindings suggest that strong flat baselines augmented with semantic weighting\nshould become the new standard for prompt-optimization studies and lay the\ngroundwork for broader, semantics-aware preference optimization in language\nmodels."}
{"id": "2507.20527", "pdf": "https://arxiv.org/pdf/2507.20527.pdf", "abs": "https://arxiv.org/abs/2507.20527", "title": "SAND-Math: Using LLMs to Generate Novel, Difficult and Useful Mathematics Questions and Answers", "authors": ["Chaitanya Manem", "Pratik Prabhanjan Brahma", "Prakamya Mishra", "Zicheng Liu", "Emad Barsoum"], "categories": ["cs.CL"], "comment": null, "summary": "The demand for Large Language Models (LLMs) capable of sophisticated\nmathematical reasoning is growing across industries. However, the development\nof performant mathematical LLMs is critically bottlenecked by the scarcity of\ndifficult, novel training data. We introduce \\textbf{SAND-Math} (Synthetic\nAugmented Novel and Difficult Mathematics problems and solutions), a pipeline\nthat addresses this by first generating high-quality problems from scratch and\nthen systematically elevating their complexity via a new \\textbf{Difficulty\nHiking} step. We demonstrate the effectiveness of our approach through two key\nfindings. First, augmenting a strong baseline with SAND-Math data significantly\nboosts performance, outperforming the next-best synthetic dataset by\n\\textbf{$\\uparrow$ 17.85 absolute points} on the AIME25 benchmark. Second, in a\ndedicated ablation study, we show our Difficulty Hiking process is highly\neffective: by increasing average problem difficulty from 5.02 to 5.98, this\nstep lifts AIME25 performance from 46.38\\% to 49.23\\%. The full generation\npipeline, final dataset, and a fine-tuned model form a practical and scalable\ntoolkit for building more capable and efficient mathematical reasoning LLMs.\nSAND-Math dataset is released here:\n\\href{https://huggingface.co/datasets/amd/SAND-MATH}{https://huggingface.co/datasets/amd/SAND-MATH}"}
{"id": "2507.20906", "pdf": "https://arxiv.org/pdf/2507.20906.pdf", "abs": "https://arxiv.org/abs/2507.20906", "title": "Soft Injection of Task Embeddings Outperforms Prompt-Based In-Context Learning", "authors": ["Jungwon Park", "Wonjong Rhee"], "categories": ["cs.CL"], "comment": "Preprint", "summary": "In-Context Learning (ICL) enables Large Language Models (LLMs) to perform\ntasks by conditioning on input-output examples in the prompt, without requiring\nany update in model parameters. While widely adopted, it remains unclear\nwhether prompting with multiple examples is the most effective and efficient\nway to convey task information. In this work, we propose Soft Injection of task\nembeddings. The task embeddings are constructed only once using few-shot ICL\nprompts and repeatedly used during inference. Soft injection is performed by\nsoftly mixing task embeddings with attention head activations using\npre-optimized mixing parameters, referred to as soft head-selection parameters.\nThis method not only allows a desired task to be performed without in-prompt\ndemonstrations but also significantly outperforms existing ICL approaches while\nreducing memory usage and compute cost at inference time. An extensive\nevaluation is performed across 57 tasks and 12 LLMs, spanning four model\nfamilies of sizes from 4B to 70B. Averaged across 57 tasks, our method\noutperforms 10-shot ICL by 10.2%-14.3% across 12 LLMs. Additional analyses show\nthat our method also serves as an insightful tool for analyzing task-relevant\nroles of attention heads, revealing that task-relevant head positions selected\nby our method transfer across similar tasks but not across dissimilar ones --\nunderscoring the task-specific nature of head functionality. Our soft injection\nmethod opens a new paradigm for reducing prompt length and improving task\nperformance by shifting task conditioning from the prompt space to the\nactivation space."}
{"id": "2201.01984", "pdf": "https://arxiv.org/pdf/2201.01984.pdf", "abs": "https://arxiv.org/abs/2201.01984", "title": "Image Captioning via Compact Bidirectional Architecture", "authors": ["Zijie Song", "Yuanen Zhou", "Zhenzhen Hu", "Daqing Liu", "Huixia Ben", "Richang Hong", "Meng Wang"], "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Most current image captioning models typically generate captions from\nleft-to-right. This unidirectional property makes them can only leverage past\ncontext but not future context. Though refinement-based models can exploit both\npast and future context by generating a new caption in the second stage based\non pre-retrieved or pre-generated captions in the first stage, the decoder of\nthese models generally consists of two networks~(i.e. a retriever or captioner\nin the first stage and a captioner in the second stage), which can only be\nexecuted sequentially. In this paper, we introduce a Compact Bidirectional\nTransformer model for image captioning that can leverage bidirectional context\nimplicitly and explicitly while the decoder can be executed parallelly.\nSpecifically, it is implemented by tightly coupling left-to-right(L2R) and\nright-to-left(R2L) flows into a single compact model to serve as a\nregularization for implicitly exploiting bidirectional context and optionally\nallowing explicit interaction of the bidirectional flows, while the final\ncaption is chosen from either L2R or R2L flow in a sentence-level ensemble\nmanner. We conduct extensive ablation studies on MSCOCO benchmark and find that\nthe compact bidirectional architecture and the sentence-level ensemble play\nmore important roles than the explicit interaction mechanism. By combining with\nword-level ensemble seamlessly, the effect of sentence-level ensemble is\nfurther enlarged. We further extend the conventional one-flow self-critical\ntraining to the two-flows version under this architecture and achieve new\nstate-of-the-art results in comparison with non-vision-language-pretraining\nmodels. Finally, we verify the generality of this compact bidirectional\narchitecture by extending it to LSTM backbone. Source code is available at\nhttps://github.com/YuanEZhou/cbtic."}
{"id": "2407.15549", "pdf": "https://arxiv.org/pdf/2407.15549.pdf", "abs": "https://arxiv.org/abs/2407.15549", "title": "Latent Adversarial Training Improves Robustness to Persistent Harmful Behaviors in LLMs", "authors": ["Abhay Sheshadri", "Aidan Ewart", "Phillip Guo", "Aengus Lynch", "Cindy Wu", "Vivek Hebbar", "Henry Sleight", "Asa Cooper Stickland", "Ethan Perez", "Dylan Hadfield-Menell", "Stephen Casper"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "Code at https://github.com/aengusl/latent-adversarial-training.\n  Models at https://huggingface.co/LLM-LAT", "summary": "Large language models (LLMs) can often be made to behave in undesirable ways\nthat they are explicitly fine-tuned not to. For example, the LLM red-teaming\nliterature has produced a wide variety of 'jailbreaking' techniques to elicit\nharmful text from models that were fine-tuned to be harmless. Recent work on\nred-teaming, model editing, and interpretability suggests that this challenge\nstems from how (adversarial) fine-tuning largely serves to suppress rather than\nremove undesirable capabilities from LLMs. Prior work has introduced latent\nadversarial training (LAT) as a way to improve robustness to broad classes of\nfailures. These prior works have considered untargeted latent space attacks\nwhere the adversary perturbs latent activations to maximize loss on examples of\ndesirable behavior. Untargeted LAT can provide a generic type of robustness but\ndoes not leverage information about specific failure modes. Here, we experiment\nwith targeted LAT where the adversary seeks to minimize loss on a specific\ncompeting task. We find that it can augment a wide variety of state-of-the-art\nmethods. First, we use targeted LAT to improve robustness to jailbreaks,\noutperforming a strong R2D2 baseline with orders of magnitude less compute.\nSecond, we use it to more effectively remove backdoors with no knowledge of the\ntrigger. Finally, we use it to more effectively unlearn knowledge for specific\nundesirable tasks in a way that is also more robust to re-learning. Overall,\nour results suggest that targeted LAT can be an effective tool for defending\nagainst harmful behaviors from LLMs."}
{"id": "2408.10635", "pdf": "https://arxiv.org/pdf/2408.10635.pdf", "abs": "https://arxiv.org/abs/2408.10635", "title": "Strategist: Self-improvement of LLM Decision Making via Bi-Level Tree Search", "authors": ["Jonathan Light", "Min Cai", "Weiqin Chen", "Guanzhi Wang", "Xiusi Chen", "Wei Cheng", "Yisong Yue", "Ziniu Hu"], "categories": ["cs.AI", "cs.CL"], "comment": "website: https://llm-strategist.github.io", "summary": "Traditional reinforcement learning and planning typically requires vast\namounts of data and training to develop effective policies. In contrast, large\nlanguage models (LLMs) exhibit strong generalization and zero-shot\ncapabilities, but struggle with tasks that require detailed planning and\ndecision-making in complex action spaces. We introduce STRATEGIST, a novel\napproach that integrates the strengths of both methods. Our approach leverages\nLLMs to search and update high-level strategies (as text), which are then\nrefined and executed by low-level Monte Carlo Tree Search (MCTS). STRATEGIST is\na generalizable framework to optimize the strategy through population-based\nself-play simulations without the need for any training data. We demonstrate\nthe effectiveness of STRATEGIST in learning optimal strategies for competitive,\nmulti-turn games with partial information, including Game of Pure Strategy\n(GOPS) and multi-agent, hidden-identity discussion games like The Resistance:\nAvalon. Our results show that agents equipped with STRATEGIST outperform those\ntrained with traditional RL methods, other LLM-based skill acquisition\ntechniques, pre-existing LLM agents across both game environments and achieves\ncomparable performance against human players."}
{"id": "2411.17799", "pdf": "https://arxiv.org/pdf/2411.17799.pdf", "abs": "https://arxiv.org/abs/2411.17799", "title": "Signs as Tokens: A Retrieval-Enhanced Multilingual Sign Language Generator", "authors": ["Ronglai Zuo", "Rolandos Alexandros Potamias", "Evangelos Ververas", "Jiankang Deng", "Stefanos Zafeiriou"], "categories": ["cs.CV", "cs.CL"], "comment": "Accepted by ICCV 2025", "summary": "Sign language is a visual language that encompasses all linguistic features\nof natural languages and serves as the primary communication method for the\ndeaf and hard-of-hearing communities. Although many studies have successfully\nadapted pretrained language models (LMs) for sign language translation\n(sign-to-text), the reverse task-sign language generation\n(text-to-sign)-remains largely unexplored. In this work, we introduce a\nmultilingual sign language model, Signs as Tokens (SOKE), which can generate 3D\nsign avatars autoregressively from text inputs using a pretrained LM. To align\nsign language with the LM, we leverage a decoupled tokenizer that discretizes\ncontinuous signs into token sequences representing various body parts. During\ndecoding, unlike existing approaches that flatten all part-wise tokens into a\nsingle sequence and predict one token at a time, we propose a multi-head\ndecoding method capable of predicting multiple tokens simultaneously. This\napproach improves inference efficiency while maintaining effective information\nfusion across different body parts. To further ease the generation process, we\npropose a retrieval-enhanced SLG approach, which incorporates external sign\ndictionaries to provide accurate word-level signs as auxiliary conditions,\nsignificantly improving the precision of generated signs. Extensive qualitative\nand quantitative evaluations demonstrate the effectiveness of SOKE."}
{"id": "2412.03248", "pdf": "https://arxiv.org/pdf/2412.03248.pdf", "abs": "https://arxiv.org/abs/2412.03248", "title": "AIM: Adaptive Inference of Multi-Modal LLMs via Token Merging and Pruning", "authors": ["Yiwu Zhong", "Zhuoming Liu", "Yin Li", "Liwei Wang"], "categories": ["cs.CV", "cs.AI", "cs.CL"], "comment": "Accepted to ICCV 2025", "summary": "Large language models (LLMs) have enabled the creation of multi-modal LLMs\nthat exhibit strong comprehension of visual data such as images and videos.\nHowever, these models usually rely on extensive visual tokens from visual\nencoders, leading to high computational demands, which limits their\napplicability in resource-constrained environments and for long-context tasks.\nIn this work, we propose a training-free adaptive inference method for\nmulti-modal LLMs that can accommodate a broad range of efficiency requirements\nwith a minimum performance drop. Our method consists of a) iterative token\nmerging based on embedding similarity before LLMs, and b) progressive token\npruning within LLM layers based on multi-modal importance. With a minimalist\ndesign, our method can be applied to both video and image LLMs. Extensive\nexperiments on diverse video and image benchmarks demonstrate that our method\nsubstantially reduces computation load (e.g., a $\\textbf{7-fold}$ reduction in\nFLOPs) while preserving the performance of video and image LLMs. Further, at a\nsimilar computational cost, our method outperforms the state-of-the-art methods\nin long video understanding (e.g., $\\textbf{+4.6}$ on MLVU). Additionally, our\nin-depth analysis provides insights into token redundancy and LLM layer\nbehaviors, offering guidance for future research in designing efficient\nmulti-modal LLMs. Our code is available at https://github.com/LaVi-Lab/AIM."}
{"id": "2503.01751", "pdf": "https://arxiv.org/pdf/2503.01751.pdf", "abs": "https://arxiv.org/abs/2503.01751", "title": "SAKE: Steering Activations for Knowledge Editing", "authors": ["Marco Scialanga", "Thibault Laugel", "Vincent Grari", "Marcin Detyniecki"], "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "As Large Langue Models have been shown to memorize real-world facts, the need\nto update this knowledge in a controlled and efficient manner arises. Designed\nwith these constraints in mind, Knowledge Editing (KE) approaches propose to\nalter specific facts in pretrained models. However, they have been shown to\nsuffer from several limitations, including their lack of contextual robustness\nand their failure to generalize to logical implications related to the fact. To\novercome these issues, we propose SAKE, a steering activation method that\nmodels a fact to be edited as a distribution rather than a single prompt.\nLeveraging Optimal Transport, SAKE alters the LLM behavior over a whole\nfact-related distribution, defined as paraphrases and logical implications.\nSeveral numerical experiments demonstrate the effectiveness of this method:\nSAKE is thus able to perform more robust edits than its existing counterparts."}
{"id": "2503.24358", "pdf": "https://arxiv.org/pdf/2503.24358.pdf", "abs": "https://arxiv.org/abs/2503.24358", "title": "SQuat: Subspace-orthogonal KV Cache Quantization", "authors": ["Hao Wang", "Ligong Han", "Kai Xu", "Akash Srivastava"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.IT", "math.IT"], "comment": null, "summary": "The key-value (KV) cache accelerates LLMs decoding by storing KV tensors from\npreviously generated tokens. It reduces redundant computation at the cost of\nincreased memory usage. To mitigate this overhead, existing approaches compress\nKV tensors into lower-bit representations; however, quantization errors can\naccumulate as more tokens are generated, potentially resulting in undesired\noutputs. In this paper, we introduce SQuat (Subspace-orthogonal KV cache\nquantization). It first constructs a subspace spanned by query tensors to\ncapture the most critical task-related information. During key tensor\nquantization, it enforces that the difference between the (de)quantized and\noriginal keys remains orthogonal to this subspace, minimizing the impact of\nquantization errors on the attention mechanism's outputs. SQuat requires no\nmodel fine-tuning, no additional calibration dataset for offline learning, and\nis grounded in a theoretical framework we develop. Through numerical\nexperiments, we show that our method reduces peak memory by 2.17 to 2.82,\nimproves throughput by 2.45 to 3.60, and achieves more favorable benchmark\nscores than existing KV cache quantization algorithms."}
{"id": "2505.04066", "pdf": "https://arxiv.org/pdf/2505.04066.pdf", "abs": "https://arxiv.org/abs/2505.04066", "title": "LLAMAPIE: Proactive In-Ear Conversation Assistants", "authors": ["Tuochao Chen", "Nicholas Batchelder", "Alisa Liu", "Noah Smith", "Shyamnath Gollakota"], "categories": ["cs.LG", "cs.CL", "cs.HC", "cs.SD", "eess.AS"], "comment": "Published by ACL2025 (Findings)", "summary": "We introduce LlamaPIE, the first real-time proactive assistant designed to\nenhance human conversations through discreet, concise guidance delivered via\nhearable devices. Unlike traditional language models that require explicit user\ninvocation, this assistant operates in the background, anticipating user needs\nwithout interrupting conversations. We address several challenges, including\ndetermining when to respond, crafting concise responses that enhance\nconversations, leveraging knowledge of the user for context-aware assistance,\nand real-time, on-device processing. To achieve this, we construct a\nsemi-synthetic dialogue dataset and propose a two-model pipeline: a small model\nthat decides when to respond and a larger model that generates the response. We\nevaluate our approach on real-world datasets, demonstrating its effectiveness\nin providing helpful, unobtrusive assistance. User studies with our assistant,\nimplemented on Apple Silicon M2 hardware, show a strong preference for the\nproactive assistant over both a baseline with no assistance and a reactive\nmodel, highlighting the potential of LlamaPie to enhance live conversations."}
{"id": "2505.12225", "pdf": "https://arxiv.org/pdf/2505.12225.pdf", "abs": "https://arxiv.org/abs/2505.12225", "title": "Mining Intrinsic Rewards from LLM Hidden States for Efficient Best-of-N Sampling", "authors": ["Jizhou Guo", "Zhaomin Wu", "Hanchen Yang", "Philip S. Yu"], "categories": ["cs.LG", "cs.AI", "cs.CL", "stat.ML"], "comment": null, "summary": "Enhancing Large Language Model (LLM)'s performance with best-of-N sampling is\neffective and has attracted significant attention. However, it is\ncomputationally prohibitive due to massive, data-hungry text-based reward\nmodels. By changing the data source from text to hidden states, we introduce\nSWIFT (Simple Weighted Intrinsic Feedback Technique), a novel, lightweight\ntechnique that leverages the rich information embedded in LLM hidden states to\naddress these issues, which operates on token-level and consists of only linear\nlayers. Extensive experiments show that SWIFT outperforms baselines with less\nthan 0.005% of the parameters of baselines, requiring only a few samples for\ntraining, demonstrating significant efficiency improvement. SWIFT's robust\nscalability, applicability to some closed-source models via logits, and ability\nto be combined with traditional reward models to yield further performance\ngains underscore its practical value."}
{"id": "2505.14479", "pdf": "https://arxiv.org/pdf/2505.14479.pdf", "abs": "https://arxiv.org/abs/2505.14479", "title": "Towards Reliable Proof Generation with LLMs: A Neuro-Symbolic Approach", "authors": ["Oren Sultan", "Eitan Stern", "Dafna Shahaf"], "categories": ["cs.AI", "cs.CL"], "comment": "long paper", "summary": "Large language models (LLMs) struggle with formal domains that require\nrigorous logical deduction and symbolic reasoning, such as mathematical proof\ngeneration. We propose a neuro-symbolic approach that combines LLMs' generative\nstrengths with structured components to overcome this challenge. As a\nproof-of-concept, we focus on geometry problems. Our approach is two-fold: (1)\nwe retrieve analogous problems and use their proofs to guide the LLM, and (2) a\nformal verifier evaluates the generated proofs and provides feedback, helping\nthe model fix incorrect proofs. We demonstrate that our method significantly\nimproves proof accuracy for OpenAI's o1 model (58%-70% improvement); both\nanalogous problems and the verifier's feedback contribute to these gains. More\nbroadly, shifting to LLMs that generate provably correct conclusions could\ndramatically improve their reliability, accuracy and consistency, unlocking\ncomplex tasks and critical real-world applications that require\ntrustworthiness."}
{"id": "2506.01413", "pdf": "https://arxiv.org/pdf/2506.01413.pdf", "abs": "https://arxiv.org/abs/2506.01413", "title": "Incentivizing Reasoning for Advanced Instruction-Following of Large Language Models", "authors": ["Yulei Qin", "Gang Li", "Zongyi Li", "Zihan Xu", "Yuchen Shi", "Zhekai Lin", "Xiao Cui", "Ke Li", "Xing Sun"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "comment": "15 pages of main body, 5 tables, 5 figures, 42 pages of appendix", "summary": "Existing large language models (LLMs) face challenges of following complex\ninstructions, especially when multiple constraints are present and organized in\nparalleling, chaining, and branching structures. One intuitive solution, namely\nchain-of-thought (CoT), is expected to universally improve capabilities of\nLLMs. However, we find that the vanilla CoT exerts a negative impact on\nperformance due to its superficial reasoning pattern of simply paraphrasing the\ninstructions. It fails to peel back the compositions of constraints for\nidentifying their relationship across hierarchies of types and dimensions. To\nthis end, we propose RAIF, a systematic method to boost LLMs in dealing with\ncomplex instructions via incentivizing reasoning for test-time compute scaling.\nFirst, we stem from the decomposition of complex instructions under existing\ntaxonomies and propose a reproducible data acquisition method. Second, we\nexploit reinforcement learning (RL) with verifiable rule-centric reward signals\nto cultivate reasoning specifically for instruction following. We address the\nshallow, non-essential nature of reasoning under complex instructions via\nsample-wise contrast for superior CoT enforcement. We also exploit behavior\ncloning of experts to facilitate steady distribution shift from fast-thinking\nLLMs to skillful reasoners. Extensive evaluations on seven comprehensive\nbenchmarks confirm the validity of the proposed method, where a 1.5B LLM\nachieves 11.74% gains with performance comparable to a 8B LLM. Evaluation on\nOOD constraints also confirms the generalizability of our RAIF. Codes and data\nare available at https://github.com/yuleiqin/RAIF.\n  Keywords: reinforcement learning with verifiable rewards (RLVR), instruction\nfollowing, complex instructions"}
{"id": "2506.09081", "pdf": "https://arxiv.org/pdf/2506.09081.pdf", "abs": "https://arxiv.org/abs/2506.09081", "title": "FlagEvalMM: A Flexible Framework for Comprehensive Multimodal Model Evaluation", "authors": ["Zheqi He", "Yesheng Liu", "Jing-shu Zheng", "Xuejing Li", "Jin-Ge Yao", "Bowen Qin", "Richeng Xuan", "Xi Yang"], "categories": ["cs.CV", "cs.AI", "cs.CL"], "comment": "Accepted by ACL 2025 Demo", "summary": "We present FlagEvalMM, an open-source evaluation framework designed to\ncomprehensively assess multimodal models across a diverse range of\nvision-language understanding and generation tasks, such as visual question\nanswering, text-to-image/video generation, and image-text retrieval. We\ndecouple model inference from evaluation through an independent evaluation\nservice, thus enabling flexible resource allocation and seamless integration of\nnew tasks and models. Moreover, FlagEvalMM utilizes advanced inference\nacceleration tools (e.g., vLLM, SGLang) and asynchronous data loading to\nsignificantly enhance evaluation efficiency. Extensive experiments show that\nFlagEvalMM offers accurate and efficient insights into model strengths and\nlimitations, making it a valuable tool for advancing multimodal research. The\nframework is publicly accessible at\nhttps://github.com/flageval-baai/FlagEvalMM."}
{"id": "2506.15787", "pdf": "https://arxiv.org/pdf/2506.15787.pdf", "abs": "https://arxiv.org/abs/2506.15787", "title": "SLR: Automated Synthesis for Scalable Logical Reasoning", "authors": ["Lukas Helff", "Ahmad Omar", "Felix Friedrich", "Antonia Wüst", "Hikaru Shindo", "Rupert Mitchell", "Tim Woydt", "Patrick Schramowski", "and Wolfgang Stammer Kristian Kersting"], "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "We introduce SLR, an end-to-end framework for systematic evaluation and\ntraining of Large Language Models (LLMs) via Scalable Logical Reasoning. Given\na user's task specification, SLR automatically synthesizes (i) an instruction\nprompt for an inductive reasoning task, (ii) a validation program, executable\non model outputs to provide verifiable rewards, and (iii) the latent\nground-truth rule. This process is fully automated, scalable, requires no human\nannotations, and offers precise control over task difficulty. Using SLR, we\ncreate SLR-Bench, a benchmark comprising 19k prompts organized into 20\ncurriculum levels that progressively increase in relational, arithmetic, and\nrecursive complexity. Large-scale evaluation reveals that contemporary LLMs\nreadily produce syntactically valid rules, yet often fail at correct logical\ninference. Recent reasoning LLMs demonstrate improved performance but incur\nvery high test-time computation, with costs exceeding $300 for just 1,000\nprompts. Finally, curriculum learning via SLR doubles Llama-3-8B accuracy on\nSLR-Bench, achieving parity with Gemini-Flash-Thinking at a fraction of\ncomputational cost. Moreover, these reasoning capabilities generalize to a wide\nrange of established benchmarks, underscoring the effectiveness of SLR for\ndownstream reasoning."}
{"id": "2506.22493", "pdf": "https://arxiv.org/pdf/2506.22493.pdf", "abs": "https://arxiv.org/abs/2506.22493", "title": "A Detailed Factor Analysis for the Political Compass Test: Navigating Ideologies of Large Language Models", "authors": ["Sadia Kamal", "Lalu Prasad Yadav Prakash", "S M Rafiuddin", "Mohammed Rakib", "Arunkumar Bagavathi", "Atriya Sen", "Sagnik Ray Choudhury"], "categories": ["cs.CY", "cs.CL", "cs.LG"], "comment": null, "summary": "Political Compass Test (PCT) or similar questionnaires have been used to\nquantify LLM's political leanings. Building on a recent line of work that\nexamines the validity of PCT tests, we demonstrate that variation in standard\ngeneration parameters does not significantly impact the models' PCT scores.\nHowever, external factors such as prompt variations and fine-tuning\nindividually and in combination affect the same. Finally, we demonstrate that\nwhen models are fine-tuned on text datasets with higher political content than\nothers, the PCT scores are not differentially affected. This calls for a\nthorough investigation into the validity of PCT and similar tests, as well as\nthe mechanism by which political leanings are encoded in LLMs."}
{"id": "2507.08128", "pdf": "https://arxiv.org/pdf/2507.08128.pdf", "abs": "https://arxiv.org/abs/2507.08128", "title": "Audio Flamingo 3: Advancing Audio Intelligence with Fully Open Large Audio Language Models", "authors": ["Arushi Goel", "Sreyan Ghosh", "Jaehyeon Kim", "Sonal Kumar", "Zhifeng Kong", "Sang-gil Lee", "Chao-Han Huck Yang", "Ramani Duraiswami", "Dinesh Manocha", "Rafael Valle", "Bryan Catanzaro"], "categories": ["cs.SD", "cs.AI", "cs.CL", "eess.AS"], "comment": "Code, Datasets, and Models:\n  https://research.nvidia.com/labs/adlr/AF3/ ; Updates in v2: Updated results\n  for new thinking mode ckpts, added qualitative figure, added note on fully\n  open claim, add email ID for corresponding authors", "summary": "We present Audio Flamingo 3 (AF3), a fully open state-of-the-art (SOTA) large\naudio-language model that advances reasoning and understanding across speech,\nsound, and music. AF3 introduces: (i) AF-Whisper, a unified audio encoder\ntrained using a novel strategy for joint representation learning across all 3\nmodalities of speech, sound, and music; (ii) flexible, on-demand thinking,\nallowing the model to do chain-of-thought-type reasoning before answering;\n(iii) multi-turn, multi-audio chat; (iv) long audio understanding and reasoning\n(including speech) up to 10 minutes; and (v) voice-to-voice interaction. To\nenable these capabilities, we propose several large-scale training datasets\ncurated using novel strategies, including AudioSkills-XL, LongAudio-XL,\nAF-Think, and AF-Chat, and train AF3 with a novel five-stage curriculum-based\ntraining strategy. Trained on only open-source audio data, AF3 achieves new\nSOTA results on over 20+ (long) audio understanding and reasoning benchmarks,\nsurpassing both open-weight and closed-source models trained on much larger\ndatasets."}
{"id": "2507.16518", "pdf": "https://arxiv.org/pdf/2507.16518.pdf", "abs": "https://arxiv.org/abs/2507.16518", "title": "C2-Evo: Co-Evolving Multimodal Data and Model for Self-Improving Reasoning", "authors": ["Xiuwei Chen", "Wentao Hu", "Hanhui Li", "Jun Zhou", "Zisheng Chen", "Meng Cao", "Yihan Zeng", "Kui Zhang", "Yu-Jie Yuan", "Jianhua Han", "Hang Xu", "Xiaodan Liang"], "categories": ["cs.CV", "cs.CL", "cs.LG"], "comment": null, "summary": "Recent advances in multimodal large language models (MLLMs) have shown\nimpressive reasoning capabilities. However, further enhancing existing MLLMs\nnecessitates high-quality vision-language datasets with carefully curated task\ncomplexities, which are both costly and challenging to scale. Although recent\nself-improving models that iteratively refine themselves offer a feasible\nsolution, they still suffer from two core challenges: (i) most existing methods\naugment visual or textual data separately, resulting in discrepancies in data\ncomplexity (e.g., over-simplified diagrams paired with redundant textual\ndescriptions); and (ii) the evolution of data and models is also separated,\nleading to scenarios where models are exposed to tasks with mismatched\ndifficulty levels. To address these issues, we propose C2-Evo, an automatic,\nclosed-loop self-improving framework that jointly evolves both training data\nand model capabilities. Specifically, given a base dataset and a base model,\nC2-Evo enhances them by a cross-modal data evolution loop and a data-model\nevolution loop. The former loop expands the base dataset by generating complex\nmultimodal problems that combine structured textual sub-problems with\niteratively specified geometric diagrams, while the latter loop adaptively\nselects the generated problems based on the performance of the base model, to\nconduct supervised fine-tuning and reinforcement learning alternately.\nConsequently, our method continuously refines its model and training data, and\nconsistently obtains considerable performance gains across multiple\nmathematical reasoning benchmarks. Our code, models, and datasets will be\nreleased."}
{"id": "2507.20018", "pdf": "https://arxiv.org/pdf/2507.20018.pdf", "abs": "https://arxiv.org/abs/2507.20018", "title": "The Carbon Cost of Conversation, Sustainability in the Age of Language Models", "authors": ["Sayed Mahbub Hasan Amiri", "Prasun Goswami", "Md. Mainul Islam", "Mohammad Shakhawat Hossen", "Sayed Majhab Hasan Amiri", "Naznin Akter"], "categories": ["cs.CY", "cs.AI", "cs.CL"], "comment": "22 Pages, 5 Tables", "summary": "Large language models (LLMs) like GPT-3 and BERT have revolutionized natural\nlanguage processing (NLP), yet their environmental costs remain dangerously\noverlooked. This article critiques the sustainability of LLMs, quantifying\ntheir carbon footprint, water usage, and contribution to e-waste through case\nstudies of models such as GPT-4 and energy-efficient alternatives like Mistral\n7B. Training a single LLM can emit carbon dioxide equivalent to hundreds of\ncars driven annually, while data centre cooling exacerbates water scarcity in\nvulnerable regions. Systemic challenges corporate greenwashing, redundant model\ndevelopment, and regulatory voids perpetuate harm, disproportionately burdening\nmarginalized communities in the Global South. However, pathways exist for\nsustainable NLP: technical innovations (e.g., model pruning, quantum\ncomputing), policy reforms (carbon taxes, mandatory emissions reporting), and\ncultural shifts prioritizing necessity over novelty. By analysing industry\nleaders (Google, Microsoft) and laggards (Amazon), this work underscores the\nurgency of ethical accountability and global cooperation. Without immediate\naction, AIs ecological toll risks outpacing its societal benefits. The article\nconcludes with a call to align technological progress with planetary\nboundaries, advocating for equitable, transparent, and regenerative AI systems\nthat prioritize both human and environmental well-being."}
