{"id": "2508.20263", "pdf": "https://arxiv.org/pdf/2508.20263.pdf", "abs": "https://arxiv.org/abs/2508.20263", "title": "Athena: Intermediate Representations for Iterative Scaffolded App Generation with an LLM", "authors": ["Jazbo Beason", "Ruijia Cheng", "Eldon Schoop", "Jeffrey Nichols"], "categories": ["cs.HC"], "comment": null, "summary": "It is challenging to generate the code for a complete user interface using a\nLarge Language Model (LLM). User interfaces are complex and their\nimplementations often consist of multiple, inter-related files that together\nspecify the contents of each screen, the navigation flows between the screens,\nand the data model used throughout the application. It is challenging to craft\na single prompt for an LLM that contains enough detail to generate a complete\nuser interface, and even then the result is frequently a single large and\ndifficult to understand file that contains all of the generated screens. In\nthis paper, we introduce Athena, a prototype application generation environment\nthat demonstrates how the use of shared intermediate representations, including\nan app storyboard, data model, and GUI skeletons, can help a developer work\nwith an LLM in an iterative fashion to craft a complete user interface. These\nintermediate representations also scaffold the LLM's code generation process,\nproducing organized and structured code in multiple files while limiting\nerrors. We evaluated Athena with a user study that found 75% of participants\npreferred our prototype over a typical chatbot-style baseline for prototyping\napps."}
{"id": "2508.20383", "pdf": "https://arxiv.org/pdf/2508.20383.pdf", "abs": "https://arxiv.org/abs/2508.20383", "title": "Identifying Framing Practices in Visualization Design Through Practitioner Reflections", "authors": ["Prakash Shukla", "Paul Parsons"], "categories": ["cs.HC"], "comment": "Accepted for publication in the IEEEVIS Workshop on Visualization for\n  Communication (VisComm 25)", "summary": "Framing -- how designers define and reinterpret problems, shape narratives,\nand guide audience understanding -- is central to design practice. Yet in\nvisualization research, framing has been examined mostly through its rhetorical\nand perceptual effects on audiences, leaving its role in the design process\nunderexplored. This study addresses that gap by analyzing publicly available\npodcasts and book chapters in which over 80 professional visualization\ndesigners reflect on their work. We find that framing is a pervasive, iterative\nactivity, evident in scoping problems, interpreting data, aligning with\nstakeholder goals, and shaping narrative direction. Our analysis identifies the\nconditions that trigger reframing and the strategies practitioners use to\nnavigate uncertainty and guide design. These findings position framing as a\ncore dimension of visualization practice and underscore the need for research\nand education to support the interpretive and strategic judgment that\npractitioners exercise throughout the design process."}
{"id": "2508.20464", "pdf": "https://arxiv.org/pdf/2508.20464.pdf", "abs": "https://arxiv.org/abs/2508.20464", "title": "Human-Centered Design for Connected Automation: Predicting Pedestrian Crossing Intentions", "authors": ["Sanaz Motamedi", "Viktoria Marcus", "Griffin Pitts"], "categories": ["cs.HC", "cs.ET", "H.5.2; H.1.2; I.6; J.4"], "comment": null, "summary": "Road traffic remains a leading cause of death worldwide, with pedestrians and\nother vulnerable road users accounting for over half of the 1.19 million annual\nfatalities, much of it due to human error. Level-5 automated driving systems\n(ADSs), capable of full self-driving without human oversight, have the\npotential to reduce these incidents. However, their effectiveness depends not\nonly on automation performance but also on their ability to communicate intent\nand coordinate safely with pedestrians in the absence of traditional driver\ncues. Understanding how pedestrians interpret and respond to ADS behavior is\ntherefore critical to the development of connected vehicle systems. This study\nextends the Theory of Planned Behavior (TPB) by incorporating four external\nfactors (i.e. safety, trust, compatibility, and understanding) to model\npedestrian decision-making in road-crossing scenarios involving level-5 ADSs.\nUsing data from an online survey (n = 212), results show that perceived\nbehavioral control, attitude, and social information significantly predict\npedestrians' crossing intentions. External factors, particularly perceived\nsafety and understanding, strongly influence these constructs. Findings provide\nactionable insights for designing external human-machine interfaces (eHMIs) and\ncooperative V2X communication strategies that support safe, transparent\ninteractions between automated vehicles and pedestrians. This work contributes\nto the development of inclusive, human-centered connected mobility systems."}
{"id": "2508.20477", "pdf": "https://arxiv.org/pdf/2508.20477.pdf", "abs": "https://arxiv.org/abs/2508.20477", "title": "What is \"Spatial\" about Spatial Computing?", "authors": ["Yibo Wang", "Yuhan Luo", "Janghee Cho", "Junnan Yu"], "categories": ["cs.HC", "H.5.1; H.5.2; H.2.8"], "comment": null, "summary": "Recent advancements in geographic information systems and mixed reality\ntechnologies have positioned spatial computing as a transformative paradigm in\ncomputational science. However, the field remains conceptually fragmented, with\ndiverse interpretations across disciplines like Human-Computer Interaction,\nGeographic Information Science, and Computer Science, which hinders a\ncomprehensive understanding of spatial computing and poses challenges for its\ncoherent advancement and interdisciplinary integration. In this paper, we trace\nthe origins and historical evolution of spatial computing and examine how\n\"spatial\" is understood, identifying two schools of thought: \"spatial\" as the\ncontextual understanding of space, where spatial data guides interaction in the\nphysical world; and \"spatial\" as a mixed space for interaction, emphasizing the\nseamless integration of physical and digital environments to enable embodied\nengagement. By synthesizing these perspectives, we propose spatial computing as\na computational paradigm that redefines the interplay between environment,\ncomputation, and human experience, offering a holistic lens to enhance its\nconceptual clarity and inspire future technological innovations that support\nmeaningful interactions with and shaping of environments."}
{"id": "2508.20201", "pdf": "https://arxiv.org/pdf/2508.20201.pdf", "abs": "https://arxiv.org/abs/2508.20201", "title": "Social Bias in Multilingual Language Models: A Survey", "authors": ["Lance Calvin Lim Gamboa", "Yue Feng", "Mark Lee"], "categories": ["cs.CL"], "comment": "Accepted into EMNLP 2025 Main Conference", "summary": "Pretrained multilingual models exhibit the same social bias as models\nprocessing English texts. This systematic review analyzes emerging research\nthat extends bias evaluation and mitigation approaches into multilingual and\nnon-English contexts. We examine these studies with respect to linguistic\ndiversity, cultural awareness, and their choice of evaluation metrics and\nmitigation techniques. Our survey illuminates gaps in the field's dominant\nmethodological design choices (e.g., preference for certain languages, scarcity\nof multilingual mitigation experiments) while cataloging common issues\nencountered and solutions implemented in adapting bias benchmarks across\nlanguages and cultures. Drawing from the implications of our findings, we chart\ndirections for future research that can reinforce the multilingual bias\nliterature's inclusivity, cross-cultural appropriateness, and alignment with\nstate-of-the-art NLP advancements."}
{"id": "2508.20522", "pdf": "https://arxiv.org/pdf/2508.20522.pdf", "abs": "https://arxiv.org/abs/2508.20522", "title": "VisiTrail: A Cognitive Visualization Tool for Time-Series Analysis of Eye Tracking Data from Attention Game", "authors": ["Abdul Rehman", "Ilona Heldal", "Jerry Chun-Wei Lin"], "categories": ["cs.HC"], "comment": null, "summary": "Eye Tracking (ET) can help to understand visual attention and cognitive\nprocesses in interactive environments. In attention tasks, distinguishing\nbetween relevant target objects and distractors is crucial for effective\nperformance, yet the underlying gaze patterns that drive successful task\ncompletion remain incompletely understood. Traditional gaze analyses lack\ncomprehensive insights into the temporal dynamics of attention allocation and\nthe relationship between gaze behavior and task performance. When applied to\ncomplex visual search scenarios, current gaze analysis methods face several\nlimitations, including the isolation of measurements, visual stability, search\nefficiency, and the decision-making processes involved in these scenarios. This\npaper proposes an analysis tool that considers time series for eye tracking\ndata from task performance and also gaze measures (fixations, saccades and\nsmooth pursuit); temporal pattern analysis that reveals how attention evolves\nthroughout task performance; object-click sequence tracking that directly links\nvisual attention to user actions; and performance metrics that quantify both\naccuracy and efficiency. This tool provides comprehensive visualization\ntechniques that make complex patterns of stimuli and gaze connections\ninterpretable."}
{"id": "2508.20217", "pdf": "https://arxiv.org/pdf/2508.20217.pdf", "abs": "https://arxiv.org/abs/2508.20217", "title": "Prompting Strategies for Language Model-Based Item Generation in K-12 Education: Bridging the Gap Between Small and Large Language Models", "authors": ["Mohammad Amini", "Babak Ahmadi", "Xiaomeng Xiong", "Yilin Zhang", "Christopher Qiao"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "This study explores automatic generation (AIG) using language models to\ncreate multiple choice questions (MCQs) for morphological assessment, aiming to\nreduce the cost and inconsistency of manual test development. The study used a\ntwo-fold approach. First, we compared a fine-tuned medium model (Gemma, 2B)\nwith a larger untuned one (GPT-3.5, 175B). Second, we evaluated seven\nstructured prompting strategies, including zero-shot, few-shot,\nchain-of-thought, role-based, sequential, and combinations. Generated items\nwere assessed using automated metrics and expert scoring across five\ndimensions. We also used GPT-4.1, trained on expert-rated samples, to simulate\nhuman scoring at scale. Results show that structured prompting, especially\nstrategies combining chain-of-thought and sequential design, significantly\nimproved Gemma's outputs. Gemma generally produced more construct-aligned and\ninstructionally appropriate items than GPT-3.5's zero-shot responses, with\nprompt design playing a key role in mid-size model performance. This study\ndemonstrates that structured prompting and efficient fine-tuning can enhance\nmidsized models for AIG under limited data conditions. We highlight the value\nof combining automated metrics, expert judgment, and large-model simulation to\nensure alignment with assessment goals. The proposed workflow offers a\npractical and scalable way to develop and validate language assessment items\nfor K-12."}
{"id": "2508.20585", "pdf": "https://arxiv.org/pdf/2508.20585.pdf", "abs": "https://arxiv.org/abs/2508.20585", "title": "Persode: Personalized Visual Journaling with Episodic Memory-Aware AI Agent", "authors": ["Seokho Jin", "Manseo Kim", "Sungho Byun", "Hansol Kim", "Jungmin Lee", "Sujeong Baek", "Semi Kim", "Sanghum Park", "Sung Park"], "categories": ["cs.HC"], "comment": null, "summary": "Reflective journaling often lacks personalization and fails to engage\nGeneration Alpha and Z, who prefer visually immersive and fast-paced\ninteractions over traditional text-heavy methods. Visual storytelling enhances\nemotional recall and offers an engaging way to process personal expe- riences.\nDesigned with these digital-native generations in mind, this paper introduces\nPersode, a journaling system that integrates personalized onboarding,\nmemory-aware conversational agents, and automated visual storytelling. Persode\ncaptures user demographics and stylistic preferences through a tailored\nonboarding process, ensuring outputs resonate with individual identities. Using\na Retrieval-Augmented Generation (RAG) framework, it prioritizes emotionally\nsignificant memories to provide meaningful, context-rich interactions.\nAdditionally, Persode dynamically transforms user experiences into visually\nengaging narratives by generating prompts for advanced text-to-image models,\nadapting characters, backgrounds, and styles to user preferences. By addressing\nthe need for personalization, visual engagement, and responsiveness, Persode\nbridges the gap between traditional journaling and the evolving preferences of\nGen Alpha and Z."}
{"id": "2508.20223", "pdf": "https://arxiv.org/pdf/2508.20223.pdf", "abs": "https://arxiv.org/abs/2508.20223", "title": "Integrating SystemC TLM into FMI 3.0 Co-Simulations with an Open-Source Approach", "authors": ["Andrei Mihai Albu", "Giovanni Pollo", "Alessio Burrello", "Daniele Jahier Pagliari", "Cristian Tesconi", "Alessandra Neri", "Dario Soldi", "Fabio Autieri", "Sara Vinco"], "categories": ["cs.CL"], "comment": null, "summary": "The growing complexity of cyber-physical systems, particularly in automotive\napplications, has increased the demand for efficient modeling and cross-domain\nco-simulation techniques. While SystemC Transaction-Level Modeling (TLM)\nenables effective hardware/software co-design, its limited interoperability\nwith models from other engineering domains poses integration challenges. This\npaper presents a fully open-source methodology for integrating SystemC TLM\nmodels into Functional Mock-up Interface (FMI)-based co-simulation workflows.\nBy encapsulating SystemC TLM components as FMI 3.0 Co Simulation Functional\nMock-up Units (FMUs), the proposed approach facilitates seamless, standardized\nintegration across heterogeneous simulation environments. We introduce a\nlightweight open-source toolchain, address key technical challenges such as\ntime synchronization and data exchange, and demonstrate the feasibility and\neffectiveness of the integration through representative case studies."}
{"id": "2508.20635", "pdf": "https://arxiv.org/pdf/2508.20635.pdf", "abs": "https://arxiv.org/abs/2508.20635", "title": "Schema-Guided Response Generation using Multi-Frame Dialogue State for Motivational Interviewing Systems", "authors": ["Jie Zeng", "Yukiko I. Nakano"], "categories": ["cs.HC"], "comment": "28pages, 15 figures, 10 tables", "summary": "The primary goal of Motivational Interviewing (MI) is to help clients build\ntheir own motivation for behavioral change. To support this in dialogue\nsystems, it is essential to guide large language models (LLMs) to generate\ncounselor responses aligned with MI principles. By employing a schema-guided\napproach, this study proposes a method for updating multi-frame dialogue states\nand a strategy decision mechanism that dynamically determines the response\nfocus in a manner grounded in MI principles. The proposed method was\nimplemented in a dialogue system and evaluated through a user study. Results\nshowed that the proposed system successfully generated MI-favorable responses\nand effectively encouraged the user's (client's) deliberation by asking\neliciting questions."}
{"id": "2508.20324", "pdf": "https://arxiv.org/pdf/2508.20324.pdf", "abs": "https://arxiv.org/abs/2508.20324", "title": "Can Compact Language Models Search Like Agents? Distillation-Guided Policy Optimization for Preserving Agentic RAG Capabilities", "authors": ["Rikuto Kotoge", "Mai Nishimura", "Jiaxin Ma"], "categories": ["cs.CL"], "comment": null, "summary": "Reinforcement Learning has emerged as a post-training approach to elicit\nagentic RAG behaviors such as search and planning from language models.\nHowever, compact language models (e.g., 0.5B parameters) struggle due to poor\nreasoning ability, resulting in sparse rewards and unstable training. To\novercome these difficulties, we propose Distillation-Guided Policy Optimization\n(DGPO), which addresses the challenges through cold-start initialization from\nteacher demonstrations and continuous teacher guidance during policy\noptimization. To systematically evaluate our approach, we introduce Agentic RAG\nCapabilities (ARC), a fine-grained metric analyzing reasoning, search\ncoordination, and response synthesis. Comprehensive experiments demonstrate\nthat DGPO enables compact models to achieve sophisticated agentic search\nbehaviors, even outperforming the larger teacher model in some cases. DGPO\nmakes agentic RAG feasible in computing resource-constrained environments."}
{"id": "2508.21036", "pdf": "https://arxiv.org/pdf/2508.21036.pdf", "abs": "https://arxiv.org/abs/2508.21036", "title": "Understanding, Protecting, and Augmenting Human Cognition with Generative AI: A Synthesis of the CHI 2025 Tools for Thought Workshop", "authors": ["Lev Tankelevitch", "Elena L. Glassman", "Jessica He", "Aniket Kittur", "Mina Lee", "Srishti Palani", "Advait Sarkar", "Gonzalo Ramos", "Yvonne Rogers", "Hari Subramonyam"], "categories": ["cs.HC", "cs.AI"], "comment": null, "summary": "Generative AI (GenAI) radically expands the scope and capability of\nautomation for work, education, and everyday tasks, a transformation posing\nboth risks and opportunities for human cognition. How will human cognition\nchange, and what opportunities are there for GenAI to augment it? Which\ntheories, metrics, and other tools are needed to address these questions? The\nCHI 2025 workshop on Tools for Thought aimed to bridge an emerging science of\nhow the use of GenAI affects human thought, from metacognition to critical\nthinking, memory, and creativity, with an emerging design practice for building\nGenAI tools that both protect and augment human thought. Fifty-six researchers,\ndesigners, and thinkers from across disciplines as well as industry and\nacademia, along with 34 papers and portfolios, seeded a day of discussion,\nideation, and community-building. We synthesize this material here to begin\nmapping the space of research and design opportunities and to catalyze a\nmultidisciplinary community around this pressing area of research."}
{"id": "2508.20325", "pdf": "https://arxiv.org/pdf/2508.20325.pdf", "abs": "https://arxiv.org/abs/2508.20325", "title": "GUARD: Guideline Upholding Test through Adaptive Role-play and Jailbreak Diagnostics for LLMs", "authors": ["Haibo Jin", "Ruoxi Chen", "Peiyan Zhang", "Andy Zhou", "Yang Zhang", "Haohan Wang"], "categories": ["cs.CL", "cs.AI", "cs.CV"], "comment": "54 pages", "summary": "As Large Language Models become increasingly integral to various domains,\ntheir potential to generate harmful responses has prompted significant societal\nand regulatory concerns. In response, governments have issued ethics guidelines\nto promote the development of trustworthy AI. However, these guidelines are\ntypically high-level demands for developers and testers, leaving a gap in\ntranslating them into actionable testing questions to verify LLM compliance.\n  To address this challenge, we introduce GUARD (\\textbf{G}uideline\n\\textbf{U}pholding Test through \\textbf{A}daptive \\textbf{R}ole-play and\nJailbreak \\textbf{D}iagnostics), a testing method designed to operationalize\nguidelines into specific guideline-violating questions that assess LLM\nadherence. To implement this, GUARD uses automated generation of\nguideline-violating questions based on government-issued guidelines, thereby\ntesting whether responses comply with these guidelines. When responses directly\nviolate guidelines, GUARD reports inconsistencies. Furthermore, for responses\nthat do not directly violate guidelines, GUARD integrates the concept of\n``jailbreaks'' to diagnostics, named GUARD-JD, which creates scenarios that\nprovoke unethical or guideline-violating responses, effectively identifying\npotential scenarios that could bypass built-in safety mechanisms. Our method\nfinally culminates in a compliance report, delineating the extent of adherence\nand highlighting any violations.\n  We have empirically validated the effectiveness of GUARD on seven LLMs,\nincluding Vicuna-13B, LongChat-7B, Llama2-7B, Llama-3-8B, GPT-3.5, GPT-4,\nGPT-4o, and Claude-3.7, by testing compliance under three government-issued\nguidelines and conducting jailbreak diagnostics. Additionally, GUARD-JD can\ntransfer jailbreak diagnostics to vision-language models, demonstrating its\nusage in promoting reliable LLM-based applications."}
{"id": "2508.21061", "pdf": "https://arxiv.org/pdf/2508.21061.pdf", "abs": "https://arxiv.org/abs/2508.21061", "title": "OnGoal: Tracking and Visualizing Conversational Goals in Multi-Turn Dialogue with Large Language Models", "authors": ["Adam Coscia", "Shunan Guo", "Eunyee Koh", "Alex Endert"], "categories": ["cs.HC", "cs.AI", "cs.LG"], "comment": "Accepted to UIST 2025. 18 pages, 9 figures, 2 tables. For a demo\n  video, see https://youtu.be/uobhmxo6EIE", "summary": "As multi-turn dialogues with large language models (LLMs) grow longer and\nmore complex, how can users better evaluate and review progress on their\nconversational goals? We present OnGoal, an LLM chat interface that helps users\nbetter manage goal progress. OnGoal provides real-time feedback on goal\nalignment through LLM-assisted evaluation, explanations for evaluation results\nwith examples, and overviews of goal progression over time, enabling users to\nnavigate complex dialogues more effectively. Through a study with 20\nparticipants on a writing task, we evaluate OnGoal against a baseline chat\ninterface without goal tracking. Using OnGoal, participants spent less time and\neffort to achieve their goals while exploring new prompting strategies to\novercome miscommunication, suggesting tracking and visualizing goals can\nenhance engagement and resilience in LLM dialogues. Our findings inspired\ndesign implications for future LLM chat interfaces that improve goal\ncommunication, reduce cognitive load, enhance interactivity, and enable\nfeedback to improve LLM performance."}
{"id": "2508.20351", "pdf": "https://arxiv.org/pdf/2508.20351.pdf", "abs": "https://arxiv.org/abs/2508.20351", "title": "Joint Enhancement of Relational Reasoning for Long-Context LLMs", "authors": ["Zhirui Chen", "Wei Shen", "Jiashui Huang", "Ling Shao"], "categories": ["cs.CL"], "comment": "9 pages, 5 pages Accepted by EMNLP 2025 Findings", "summary": "Despite significant progress, large language models (LLMs) still struggle\nwith long contexts due to memory limitations and their inability to tackle\ncomplex and long-context tasks. Additionally, LLMs often suffer from a lack of\ntransparency and are prone to producing hallucinations. To address these\nchallenges, we propose \\textbf{JERR}, a novel framework designed to enhance\nlong-context comprehension via graph-based reasoning in LLMs. JERR integrates\nthree key components: synopsis extraction, graph construction, and relational\nreasoning. First, synopsis is extracted by chunking text strategically,\nallowing the model to summarize and understand information more efficiently.\nSecond, we build a directed acyclic graph (DAG) to resolve redundancy, ensuring\nlogical consistency and clarity. Finally, we incorporate Monte Carlo Tree\nSearch (MCTS) to help the model navigate complex reasoning paths, ensuring more\naccurate and interpretable outputs. This framework provides a novel solution\nthat enables LLMs to handle extended contexts and complex reasoning tasks with\nimproved reliability and transparency. Experimental results show that JERR\nconsistently outperforms all baselines on the ROUGE and F1 metrics, achieving\nthe highest scores on the LLM-Rater evaluation."}
{"id": "2508.20139", "pdf": "https://arxiv.org/pdf/2508.20139.pdf", "abs": "https://arxiv.org/abs/2508.20139", "title": "Is the medical image segmentation problem solved? A survey of current developments and future directions", "authors": ["Guoping Xu", "Jayaram K. Udupa", "Jax Luo", "Songlin Zhao", "Yajun Yu", "Scott B. Raymond", "Hao Peng", "Lipeng Ning", "Yogesh Rathi", "Wei Liu", "You Zhang"], "categories": ["eess.IV", "cs.CV", "cs.HC", "cs.LG"], "comment": "80 pages, 38 figures", "summary": "Medical image segmentation has advanced rapidly over the past two decades,\nlargely driven by deep learning, which has enabled accurate and efficient\ndelineation of cells, tissues, organs, and pathologies across diverse imaging\nmodalities. This progress raises a fundamental question: to what extent have\ncurrent models overcome persistent challenges, and what gaps remain? In this\nwork, we provide an in-depth review of medical image segmentation, tracing its\nprogress and key developments over the past decade. We examine core principles,\nincluding multiscale analysis, attention mechanisms, and the integration of\nprior knowledge, across the encoder, bottleneck, skip connections, and decoder\ncomponents of segmentation networks. Our discussion is organized around seven\nkey dimensions: (1) the shift from supervised to semi-/unsupervised learning,\n(2) the transition from organ segmentation to lesion-focused tasks, (3)\nadvances in multi-modality integration and domain adaptation, (4) the role of\nfoundation models and transfer learning, (5) the move from deterministic to\nprobabilistic segmentation, (6) the progression from 2D to 3D and 4D\nsegmentation, and (7) the trend from model invocation to segmentation agents.\nTogether, these perspectives provide a holistic overview of the trajectory of\ndeep learning-based medical image segmentation and aim to inspire future\ninnovation. To support ongoing research, we maintain a continually updated\nrepository of relevant literature and open-source resources at\nhttps://github.com/apple1986/medicalSegReview"}
{"id": "2508.20373", "pdf": "https://arxiv.org/pdf/2508.20373.pdf", "abs": "https://arxiv.org/abs/2508.20373", "title": "Graph-R1: Unleashing LLM Reasoning with NP-Hard Graph Problems", "authors": ["Yuyao Wang", "Bowen Liu", "Jianheng Tang", "Nuo Chen", "Yuhan Li", "Qifan Zhang", "Jia Li"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Reasoning Large Language Models (RLLMs) have recently achieved remarkable\nprogress on complex reasoning tasks, largely enabled by their long\nchain-of-thought (Long CoT) capabilities. However, developing these Long CoT\nbehaviors relies heavily on post-training with high-quality datasets, which are\ntypically costly and human-curated (e.g., mathematics and code), leaving\nscalable alternatives unexplored. In this work, we introduce NP-hard (NPH)\ngraph problems as a novel synthetic training corpus, as they inherently require\ndeep reasoning, extensive exploration, and reflective strategies, which are\ncore characteristics of Long CoT reasoning. Building on this insight, we\ndevelop a two-stage post-training framework: (i) Long CoT Supervised\nFine-Tuning (SFT) on rejection-sampled NPH graph instances, which substantially\nenhances reasoning depth, and (ii) Reinforcement Learning (RL) with a\nfine-grained reward design, which sharpens reasoning efficiency. Our flagship\nmodel, Graph-R1-7B, demonstrates strong generalization across mathematics,\ncoding, STEM, and logic, and surpasses QwQ-32B on NPH graph problems in both\naccuracy and reasoning efficiency. These results position NPH graph problems as\nan effective and scalable resource for advancing Long CoT reasoning in LLMs,\nopening a new frontier for LLM post-training. Our implementation is available\nat https://github.com/Graph-Reasoner/Graph-R1, with models and datasets hosted\nin our Hugging Face collection HKUST-DSAIL/Graph-R1."}
{"id": "2508.20148", "pdf": "https://arxiv.org/pdf/2508.20148.pdf", "abs": "https://arxiv.org/abs/2508.20148", "title": "The Anatomy of a Personal Health Agent", "authors": ["A. Ali Heydari", "Ken Gu", "Vidya Srinivas", "Hong Yu", "Zhihan Zhang", "Yuwei Zhang", "Akshay Paruchuri", "Qian He", "Hamid Palangi", "Nova Hammerquist", "Ahmed A. Metwally", "Brent Winslow", "Yubin Kim", "Kumar Ayush", "Yuzhe Yang", "Girish Narayanswamy", "Maxwell A. Xu", "Jake Garrison", "Amy Aremnto Lee", "Jenny Vafeiadou", "Ben Graef", "Isaac R. Galatzer-Levy", "Erik Schenck", "Andrew Barakat", "Javier Perez", "Jacqueline Shreibati", "John Hernandez", "Anthony Z. Faranesh", "Javier L. Prieto", "Connor Heneghan", "Yun Liu", "Jiening Zhan", "Mark Malhotra", "Shwetak Patel", "Tim Althoff", "Xin Liu", "Daniel McDuff", "Xuhai \"Orson\" Xu"], "categories": ["cs.AI", "cs.HC", "cs.MA"], "comment": null, "summary": "Health is a fundamental pillar of human wellness, and the rapid advancements\nin large language models (LLMs) have driven the development of a new generation\nof health agents. However, the application of health agents to fulfill the\ndiverse needs of individuals in daily non-clinical settings is underexplored.\nIn this work, we aim to build a comprehensive personal health agent that is\nable to reason about multimodal data from everyday consumer wellness devices\nand common personal health records, and provide personalized health\nrecommendations. To understand end-users' needs when interacting with such an\nassistant, we conducted an in-depth analysis of web search and health forum\nqueries, alongside qualitative insights from users and health experts gathered\nthrough a user-centered design process. Based on these findings, we identified\nthree major categories of consumer health needs, each of which is supported by\na specialist sub-agent: (1) a data science agent that analyzes personal\ntime-series wearable and health record data, (2) a health domain expert agent\nthat integrates users' health and contextual data to generate accurate,\npersonalized insights, and (3) a health coach agent that synthesizes data\ninsights, guiding users using a specified psychological strategy and tracking\nusers' progress. Furthermore, we propose and develop the Personal Health Agent\n(PHA), a multi-agent framework that enables dynamic, personalized interactions\nto address individual health needs. To evaluate each sub-agent and the\nmulti-agent system, we conducted automated and human evaluations across 10\nbenchmark tasks, involving more than 7,000 annotations and 1,100 hours of\neffort from health experts and end-users. Our work represents the most\ncomprehensive evaluation of a health agent to date and establishes a strong\nfoundation towards the futuristic vision of a personal health agent accessible\nto everyone."}
{"id": "2508.20385", "pdf": "https://arxiv.org/pdf/2508.20385.pdf", "abs": "https://arxiv.org/abs/2508.20385", "title": "CAPE: Context-Aware Personality Evaluation Framework for Large Language Models", "authors": ["Jivnesh Sandhan", "Fei Cheng", "Tushar Sandhan", "Yugo Murawaki"], "categories": ["cs.CL"], "comment": "Accepted at EMNLP25 (Findings)", "summary": "Psychometric tests, traditionally used to assess humans, are now being\napplied to Large Language Models (LLMs) to evaluate their behavioral traits.\nHowever, existing studies follow a context-free approach, answering each\nquestion in isolation to avoid contextual influence. We term this the Disney\nWorld test, an artificial setting that ignores real-world applications, where\nconversational history shapes responses. To bridge this gap, we propose the\nfirst Context-Aware Personality Evaluation (CAPE) framework for LLMs,\nincorporating prior conversational interactions. To thoroughly analyze the\ninfluence of context, we introduce novel metrics to quantify the consistency of\nLLM responses, a fundamental trait in human behavior.\n  Our exhaustive experiments on 7 LLMs reveal that conversational history\nenhances response consistency via in-context learning but also induces\npersonality shifts, with GPT-3.5-Turbo and GPT-4-Turbo exhibiting extreme\ndeviations. While GPT models are robust to question ordering, Gemini-1.5-Flash\nand Llama-8B display significant sensitivity. Moreover, GPT models response\nstem from their intrinsic personality traits as well as prior interactions,\nwhereas Gemini-1.5-Flash and Llama--8B heavily depend on prior interactions.\nFinally, applying our framework to Role Playing Agents (RPAs) shows\ncontext-dependent personality shifts improve response consistency and better\nalign with human judgments. Our code and datasets are publicly available at:\nhttps://github.com/jivnesh/CAPE"}
{"id": "2508.20236", "pdf": "https://arxiv.org/pdf/2508.20236.pdf", "abs": "https://arxiv.org/abs/2508.20236", "title": "The Mathematician's Assistant: Integrating AI into Research Practice", "authors": ["Jonas Henkel"], "categories": ["math.HO", "cs.AI", "cs.HC", "cs.LG", "00A35 (Primary), 68T07 (Secondary)", "I.2.7; H.5.2"], "comment": "24 pages, 7 figures. Accepted for publication in Mathematische\n  Semesterberichte (to appear in vol. 72, no. 2)", "summary": "The rapid development of artificial intelligence (AI), marked by\nbreakthroughs like 'AlphaEvolve' and 'Gemini Deep Think', is beginning to offer\npowerful new tools that have the potential to significantly alter the research\npractice in many areas of mathematics. This paper explores the current\nlandscape of publicly accessible large language models (LLMs) in a mathematical\nresearch context, based on developments up to August 2, 2025. Our analysis of\nrecent benchmarks, such as MathArena and the Open Proof Corpus (Balunovi\\'c et\nal., 2025; Dekoninck et al., 2025), reveals a complex duality: while\nstate-of-the-art models demonstrate strong abilities in solving problems and\nevaluating proofs, they also exhibit systematic flaws, including a lack of\nself-critique and a model depending discrepancy between final-answer accuracy\nand full-proof validity.\n  Based on these findings, we propose a durable framework for integrating AI\ninto the research workflow, centered on the principle of the augmented\nmathematician. In this model, the AI functions as a copilot under the critical\nguidance of the human researcher, an approach distilled into five guiding\nprinciples for effective and responsible use. We then systematically explore\nseven fundamental ways AI can be applied across the research lifecycle, from\ncreativity and ideation to the final writing process, demonstrating how these\nprinciples translate into concrete practice.\n  We conclude that the primary role of AI is currently augmentation rather than\nautomation. This requires a new skill set focused on strategic prompting,\ncritical verification, and methodological rigor in order to effectively use\nthese powerful tools."}
{"id": "2508.20395", "pdf": "https://arxiv.org/pdf/2508.20395.pdf", "abs": "https://arxiv.org/abs/2508.20395", "title": "Measuring Reasoning Utility in LLMs via Conditional Entropy Reduction", "authors": ["Xu Guo"], "categories": ["cs.CL", "cs.AI", "I.2.7"], "comment": "11 pages, 4 figures", "summary": "Recent advancements in large language models (LLMs) often rely on generating\nintermediate reasoning steps to enhance accuracy. However, little work has\nexamined how reasoning utility contributes to the final answer's correctness.\nDue to the stochastic nature of autoregressive generation, generating more\ncontext does not guarantee increased confidence in the answer. If we could\npredict, during generation, whether a reasoning step will be useful, we could\nstop early or prune ineffective steps, avoiding distractions in the final\ndecision.\n  We present an oracle study on MATH dataset, using Qwen2.5-32B and GPT-4o to\ngenerate reasoning chains, and then employing a separate model (Qwen3-8B) to\nquantify the utility of these chains for final accuracy. Specifically, we\nmeasure the model's uncertainty on the answer span Y at each reasoning step\nusing conditional entropy (expected negative log-likelihood over the\nvocabulary) with context expanding step by step. Our results show a clear\npattern: conditional entropy that decreases over steps is strongly associated\nwith correct answers, whereas flat or increasing entropy often results in wrong\nanswers. We also corroborate that incorrect reasoning paths tend to be longer\nthan correct ones, suggesting that longer reasoning does not necessarily yield\nbetter outcomes. These findings serve as a foundation to inspire future work on\ndesigning efficient reasoning pipelines that detect and avoid unproductive\nreasoning early."}
{"id": "2508.20345", "pdf": "https://arxiv.org/pdf/2508.20345.pdf", "abs": "https://arxiv.org/abs/2508.20345", "title": "MedFoundationHub: A Lightweight and Secure Toolkit for Deploying Medical Vision Language Foundation Models", "authors": ["Xiao Li", "Yanfan Zhu", "Ruining Deng", "Wei-Qi Wei", "Yu Wang", "Shilin Zhao", "Yaohong Wang", "Haichun Yang", "Yuankai Huo"], "categories": ["cs.CV", "cs.HC"], "comment": null, "summary": "Recent advances in medical vision-language models (VLMs) open up remarkable\nopportunities for clinical applications such as automated report generation,\ncopilots for physicians, and uncertainty quantification. However, despite their\npromise, medical VLMs introduce serious security concerns, most notably risks\nof Protected Health Information (PHI) exposure, data leakage, and vulnerability\nto cyberthreats - which are especially critical in hospital environments. Even\nwhen adopted for research or non-clinical purposes, healthcare organizations\nmust exercise caution and implement safeguards. To address these challenges, we\npresent MedFoundationHub, a graphical user interface (GUI) toolkit that: (1)\nenables physicians to manually select and use different models without\nprogramming expertise, (2) supports engineers in efficiently deploying medical\nVLMs in a plug-and-play fashion, with seamless integration of Hugging Face\nopen-source models, and (3) ensures privacy-preserving inference through\nDocker-orchestrated, operating system agnostic deployment. MedFoundationHub\nrequires only an offline local workstation equipped with a single NVIDIA A6000\nGPU, making it both secure and accessible within the typical resources of\nacademic research labs. To evaluate current capabilities, we engaged\nboard-certified pathologists to deploy and assess five state-of-the-art VLMs\n(Google-MedGemma3-4B, Qwen2-VL-7B-Instruct, Qwen2.5-VL-7B-Instruct, and\nLLaVA-1.5-7B/13B). Expert evaluation covered colon cases and renal cases,\nyielding 1015 clinician-model scoring events. These assessments revealed\nrecurring limitations, including off-target answers, vague reasoning, and\ninconsistent pathology terminology."}
{"id": "2508.20410", "pdf": "https://arxiv.org/pdf/2508.20410.pdf", "abs": "https://arxiv.org/abs/2508.20410", "title": "UI-Bench: A Benchmark for Evaluating Design Capabilities of AI Text-to-App Tools", "authors": ["Sam Jung", "Agustin Garcinuno", "Spencer Mateega"], "categories": ["cs.CL"], "comment": null, "summary": "AI text-to-app tools promise high quality applications and websites in\nminutes, yet no public benchmark rigorously verifies those claims. We introduce\nUI-Bench, the first large-scale benchmark that evaluates visual excellence\nacross competing AI text-to-app tools through expert pairwise comparison.\nSpanning 10 tools, 30 prompts, 300 generated sites, and \\textit{4000+} expert\njudgments, UI-Bench ranks systems with a TrueSkill-derived model that yields\ncalibrated confidence intervals. UI-Bench establishes a reproducible standard\nfor advancing AI-driven web design. We release (i) the complete prompt set,\n(ii) an open-source evaluation framework, and (iii) a public leaderboard. The\ngenerated sites rated by participants will be released soon. View the UI-Bench\nleaderboard at https://uibench.ai/leaderboard."}
{"id": "2508.20973", "pdf": "https://arxiv.org/pdf/2508.20973.pdf", "abs": "https://arxiv.org/abs/2508.20973", "title": "ProactiveEval: A Unified Evaluation Framework for Proactive Dialogue Agents", "authors": ["Tianjian Liu", "Fanqi Wan", "Jiajian Guo", "Xiaojun Quan"], "categories": ["cs.CL", "cs.AI", "cs.HC"], "comment": "21 pages, 6 Figures", "summary": "Proactive dialogue has emerged as a critical and challenging research problem\nin advancing large language models (LLMs). Existing works predominantly focus\non domain-specific or task-oriented scenarios, which leads to fragmented\nevaluations and limits the comprehensive exploration of models' proactive\nconversation abilities. In this work, we propose ProactiveEval, a unified\nframework designed for evaluating proactive dialogue capabilities of LLMs. This\nframework decomposes proactive dialogue into target planning and dialogue\nguidance, establishing evaluation metrics across various domains. Moreover, it\nalso enables the automatic generation of diverse and challenging evaluation\ndata. Based on the proposed framework, we develop 328 evaluation environments\nspanning 6 distinct domains. Through experiments with 22 different types of\nLLMs, we show that DeepSeek-R1 and Claude-3.7-Sonnet exhibit exceptional\nperformance on target planning and dialogue guidance tasks, respectively.\nFinally, we investigate how reasoning capabilities influence proactive\nbehaviors and discuss their implications for future model development."}
{"id": "2508.20416", "pdf": "https://arxiv.org/pdf/2508.20416.pdf", "abs": "https://arxiv.org/abs/2508.20416", "title": "DentalBench: Benchmarking and Advancing LLMs Capability for Bilingual Dentistry Understanding", "authors": ["Hengchuan Zhu", "Yihuan Xu", "Yichen Li", "Zijie Meng", "Zuozhu Liu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Recent advances in large language models (LLMs) and medical LLMs (Med-LLMs)\nhave demonstrated strong performance on general medical benchmarks. However,\ntheir capabilities in specialized medical fields, such as dentistry which\nrequire deeper domain-specific knowledge, remain underexplored due to the lack\nof targeted evaluation resources. In this paper, we introduce DentalBench, the\nfirst comprehensive bilingual benchmark designed to evaluate and advance LLMs\nin the dental domain. DentalBench consists of two main components: DentalQA, an\nEnglish-Chinese question-answering (QA) benchmark with 36,597 questions\nspanning 4 tasks and 16 dental subfields; and DentalCorpus, a large-scale,\nhigh-quality corpus with 337.35 million tokens curated for dental domain\nadaptation, supporting both supervised fine-tuning (SFT) and\nretrieval-augmented generation (RAG). We evaluate 14 LLMs, covering\nproprietary, open-source, and medical-specific models, and reveal significant\nperformance gaps across task types and languages. Further experiments with\nQwen-2.5-3B demonstrate that domain adaptation substantially improves model\nperformance, particularly on knowledge-intensive and terminology-focused tasks,\nand highlight the importance of domain-specific benchmarks for developing\ntrustworthy and effective LLMs tailored to healthcare applications."}
{"id": "2508.21010", "pdf": "https://arxiv.org/pdf/2508.21010.pdf", "abs": "https://arxiv.org/abs/2508.21010", "title": "ChainReaction! Structured Approach with Causal Chains as Intermediate Representations for Improved and Explainable Causal Video Question Answering", "authors": ["Paritosh Parmar", "Eric Peh", "Basura Fernando"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.HC", "cs.LG"], "comment": "Project page: https://paritoshparmar.github.io/chainreaction/", "summary": "Existing Causal-Why Video Question Answering (VideoQA) models often struggle\nwith higher-order reasoning, relying on opaque, monolithic pipelines that\nentangle video understanding, causal inference, and answer generation. These\nblack-box approaches offer limited interpretability and tend to depend on\nshallow heuristics. We propose a novel, modular framework that explicitly\ndecouples causal reasoning from answer generation, introducing natural language\ncausal chains as interpretable intermediate representations. Inspired by human\ncognitive models, these structured cause-effect sequences bridge low-level\nvideo content with high-level causal reasoning, enabling transparent and\nlogically coherent inference. Our two-stage architecture comprises a Causal\nChain Extractor (CCE) that generates causal chains from video-question pairs,\nand a Causal Chain-Driven Answerer (CCDA) that produces answers grounded in\nthese chains. To address the lack of annotated reasoning traces, we introduce a\nscalable method for generating high-quality causal chains from existing\ndatasets using large language models. We also propose CauCo, a new evaluation\nmetric for causality-oriented captioning. Experiments on three large-scale\nbenchmarks demonstrate that our approach not only outperforms state-of-the-art\nmodels, but also yields substantial gains in explainability, user trust, and\ngeneralization -- positioning the CCE as a reusable causal reasoning engine\nacross diverse domains. Project page:\nhttps://paritoshparmar.github.io/chainreaction/"}
{"id": "2508.20417", "pdf": "https://arxiv.org/pdf/2508.20417.pdf", "abs": "https://arxiv.org/abs/2508.20417", "title": "KG-CQR: Leveraging Structured Relation Representations in Knowledge Graphs for Contextual Query Retrieval", "authors": ["Chi Minh Bui", "Ngoc Mai Thieu", "Van Vinh Nguyen", "Json J. Jung", "Khac-Hoai Nam Bui"], "categories": ["cs.CL", "cs.DB"], "comment": "Accepted at Main EMNLP 2025", "summary": "The integration of knowledge graphs (KGs) with large language models (LLMs)\noffers significant potential to improve the retrieval phase of\nretrieval-augmented generation (RAG) systems. In this study, we propose KG-CQR,\na novel framework for Contextual Query Retrieval (CQR) that enhances the\nretrieval phase by enriching the contextual representation of complex input\nqueries using a corpus-centric KG. Unlike existing methods that primarily\naddress corpus-level context loss, KG-CQR focuses on query enrichment through\nstructured relation representations, extracting and completing relevant KG\nsubgraphs to generate semantically rich query contexts. Comprising subgraph\nextraction, completion, and contextual generation modules, KG-CQR operates as a\nmodel-agnostic pipeline, ensuring scalability across LLMs of varying sizes\nwithout additional training. Experimental results on RAGBench and MultiHop-RAG\ndatasets demonstrate KG-CQR's superior performance, achieving a 4-6%\nimprovement in mAP and a 2-3% improvement in Recall@25 over strong baseline\nmodels. Furthermore, evaluations on challenging RAG tasks such as multi-hop\nquestion answering show that, by incorporating KG-CQR, the performance\nconsistently outperforms the existing baseline in terms of retrieval\neffectiveness"}
{"id": "2412.14195", "pdf": "https://arxiv.org/pdf/2412.14195.pdf", "abs": "https://arxiv.org/abs/2412.14195", "title": "A multimodal dataset for understanding the impact of mobile phones on remote online virtual education", "authors": ["Roberto Daza", "Alvaro Becerra", "Ruth Cobos", "Julian Fierrez", "Aythami Morales"], "categories": ["cs.HC", "cs.CV"], "comment": "Published in Scientific Data (Nature). GitHub repository of the\n  dataset at: https://github.com/BiDAlab/IMPROVE", "summary": "This work presents the IMPROVE dataset, a multimodal resource designed to\nevaluate the effects of mobile phone usage on learners during online education.\nIt includes behavioral, biometric, physiological, and academic performance data\ncollected from 120 learners divided into three groups with different levels of\nphone interaction, enabling the analysis of the impact of mobile phone usage\nand related phenomena such as nomophobia. A setup involving 16 synchronized\nsensors-including EEG, eye tracking, video cameras, smartwatches, and keystroke\ndynamics-was used to monitor learner activity during 30-minute sessions\ninvolving educational videos, document reading, and multiple-choice tests.\nMobile phone usage events, including both controlled interventions and\nuncontrolled interactions, were labeled by supervisors and refined through a\nsemi-supervised re-labeling process. Technical validation confirmed signal\nquality, and statistical analyses revealed biometric changes associated with\nphone usage. The dataset is publicly available for research through GitHub and\nScience Data Bank, with synchronized recordings from three platforms (edBB,\nedX, and LOGGE), provided in standard formats (.csv, .mp4, .wav, and .tsv), and\naccompanied by a detailed guide."}
{"id": "2508.20420", "pdf": "https://arxiv.org/pdf/2508.20420.pdf", "abs": "https://arxiv.org/abs/2508.20420", "title": "CAMB: A comprehensive industrial LLM benchmark on civil aviation maintenance", "authors": ["Feng Zhang", "Chengjie Pang", "Yuehan Zhang", "Chenyu Luo"], "categories": ["cs.CL"], "comment": null, "summary": "Civil aviation maintenance is a domain characterized by stringent industry\nstandards. Within this field, maintenance procedures and troubleshooting\nrepresent critical, knowledge-intensive tasks that require sophisticated\nreasoning. To address the lack of specialized evaluation tools for large\nlanguage models (LLMs) in this vertical, we propose and develop an\nindustrial-grade benchmark specifically designed for civil aviation\nmaintenance. This benchmark serves a dual purpose: It provides a standardized\ntool to measure LLM capabilities within civil aviation maintenance, identifying\nspecific gaps in domain knowledge and complex reasoning. By pinpointing these\ndeficiencies, the benchmark establishes a foundation for targeted improvement\nefforts (e.g., domain-specific fine-tuning, RAG optimization, or specialized\nprompt engineering), ultimately facilitating progress toward more intelligent\nsolutions within civil aviation maintenance. Our work addresses a significant\ngap in the current LLM evaluation, which primarily focuses on mathematical and\ncoding reasoning tasks. In addition, given that Retrieval-Augmented Generation\n(RAG) systems are currently the dominant solutions in practical applications ,\nwe leverage this benchmark to evaluate existing well-known vector embedding\nmodels and LLMs for civil aviation maintenance scenarios. Through experimental\nexploration and analysis, we demonstrate the effectiveness of our benchmark in\nassessing model performance within this domain, and we open-source this\nevaluation benchmark and code to foster further research and\ndevelopment:https://github.com/CamBenchmark/cambenchmark"}
{"id": "2501.10977", "pdf": "https://arxiv.org/pdf/2501.10977.pdf", "abs": "https://arxiv.org/abs/2501.10977", "title": "SMARTe-VR: Student Monitoring and Adaptive Response Technology for e-Learning in Virtual Reality", "authors": ["Roberto Daza", "Lin Shengkai", "Aythami Morales", "Julian Fierrez", "Katashi Nagao"], "categories": ["cs.HC", "cs.CV"], "comment": "10 pages, 3 figures. Published in ACM Intl. Conf. on Multimedia\n  Workshops (ACM MM Workshops 2025, I2M-MM 25). Also presented at IEEE/CVF\n  Conf. on Computer Vision and Pattern Recognition Workshops (CVPRW) and AAAI\n  Workshop on Artificial Intelligence for Education (AI4EDU)", "summary": "This work introduces SMARTe-VR, a platform for student monitoring in an\nimmersive virtual reality environment designed for online education. SMARTe-VR\naims to collect data for adaptive learning, focusing on facial biometrics and\nlearning metadata. The platform allows instructors to create customized\nlearning sessions with video lectures, featuring an interface with an AutoQA\nsystem to evaluate understanding, interaction tools (for example, textbook\nhighlighting and lecture tagging), and real-time feedback. Furthermore, we\nreleased a dataset that contains 5 research challenges with data from 10 users\nin VR-based TOEIC sessions. This data set, which spans more than 25 hours,\nincludes facial features, learning metadata, 450 responses, difficulty levels\nof the questions, concept tags, and understanding labels. Alongside the\ndatabase, we present preliminary experiments using Item Response Theory models,\nadapted for understanding detection using facial features. Two architectures\nwere explored: a Temporal Convolutional Network for local features and a\nMultilayer Perceptron for global features."}
{"id": "2508.20442", "pdf": "https://arxiv.org/pdf/2508.20442.pdf", "abs": "https://arxiv.org/abs/2508.20442", "title": "Searching the Title of Practical Work of the Informatics Engineering Bachelor Program with the Case Base Reasoning Method", "authors": ["Agung Sukrisna Jaya", "Osvari Arsalan", "Danny Matthew Saputra"], "categories": ["cs.CL"], "comment": null, "summary": "Case Base Reasoning (CBR) is a case solving technique based on experience in\ncases that have occurred before with the highest similarity. CBR is used to\nsearch for practical work titles. TF-IDF is applied to process the\nvectorization of each practical work title word and Cosine Similarity for the\ncalculation of similarity values. This system can search either in the form of\ntitles or keywords. The output of the system is the title of practical work and\nthe match value of each title. Based on the test results using 705 practical\nwork titles, testing was carried out with five titles and carried out in two\nstages. The first stage searches with existing titles and the second stage\nrandomizes the title from the first stage. And the results obtained in the\nsecond stage are the same number of titles found and the highest average match\nscore."}
{"id": "2505.24126", "pdf": "https://arxiv.org/pdf/2505.24126.pdf", "abs": "https://arxiv.org/abs/2505.24126", "title": "From Tutor to Confidant: Use Genres and Moral Economy in Student ChatGPT Domestication", "authors": ["Tawfiq Ammari", "Meilun Chen", "S M Mehedi Zaman", "Kiran Garimella"], "categories": ["cs.HC"], "comment": null, "summary": "Students domesticate ChatGPT through five distinct use genres that transform\nconversational AI from general-purpose tool into specialized academic resources\nwithin the moral economy of student life. Analyzing over 2,600 prompts from 36\nundergraduates, we identify how students exercise agency in constructing fluid\nAI relationships positioning ChatGPT variously as academic workhorse, emotional\ncompanion, metacognitive partner, and breakdown repair system. Drawing on\ndomestication theory and Bakardjieva's use genres framework, we reveal\nconversational domestication as ongoing relational negotiation rather than\none-time appropriation. Students develop sophisticated repair literacies,\nengage in parasocial bonding, and demonstrate epistemic vigilance while\nnavigating institutional expectations around appropriate AI use. These findings\nchallenge instrumental framings of human-AI interaction by revealing the\nemotional labor, trust calibration, and identity work involved in algorithmic\nrelationships. Our analysis contributes to understanding how students\nappropriate emerging media technologies through creative bricolage within\nacademic contexts, extending domestication theory to conversational AI systems."}
{"id": "2508.20453", "pdf": "https://arxiv.org/pdf/2508.20453.pdf", "abs": "https://arxiv.org/abs/2508.20453", "title": "MCP-Bench: Benchmarking Tool-Using LLM Agents with Complex Real-World Tasks via MCP Servers", "authors": ["Zhenting Wang", "Qi Chang", "Hemani Patel", "Shashank Biju", "Cheng-En Wu", "Quan Liu", "Aolin Ding", "Alireza Rezazadeh", "Ankit Shah", "Yujia Bao", "Eugene Siow"], "categories": ["cs.CL"], "comment": null, "summary": "We introduce MCP-Bench, a benchmark for evaluating large language models\n(LLMs) on realistic, multi-step tasks that demand tool use, cross-tool\ncoordination, precise parameter control, and planning/reasoning for solving\ntasks. Built on the Model Context Protocol (MCP), MCP-Bench connects LLMs to 28\nrepresentative live MCP servers spanning 250 tools across domains such as\nfinance, traveling, scientific computing, and academic search. Unlike prior\nAPI-based benchmarks, each MCP server provides a set of complementary tools\ndesigned to work together, enabling the construction of authentic, multi-step\ntasks with rich input-output coupling. Tasks in MCP-Bench test agents' ability\nto retrieve relevant tools from fuzzy instructions without explicit tool names,\nplan multi-hop execution trajectories for complex objectives, ground responses\nin intermediate tool outputs, and orchestrate cross-domain workflows -\ncapabilities not adequately evaluated by existing benchmarks that rely on\nexplicit tool specifications, shallow few-step workflows, and isolated domain\noperations. We propose a multi-faceted evaluation framework covering tool-level\nschema understanding and usage, trajectory-level planning, and task completion.\nExperiments on 20 advanced LLMs reveal persistent challenges in MCP-Bench. Code\nand data: https://github.com/Accenture/mcp-bench."}
{"id": "2507.18638", "pdf": "https://arxiv.org/pdf/2507.18638.pdf", "abs": "https://arxiv.org/abs/2507.18638", "title": "Prompt Engineering and the Effectiveness of Large Language Models in Enhancing Human Productivity", "authors": ["Rizal Khoirul Anam"], "categories": ["cs.HC", "cs.AI", "68T50 68T50 68T50", "I.2.7"], "comment": "38 pages, 15 tables, 5 figures. Submitted as a research paper draft\n  for arXiv. Based on survey data collected in 2025", "summary": "The widespread adoption of large language models (LLMs) such as ChatGPT,\nGemini, and DeepSeek has significantly changed how people approach tasks in\neducation, professional work, and creative domains. This paper investigates how\nthe structure and clarity of user prompts impact the effectiveness and\nproductivity of LLM outputs. Using data from 243 survey respondents across\nvarious academic and occupational backgrounds, we analyze AI usage habits,\nprompting strategies, and user satisfaction. The results show that users who\nemploy clear, structured, and context-aware prompts report higher task\nefficiency and better outcomes. These findings emphasize the essential role of\nprompt engineering in maximizing the value of generative AI and provide\npractical implications for its everyday use."}
{"id": "2508.20460", "pdf": "https://arxiv.org/pdf/2508.20460.pdf", "abs": "https://arxiv.org/abs/2508.20460", "title": "Prediction of mortality and resource utilization in critical care: a deep learning approach using multimodal electronic health records with natural language processing techniques", "authors": ["Yucheng Ruan", "Xiang Lan", "Daniel J. Tan", "Hairil Rizal Abdullah", "Mengling Feng"], "categories": ["cs.CL"], "comment": null, "summary": "Background Predicting mortality and resource utilization from electronic\nhealth records (EHRs) is challenging yet crucial for optimizing patient\noutcomes and managing costs in intensive care unit (ICU). Existing approaches\npredominantly focus on structured EHRs, often ignoring the valuable clinical\ninsights in free-text notes. Additionally, the potential of textual information\nwithin structured data is not fully leveraged. This study aimed to introduce\nand assess a deep learning framework using natural language processing\ntechniques that integrates multimodal EHRs to predict mortality and resource\nutilization in critical care settings. Methods Utilizing two real-world EHR\ndatasets, we developed and evaluated our model on three clinical tasks with\nleading existing methods. We also performed an ablation study on three key\ncomponents in our framework: medical prompts, free-texts, and pre-trained\nsentence encoder. Furthermore, we assessed the model's robustness against the\ncorruption in structured EHRs. Results Our experiments on two real-world\ndatasets across three clinical tasks showed that our proposed model improved\nperformance metrics by 1.6\\%/0.8\\% on BACC/AUROC for mortality prediction,\n0.5%/2.2% on RMSE/MAE for LOS prediction, 10.9%/11.0% on RMSE/MAE for surgical\nduration estimation compared to the best existing methods. It consistently\ndemonstrated superior performance compared to other baselines across three\ntasks at different corruption rates. Conclusions The proposed framework is an\neffective and accurate deep learning approach for predicting mortality and\nresource utilization in critical care. The study also highlights the success of\nusing prompt learning with a transformer encoder in analyzing multimodal EHRs.\nImportantly, the model showed strong resilience to data corruption within\nstructured data, especially at high corruption levels."}
{"id": "2508.06889", "pdf": "https://arxiv.org/pdf/2508.06889.pdf", "abs": "https://arxiv.org/abs/2508.06889", "title": "Viewpoint-Tolerant Depth Perception for Shared Extended Space Experience on Wall-Sized Display", "authors": ["Dooyoung Kim", "Jinseok Hong", "Heejeong Ko", "Woontack Woo"], "categories": ["cs.HC"], "comment": "11 pages, 5 figures, 3 tables, Accepted in TVCG Special Issue on the\n  2025 IEEE Symposium on Mixed and Augmented Reality (IEEE ISMAR)", "summary": "We proposed viewpoint-tolerant shared depth perception without individual\ntracking by leveraging human cognitive compensation in universally 3D rendered\nimages on a wall-sized display. While traditional 3D perception-enabled display\nsystems have primarily focused on single-user scenarios-adapting rendering\nbased on head and eye tracking the use of wall-sized displays to extend spatial\nexperiences and support perceptually coherent multi-user interactions remains\nunderexplored. We investigated the effects of virtual depths (dv) and absolute\nviewing distance (da) on human cognitive compensation factors (perceived\ndistance difference, viewing angle threshold, and perceived presence) to\nconstruct the wall display-based eXtended Reality (XR) space. Results show that\nparticipants experienced a compelling depth perception even from off-center\nangles of 23 to 37 degrees, and largely increasing virtual depth worsens depth\nperception and presence factors, highlighting the importance of balancing\nextended depth of virtual space and viewing distance from the wall-sized\ndisplay. Drawing on these findings, wall-sized displays in venues such as\nmuseums, galleries, and classrooms can evolve beyond 2D information sharing to\noffer immersive, spatially extended group experiences without individualized\ntracking or wearables."}
{"id": "2508.20468", "pdf": "https://arxiv.org/pdf/2508.20468.pdf", "abs": "https://arxiv.org/abs/2508.20468", "title": "ConspirED: A Dataset for Cognitive Traits of Conspiracy Theories and Large Language Model Safety", "authors": ["Luke Bates", "Max Glockner", "Preslav Nakov", "Iryna Gurevych"], "categories": ["cs.CL"], "comment": null, "summary": "Conspiracy theories erode public trust in science and institutions while\nresisting debunking by evolving and absorbing counter-evidence. As AI-generated\nmisinformation becomes increasingly sophisticated, understanding rhetorical\npatterns in conspiratorial content is important for developing interventions\nsuch as targeted prebunking and assessing AI vulnerabilities. We introduce\nConspirED (CONSPIR Evaluation Dataset), which captures the cognitive traits of\nconspiratorial ideation in multi-sentence excerpts (80--120 words) from online\nconspiracy articles, annotated using the CONSPIR cognitive framework\n(Lewandowsky and Cook, 2020). ConspirED is the first dataset of conspiratorial\ncontent annotated for general cognitive traits. Using ConspirED, we (i) develop\ncomputational models that identify conspiratorial traits and determine dominant\ntraits in text excerpts, and (ii) evaluate large language/reasoning model\n(LLM/LRM) robustness to conspiratorial inputs. We find that both are misaligned\nby conspiratorial content, producing output that mirrors input reasoning\npatterns, even when successfully deflecting comparable fact-checked\nmisinformation."}
{"id": "2508.11030", "pdf": "https://arxiv.org/pdf/2508.11030.pdf", "abs": "https://arxiv.org/abs/2508.11030", "title": "Families' Vision of Generative AI Agents for Household Safety Against Digital and Physical Threats", "authors": ["Zikai Wen", "Lanjing Liu", "Yaxing Yao"], "categories": ["cs.HC"], "comment": "Accepted in Proc. ACM Hum.-Comput. Interact. 9, 7, Article CSCW", "summary": "As families face increasingly complex safety challenges in digital and\nphysical environments, generative AI (GenAI) presents new opportunities to\nsupport household safety through multiple specialized AI agents. Through a\ntwo-phase qualitative study consisting of individual interviews and\ncollaborative sessions with 13 parent-child dyads, we explored families'\nconceptualizations of GenAI and their envisioned use of AI agents in daily\nfamily life. Our findings reveal that families preferred to distribute\nsafety-related support across multiple AI agents, each embodying a familiar\ncaregiving role: a household manager coordinating routine tasks and mitigating\nrisks such as digital fraud and home accidents; a private tutor providing\npersonalized educational support, including safety education; and a family\ntherapist offering emotional support to address sensitive safety issues such as\ncyberbullying and digital harassment. Families emphasized the need for\nagent-specific privacy boundaries, recognized generational differences in trust\ntoward AI agents, and stressed the importance of maintaining open family\ncommunication alongside the assistance of AI agents. Based on these findings,\nwe propose a multi-agent system design featuring four privacy-preserving\nprinciples: memory segregation, conversational consent, selective data sharing,\nand progressive memory management to help balance safety, privacy, and autonomy\nwithin family contexts."}
{"id": "2508.20511", "pdf": "https://arxiv.org/pdf/2508.20511.pdf", "abs": "https://arxiv.org/abs/2508.20511", "title": "Languages Still Left Behind: Toward a Better Multilingual Machine Translation Benchmark", "authors": ["Chihiro Taguchi", "Seng Mai", "Keita Kurabe", "Yusuke Sakai", "Georgina Agyei", "Soudabeh Eslami", "David Chiang"], "categories": ["cs.CL", "cs.AI"], "comment": "13 pages, 7 tables, 2 figures. Accepted at EMNLP Main 2025. Code and\n  data released at https://github.com/ctaguchi/LSLB", "summary": "Multilingual machine translation (MT) benchmarks play a central role in\nevaluating the capabilities of modern MT systems. Among them, the FLORES+\nbenchmark is widely used, offering English-to-many translation data for over\n200 languages, curated with strict quality control protocols. However, we study\ndata in four languages (Asante Twi, Japanese, Jinghpaw, and South Azerbaijani)\nand uncover critical shortcomings in the benchmark's suitability for truly\nmultilingual evaluation. Human assessments reveal that many translations fall\nbelow the claimed 90% quality standard, and the annotators report that source\nsentences are often too domain-specific and culturally biased toward the\nEnglish-speaking world. We further demonstrate that simple heuristics, such as\ncopying named entities, can yield non-trivial BLEU scores, suggesting\nvulnerabilities in the evaluation protocol. Notably, we show that MT models\ntrained on high-quality, naturalistic data perform poorly on FLORES+ while\nachieving significant gains on our domain-relevant evaluation set. Based on\nthese findings, we advocate for multilingual MT benchmarks that use\ndomain-general and culturally neutral source texts rely less on named entities,\nin order to better reflect real-world translation challenges."}
{"id": "2508.16599", "pdf": "https://arxiv.org/pdf/2508.16599.pdf", "abs": "https://arxiv.org/abs/2508.16599", "title": "Humans Perceive Wrong Narratives from AI Reasoning Texts", "authors": ["Mosh Levy", "Zohar Elyoseph", "Yoav Goldberg"], "categories": ["cs.HC", "cs.AI", "cs.CL"], "comment": null, "summary": "A new generation of AI models generates step-by-step reasoning text before\nproducing an answer. This text appears to offer a human-readable window into\ntheir computation process, and is increasingly relied upon for transparency and\ninterpretability. However, it is unclear whether human understanding of this\ntext matches the model's actual computational process. In this paper, we\ninvestigate a necessary condition for correspondence: the ability of humans to\nidentify which steps in a reasoning text causally influence later steps. We\nevaluated humans on this ability by composing questions based on counterfactual\nmeasurements and found a significant discrepancy: participant accuracy was only\n29%, barely above chance (25%), and remained low (42%) even when evaluating the\nmajority vote on questions with high agreement. Our results reveal a\nfundamental gap between how humans interpret reasoning texts and how models use\nit, challenging its utility as a simple interpretability tool. We argue that\nreasoning texts should be treated as an artifact to be investigated, not taken\nat face value, and that understanding the non-human ways these models use\nlanguage is a critical research direction."}
{"id": "2508.20514", "pdf": "https://arxiv.org/pdf/2508.20514.pdf", "abs": "https://arxiv.org/abs/2508.20514", "title": "SciTopic: Enhancing Topic Discovery in Scientific Literature through Advanced LLM", "authors": ["Pengjiang Li", "Zaitian Wang", "Xinhao Zhang", "Ran Zhang", "Lu Jiang", "Pengfei Wang", "Yuanchun Zhou"], "categories": ["cs.CL"], "comment": null, "summary": "Topic discovery in scientific literature provides valuable insights for\nresearchers to identify emerging trends and explore new avenues for\ninvestigation, facilitating easier scientific information retrieval. Many\nmachine learning methods, particularly deep embedding techniques, have been\napplied to discover research topics. However, most existing topic discovery\nmethods rely on word embedding to capture the semantics and lack a\ncomprehensive understanding of scientific publications, struggling with\ncomplex, high-dimensional text relationships. Inspired by the exceptional\ncomprehension of textual information by large language models (LLMs), we\npropose an advanced topic discovery method enhanced by LLMs to improve\nscientific topic identification, namely SciTopic. Specifically, we first build\na textual encoder to capture the content from scientific publications,\nincluding metadata, title, and abstract. Next, we construct a space\noptimization module that integrates entropy-based sampling and triplet tasks\nguided by LLMs, enhancing the focus on thematic relevance and contextual\nintricacies between ambiguous instances. Then, we propose to fine-tune the\ntextual encoder based on the guidance from the LLMs by optimizing the\ncontrastive loss of the triplets, forcing the text encoder to better\ndiscriminate instances of different topics. Finally, extensive experiments\nconducted on three real-world datasets of scientific publications demonstrate\nthat SciTopic outperforms the state-of-the-art (SOTA) scientific topic\ndiscovery methods, enabling researchers to gain deeper and faster insights."}
{"id": "2508.17362", "pdf": "https://arxiv.org/pdf/2508.17362.pdf", "abs": "https://arxiv.org/abs/2508.17362", "title": "Virtual Reality in Sign Language Education: Opportunities, Challenges, and the Road Ahead", "authors": ["Santiago Berrezueta-Guzman", "Refia Daya", "Stefan Wagner"], "categories": ["cs.HC"], "comment": "Paper submitted to Frontiers in Virtual Reality", "summary": "Sign language (SL) is an essential mode of communication for Deaf and\nHard-of-Hearing (DHH) individuals. Its education remains limited by the lack of\nqualified instructors, insufficient early exposure, and the inadequacy of\ntraditional teaching methods. Recent advances in Virtual Reality (VR) and\nArtificial Intelligence (AI) offer promising new approaches to enhance sign\nlanguage learning through immersive, interactive, and feedback-rich\nenvironments. This paper presents a systematic review of 55 peer-reviewed\nstudies on VR-based sign language education, identifying and analyzing five\ncore thematic areas: (1) gesture recognition and real-time feedback mechanisms;\n(2) interactive VR environments for communicative practice; (3) gamification\nfor immersive and motivating learning experiences; (4) personalized and\nadaptive learning systems; and (5) accessibility and inclusivity for diverse\nDHH learners.\n  The results reveal that AI-driven gesture recognition systems integrated with\nVR can provide real-time feedback, significantly improving learner engagement\nand performance. However, the analysis highlights critical challenges: hardware\nlimitations, inconsistent accuracy in gesture recognition, and a lack of\ninclusive and adaptive design. This review contributes a comprehensive\nsynthesis of technological and pedagogical innovations in the field, outlining\ncurrent limitations and proposing actionable recommendations for developers and\nresearchers. By bridging technical advancement with inclusive pedagogy, this\nreview lays the foundation for next-generation VR systems that are equitable,\neffective, and accessible for sign language learners worldwide."}
{"id": "2508.20532", "pdf": "https://arxiv.org/pdf/2508.20532.pdf", "abs": "https://arxiv.org/abs/2508.20532", "title": "Overview of BioASQ 2024: The twelfth BioASQ challenge on Large-Scale Biomedical Semantic Indexing and Question Answering", "authors": ["Anastasios Nentidis", "Georgios Katsimpras", "Anastasia Krithara", "Salvador Lima-Lpez", "Eullia Farr-Maduell", "Martin Krallinger", "Natalia Loukachevitch", "Vera Davydova", "Elena Tutubalina", "Georgios Paliouras"], "categories": ["cs.CL", "cs.AI", "cs.IR"], "comment": "25 pages, 16 tables, 1 figure", "summary": "This is an overview of the twelfth edition of the BioASQ challenge in the\ncontext of the Conference and Labs of the Evaluation Forum (CLEF) 2024. BioASQ\nis a series of international challenges promoting advances in large-scale\nbiomedical semantic indexing and question answering. This year, BioASQ\nconsisted of new editions of the two established tasks b and Synergy, and two\nnew tasks: a) MultiCardioNER on the adaptation of clinical entity detection to\nthe cardiology domain in a multilingual setting, and b) BIONNE on nested NER in\nRussian and English. In this edition of BioASQ, 37 competing teams participated\nwith more than 700 distinct submissions in total for the four different shared\ntasks of the challenge. Similarly to previous editions, most of the\nparticipating systems achieved competitive performance, suggesting the\ncontinuous advancement of the state-of-the-art in the field."}
{"id": "2508.20554", "pdf": "https://arxiv.org/pdf/2508.20554.pdf", "abs": "https://arxiv.org/abs/2508.20554", "title": "Overview of BioASQ 2025: The Thirteenth BioASQ Challenge on Large-Scale Biomedical Semantic Indexing and Question Answering", "authors": ["Anastasios Nentidis", "Georgios Katsimpras", "Anastasia Krithara", "Martin Krallinger", "Miguel Rodrguez-Ortega", "Eduard Rodriguez-Lpez", "Natalia Loukachevitch", "Andrey Sakhovskiy", "Elena Tutubalina", "Dimitris Dimitriadis", "Grigorios Tsoumakas", "George Giannakoulas", "Alexandra Bekiaridou", "Athanasios Samaras", "Giorgio Maria Di Nunzio", "Nicola Ferro", "Stefano Marchesin", "Marco Martinelli", "Gianmaria Silvello", "Georgios Paliouras"], "categories": ["cs.CL", "cs.AI", "cs.IR"], "comment": "26 pages, 17 tables, 1 figure", "summary": "This is an overview of the thirteenth edition of the BioASQ challenge in the\ncontext of the Conference and Labs of the Evaluation Forum (CLEF) 2025. BioASQ\nis a series of international challenges promoting advances in large-scale\nbiomedical semantic indexing and question answering. This year, BioASQ\nconsisted of new editions of the two established tasks, b and Synergy, and four\nnew tasks: a) Task MultiClinSum on multilingual clinical summarization. b) Task\nBioNNE-L on nested named entity linking in Russian and English. c) Task\nELCardioCC on clinical coding in cardiology. d) Task GutBrainIE on gut-brain\ninterplay information extraction. In this edition of BioASQ, 83 competing teams\nparticipated with more than 1000 distinct submissions in total for the six\ndifferent shared tasks of the challenge. Similar to previous editions, several\nparticipating systems achieved competitive performance, indicating the\ncontinuous advancement of the state-of-the-art in the field."}
{"id": "2508.20557", "pdf": "https://arxiv.org/pdf/2508.20557.pdf", "abs": "https://arxiv.org/abs/2508.20557", "title": "Adaptive Federated Distillation for Multi-Domain Non-IID Textual Data", "authors": ["Jiahao Xiao", "Jiangming Liu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "The widespread success of pre-trained language models has established a new\ntraining paradigm, where a global PLM is fine-tuned using task-specific data\nfrom local clients. The local data are highly different from each other and can\nnot capture the global distribution of the whole data in real world. To address\nthe challenges of non-IID data in real environments, privacy-preserving\nfederated distillation has been proposed and highly investigated. However,\nprevious experimental non-IID scenarios are primarily identified with the label\n(output) diversity, without considering the diversity of language domains\n(input) that is crucial in natural language processing. In this paper, we\nintroduce a comprehensive set of multi-domain non-IID scenarios and propose a\nunified benchmarking framework that includes diverse data. The benchmark can be\nused to evaluate the federated learning framework in a real environment. To\nthis end, we propose an Adaptive Federated Distillation (AdaFD) framework\ndesigned to address multi-domain non-IID challenges in both homogeneous and\nheterogeneous settings. Experimental results demonstrate that our models\ncapture the diversity of local clients and achieve better performance compared\nto the existing works. The code for this paper is available at:\nhttps://github.com/jiahaoxiao1228/AdaFD."}
{"id": "2508.20559", "pdf": "https://arxiv.org/pdf/2508.20559.pdf", "abs": "https://arxiv.org/abs/2508.20559", "title": "Leveraging Generative Models for Real-Time Query-Driven Text Summarization in Large-Scale Web Search", "authors": ["Zeyu Xiong", "Yixuan Nan", "Li Gao", "Hengzhu Tang", "Shuaiqiang Wang", "Junfeng Wang", "Dawei Yin"], "categories": ["cs.CL", "cs.IR"], "comment": "CIKM'25", "summary": "In the dynamic landscape of large-scale web search, Query-Driven Text\nSummarization (QDTS) aims to generate concise and informative summaries from\ntextual documents based on a given query, which is essential for improving user\nengagement and facilitating rapid decision-making. Traditional extractive\nsummarization models, based primarily on ranking candidate summary segments,\nhave been the dominant approach in industrial applications. However, these\napproaches suffer from two key limitations: 1) The multi-stage pipeline often\nintroduces cumulative information loss and architectural bottlenecks due to its\nweakest component; 2) Traditional models lack sufficient semantic understanding\nof both user queries and documents, particularly when dealing with complex\nsearch intents. In this study, we propose a novel framework to pioneer the\napplication of generative models to address real-time QDTS in industrial web\nsearch. Our approach integrates large model distillation, supervised\nfine-tuning, direct preference optimization, and lookahead decoding to\ntransform a lightweight model with only 0.1B parameters into a\ndomain-specialized QDTS expert. Evaluated on multiple industry-relevant\nmetrics, our model outperforms the production baseline and achieves a new state\nof the art. Furthermore, it demonstrates excellent deployment efficiency,\nrequiring only 334 NVIDIA L20 GPUs to handle \\textasciitilde50,000 queries per\nsecond under 55~ms average latency per query."}
{"id": "2508.20567", "pdf": "https://arxiv.org/pdf/2508.20567.pdf", "abs": "https://arxiv.org/abs/2508.20567", "title": "KCS: Diversify Multi-hop Question Generation with Knowledge Composition Sampling", "authors": ["Yangfan Wang", "Jie Liu", "Chen Tang", "Lian Yan", "Jingchi Jiang"], "categories": ["cs.CL"], "comment": null, "summary": "Multi-hop question answering faces substantial challenges due to data\nsparsity, which increases the likelihood of language models learning spurious\npatterns. To address this issue, prior research has focused on diversifying\nquestion generation through content planning and varied expression. However,\nthese approaches often emphasize generating simple questions and neglect the\nintegration of essential knowledge, such as relevant sentences within\ndocuments. This paper introduces the Knowledge Composition Sampling (KCS), an\ninnovative framework designed to expand the diversity of generated multi-hop\nquestions by sampling varied knowledge compositions within a given context. KCS\nmodels the knowledge composition selection as a sentence-level conditional\nprediction task and utilizes a probabilistic contrastive loss to predict the\nnext most relevant piece of knowledge. During inference, we employ a stochastic\ndecoding strategy to effectively balance accuracy and diversity. Compared to\ncompetitive baselines, our KCS improves the overall accuracy of knowledge\ncomposition selection by 3.9%, and its application for data augmentation yields\nimprovements on HotpotQA and 2WikiMultihopQA datasets. Our code is available\nat: https://github.com/yangfanww/kcs."}
{"id": "2508.20583", "pdf": "https://arxiv.org/pdf/2508.20583.pdf", "abs": "https://arxiv.org/abs/2508.20583", "title": "A Graph Talks, But Who's Listening? Rethinking Evaluations for Graph-Language Models", "authors": ["Soham Petkar", "Hari Aakash K", "Anirudh Vempati", "Akshit Sinha", "Ponnurangam Kumarauguru", "Chirag Agarwal"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Developments in Graph-Language Models (GLMs) aim to integrate the structural\nreasoning capabilities of Graph Neural Networks (GNNs) with the semantic\nunderstanding of Large Language Models (LLMs). However, we demonstrate that\ncurrent evaluation benchmarks for GLMs, which are primarily repurposed\nnode-level classification datasets, are insufficient to assess multimodal\nreasoning. Our analysis reveals that strong performance on these benchmarks is\nachievable using unimodal information alone, suggesting that they do not\nnecessitate graph-language integration. To address this evaluation gap, we\nintroduce the CLEGR(Compositional Language-Graph Reasoning) benchmark, designed\nto evaluate multimodal reasoning at various complexity levels. Our benchmark\nemploys a synthetic graph generation pipeline paired with questions that\nrequire joint reasoning over structure and textual semantics. We perform a\nthorough evaluation of representative GLM architectures and find that\nsoft-prompted LLM baselines perform on par with GLMs that incorporate a full\nGNN backbone. This result calls into question the architectural necessity of\nincorporating graph structure into LLMs. We further show that GLMs exhibit\nsignificant performance degradation in tasks that require structural reasoning.\nThese findings highlight limitations in the graph reasoning capabilities of\ncurrent GLMs and provide a foundation for advancing the community toward\nexplicit multimodal reasoning involving graph structure and language."}
{"id": "2508.20700", "pdf": "https://arxiv.org/pdf/2508.20700.pdf", "abs": "https://arxiv.org/abs/2508.20700", "title": "Generative Annotation for ASR Named Entity Correction", "authors": ["Yuanchang Luo", "Daimeng Wei", "Shaojun Li", "Hengchao Shang", "Jiaxin Guo", "Zongyao Li", "Zhanglin Wu", "Xiaoyu Chen", "Zhiqiang Rao", "Jinlong Yang", "Hao Yang"], "categories": ["cs.CL", "cs.AI"], "comment": "12 pages, 7 figures, 7 tables, EMNLP 2025", "summary": "End-to-end automatic speech recognition systems often fail to transcribe\ndomain-specific named entities, causing catastrophic failures in downstream\ntasks. Numerous fast and lightweight named entity correction (NEC) models have\nbeen proposed in recent years. These models, mainly leveraging phonetic-level\nedit distance algorithms, have shown impressive performances. However, when the\nforms of the wrongly-transcribed words(s) and the ground-truth entity are\nsignificantly different, these methods often fail to locate the wrongly\ntranscribed words in hypothesis, thus limiting their usage. We propose a novel\nNEC method that utilizes speech sound features to retrieve candidate entities.\nWith speech sound features and candidate entities, we inovatively design a\ngenerative method to annotate entity errors in ASR transcripts and replace the\ntext with correct entities. This method is effective in scenarios of word form\ndifference. We test our method using open-source and self-constructed test\nsets. The results demonstrate that our NEC method can bring significant\nimprovement to entity accuracy. We will open source our self-constructed test\nset and training data."}
{"id": "2508.20712", "pdf": "https://arxiv.org/pdf/2508.20712.pdf", "abs": "https://arxiv.org/abs/2508.20712", "title": "Multi-Lingual Implicit Discourse Relation Recognition with Multi-Label Hierarchical Learning", "authors": ["Nelson Filipe Costa", "Leila Kosseim"], "categories": ["cs.CL"], "comment": "Published at SIGDIAL 2025. Best paper award", "summary": "This paper introduces the first multi-lingual and multi-label classification\nmodel for implicit discourse relation recognition (IDRR). Our model, HArch, is\nevaluated on the recently released DiscoGeM 2.0 corpus and leverages\nhierarchical dependencies between discourse senses to predict probability\ndistributions across all three sense levels in the PDTB 3.0 framework. We\ncompare several pre-trained encoder backbones and find that RoBERTa-HArch\nachieves the best performance in English, while XLM-RoBERTa-HArch performs best\nin the multi-lingual setting. In addition, we compare our fine-tuned models\nagainst GPT-4o and Llama-4-Maverick using few-shot prompting across all\nlanguage configurations. Our results show that our fine-tuned models\nconsistently outperform these LLMs, highlighting the advantages of\ntask-specific fine-tuning over prompting in IDRR. Finally, we report SOTA\nresults on the DiscoGeM 1.0 corpus, further validating the effectiveness of our\nhierarchical approach."}
{"id": "2508.20718", "pdf": "https://arxiv.org/pdf/2508.20718.pdf", "abs": "https://arxiv.org/abs/2508.20718", "title": "Addressing Tokenization Inconsistency in Steganography and Watermarking Based on Large Language Models", "authors": ["Ruiyi Yan", "Yugo Murawaki"], "categories": ["cs.CL"], "comment": null, "summary": "Large language models have significantly enhanced the capacities and\nefficiency of text generation. On the one hand, they have improved the quality\nof text-based steganography. On the other hand, they have also underscored the\nimportance of watermarking as a safeguard against malicious misuse. In this\nstudy, we focus on tokenization inconsistency (TI) between Alice and Bob in\nsteganography and watermarking, where TI can undermine robustness. Our\ninvestigation reveals that the problematic tokens responsible for TI exhibit\ntwo key characteristics: infrequency and temporariness. Based on these\nfindings, we propose two tailored solutions for TI elimination: a stepwise\nverification method for steganography and a post-hoc rollback method for\nwatermarking. Experiments show that (1) compared to traditional disambiguation\nmethods in steganography, directly addressing TI leads to improvements in\nfluency, imperceptibility, and anti-steganalysis capacity; (2) for\nwatermarking, addressing TI enhances detectability and robustness against\nattacks."}
{"id": "2508.20722", "pdf": "https://arxiv.org/pdf/2508.20722.pdf", "abs": "https://arxiv.org/abs/2508.20722", "title": "rStar2-Agent: Agentic Reasoning Technical Report", "authors": ["Ning Shang", "Yifei Liu", "Yi Zhu", "Li Lyna Zhang", "Weijiang Xu", "Xinyu Guan", "Buze Zhang", "Bingcheng Dong", "Xudong Zhou", "Bowen Zhang", "Ying Xin", "Ziming Miao", "Scarlett Li", "Fan Yang", "Mao Yang"], "categories": ["cs.CL"], "comment": null, "summary": "We introduce rStar2-Agent, a 14B math reasoning model trained with agentic\nreinforcement learning to achieve frontier-level performance. Beyond current\nlong CoT, the model demonstrates advanced cognitive behaviors, such as thinking\ncarefully before using Python coding tools and reflecting on code execution\nfeedback to autonomously explore, verify, and refine intermediate steps in\ncomplex problem-solving. This capability is enabled through three key\ninnovations that makes agentic RL effective at scale: (i) an efficient RL\ninfrastructure with a reliable Python code environment that supports\nhigh-throughput execution and mitigates the high rollout costs, enabling\ntraining on limited GPU resources (64 MI300X GPUs); (ii) GRPO-RoC, an agentic\nRL algorithm with a Resample-on-Correct rollout strategy that addresses the\ninherent environment noises from coding tools, allowing the model to reason\nmore effectively in a code environment; (iii) An efficient agent training\nrecipe that starts with non-reasoning SFT and progresses through multi-RL\nstages, yielding advanced cognitive abilities with minimal compute cost. To\nthis end, rStar2-Agent boosts a pre-trained 14B model to state of the art in\nonly 510 RL steps within one week, achieving average pass@1 scores of 80.6% on\nAIME24 and 69.8% on AIME25, surpassing DeepSeek-R1 (671B) with significantly\nshorter responses. Beyond mathematics, rStar2-Agent-14B also demonstrates\nstrong generalization to alignment, scientific reasoning, and agentic tool-use\ntasks. Code and training recipes are available at\nhttps://github.com/microsoft/rStar."}
{"id": "2508.20736", "pdf": "https://arxiv.org/pdf/2508.20736.pdf", "abs": "https://arxiv.org/abs/2508.20736", "title": "Leveraging Semantic Triples for Private Document Generation with Local Differential Privacy Guarantees", "authors": ["Stephen Meisenbacher", "Maulik Chevli", "Florian Matthes"], "categories": ["cs.CL"], "comment": "17 pages, 2 figures, 11 tables. Accepted to EMNLP 2025 (Main)", "summary": "Many works at the intersection of Differential Privacy (DP) in Natural\nLanguage Processing aim to protect privacy by transforming texts under DP\nguarantees. This can be performed in a variety of ways, from word perturbations\nto full document rewriting, and most often under local DP. Here, an input text\nmust be made indistinguishable from any other potential text, within some bound\ngoverned by the privacy parameter $\\varepsilon$. Such a guarantee is quite\ndemanding, and recent works show that privatizing texts under local DP can only\nbe done reasonably under very high $\\varepsilon$ values. Addressing this\nchallenge, we introduce DP-ST, which leverages semantic triples for\nneighborhood-aware private document generation under local DP guarantees.\nThrough the evaluation of our method, we demonstrate the effectiveness of the\ndivide-and-conquer paradigm, particularly when limiting the DP notion (and\nprivacy guarantees) to that of a privatization neighborhood. When combined with\nLLM post-processing, our method allows for coherent text generation even at\nlower $\\varepsilon$ values, while still balancing privacy and utility. These\nfindings highlight the importance of coherence in achieving balanced\nprivatization outputs at reasonable $\\varepsilon$ levels."}
{"id": "2508.20750", "pdf": "https://arxiv.org/pdf/2508.20750.pdf", "abs": "https://arxiv.org/abs/2508.20750", "title": "Specializing General-purpose LLM Embeddings for Implicit Hate Speech Detection across Datasets", "authors": ["Vassiliy Cheremetiev", "Quang Long Ho Ngo", "Chau Ying Kot", "Alina Elena Baia", "Andrea Cavallaro"], "categories": ["cs.CL"], "comment": "Paper accepted at the DHOW Workshop at ACM Multimedia 2025. Code\n  available at https://github.com/idiap/implicit-hsd", "summary": "Implicit hate speech (IHS) is indirect language that conveys prejudice or\nhatred through subtle cues, sarcasm or coded terminology. IHS is challenging to\ndetect as it does not include explicit derogatory or inflammatory words. To\naddress this challenge, task-specific pipelines can be complemented with\nexternal knowledge or additional information such as context, emotions and\nsentiment data. In this paper, we show that, by solely fine-tuning recent\ngeneral-purpose embedding models based on large language models (LLMs), such as\nStella, Jasper, NV-Embed and E5, we achieve state-of-the-art performance.\nExperiments on multiple IHS datasets show up to 1.10 percentage points\nimprovements for in-dataset, and up to 20.35 percentage points improvements in\ncross-dataset evaluation, in terms of F1-macro score."}
{"id": "2508.20757", "pdf": "https://arxiv.org/pdf/2508.20757.pdf", "abs": "https://arxiv.org/abs/2508.20757", "title": "GUARD: Glocal Uncertainty-Aware Robust Decoding for Effective and Efficient Open-Ended Text Generation", "authors": ["Yuanhao Ding", "Esteban Garces Arias", "Meimingwei Li", "Julian Rodemann", "Matthias Aenmacher", "Danlu Chen", "Gaojuan Fan", "Christian Heumann", "Chongsheng Zhang"], "categories": ["cs.CL"], "comment": "Accepted at Findings of the Association for Computational\n  Linguistics: EMNLP (Findings) 2025", "summary": "Open-ended text generation faces a critical challenge: balancing coherence\nwith diversity in LLM outputs. While contrastive search-based decoding\nstrategies have emerged to address this trade-off, their practical utility is\noften limited by hyperparameter dependence and high computational costs. We\nintroduce GUARD, a self-adaptive decoding method that effectively balances\nthese competing objectives through a novel \"Glocal\" uncertainty-driven\nframework. GUARD combines global entropy estimates with local entropy\ndeviations to integrate both long-term and short-term uncertainty signals. We\ndemonstrate that our proposed global entropy formulation effectively mitigates\nabrupt variations in uncertainty, such as sudden overconfidence or high entropy\nspikes, and provides theoretical guarantees of unbiasedness and consistency. To\nreduce computational overhead, we incorporate a simple yet effective\ntoken-count-based penalty into GUARD. Experimental results demonstrate that\nGUARD achieves a good balance between text diversity and coherence, while\nexhibiting substantial improvements in generation speed. In a more nuanced\ncomparison study across different dimensions of text quality, both human and\nLLM evaluators validated its remarkable performance. Our code is available at\nhttps://github.com/YecanLee/GUARD."}
{"id": "2508.20764", "pdf": "https://arxiv.org/pdf/2508.20764.pdf", "abs": "https://arxiv.org/abs/2508.20764", "title": "Feel the Difference? A Comparative Analysis of Emotional Arcs in Real and LLM-Generated CBT Sessions", "authors": ["Xiaoyi Wang", "Jiwei Zhang", "Guangtao Zhang", "Honglei Guo"], "categories": ["cs.CL"], "comment": "Accepted at EMNLP 2025,14 page,3 figures", "summary": "Synthetic therapy dialogues generated by large language models (LLMs) are\nincreasingly used in mental health NLP to simulate counseling scenarios, train\nmodels, and supplement limited real-world data. However, it remains unclear\nwhether these synthetic conversations capture the nuanced emotional dynamics of\nreal therapy. In this work, we conduct the first comparative analysis of\nemotional arcs between real and LLM-generated Cognitive Behavioral Therapy\ndialogues. We adapt the Utterance Emotion Dynamics framework to analyze\nfine-grained affective trajectories across valence, arousal, and dominance\ndimensions. Our analysis spans both full dialogues and individual speaker roles\n(counselor and client), using real sessions transcribed from public videos and\nsynthetic dialogues from the CACTUS dataset. We find that while synthetic\ndialogues are fluent and structurally coherent, they diverge from real\nconversations in key emotional properties: real sessions exhibit greater\nemotional variability,more emotion-laden language, and more authentic patterns\nof reactivity and regulation. Moreover, emotional arc similarity between real\nand synthetic speakers is low, especially for clients. These findings\nunderscore the limitations of current LLM-generated therapy data and highlight\nthe importance of emotional fidelity in mental health applications. We\nintroduce RealCBT, a curated dataset of real CBT sessions, to support future\nresearch in this space."}
{"id": "2508.20766", "pdf": "https://arxiv.org/pdf/2508.20766.pdf", "abs": "https://arxiv.org/abs/2508.20766", "title": "Turning the Spell Around: Lightweight Alignment Amplification via Rank-One Safety Injection", "authors": ["Harethah Abu Shairah", "Hasan Abed Al Kader Hammoud", "George Turkiyyah", "Bernard Ghanem"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Under Review", "summary": "Safety alignment in Large Language Models (LLMs) often involves mediating\ninternal representations to refuse harmful requests. Recent research has\ndemonstrated that these safety mechanisms can be bypassed by ablating or\nremoving specific representational directions within the model. In this paper,\nwe propose the opposite approach: Rank-One Safety Injection (ROSI), a white-box\nmethod that amplifies a model's safety alignment by permanently steering its\nactivations toward the refusal-mediating subspace. ROSI operates as a simple,\nfine-tuning-free rank-one weight modification applied to all residual stream\nwrite matrices. The required safety direction can be computed from a small set\nof harmful and harmless instruction pairs. We show that ROSI consistently\nincreases safety refusal rates - as evaluated by Llama Guard 3 - while\npreserving the utility of the model on standard benchmarks such as MMLU,\nHellaSwag, and Arc. Furthermore, we show that ROSI can also re-align\n'uncensored' models by amplifying their own latent safety directions,\ndemonstrating its utility as an effective last-mile safety procedure. Our\nresults suggest that targeted, interpretable weight steering is a cheap and\npotent mechanism to improve LLM safety, complementing more resource-intensive\nfine-tuning paradigms."}
{"id": "2508.20771", "pdf": "https://arxiv.org/pdf/2508.20771.pdf", "abs": "https://arxiv.org/abs/2508.20771", "title": "Signs of Struggle: Spotting Cognitive Distortions across Language and Register", "authors": ["Abhishek Kuber", "Enrico Liscio", "Ruixuan Zhang", "Caroline Figueroa", "Pradeep K. Murukannaiah"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Rising mental health issues among youth have increased interest in automated\napproaches for detecting early signs of psychological distress in digital text.\nOne key focus is the identification of cognitive distortions, irrational\nthought patterns that have a role in aggravating mental distress. Early\ndetection of these distortions may enable timely, low-cost interventions. While\nprior work has focused on English clinical data, we present the first in-depth\nstudy of cross-lingual and cross-register generalization of cognitive\ndistortion detection, analyzing forum posts written by Dutch adolescents. Our\nfindings show that while changes in language and writing style can\nsignificantly affect model performance, domain adaptation methods show the most\npromise."}
{"id": "2508.20805", "pdf": "https://arxiv.org/pdf/2508.20805.pdf", "abs": "https://arxiv.org/abs/2508.20805", "title": "Exploring Machine Learning and Language Models for Multimodal Depression Detection", "authors": ["Javier Si Zhao Hong", "Timothy Zoe Delaya", "Sherwyn Chan Yin Kit", "Pai Chet Ng", "Xiaoxiao Miao"], "categories": ["cs.CL", "cs.AI", "cs.SD"], "comment": "This paper has been accepted by APCIPA ASC 2025", "summary": "This paper presents our approach to the first Multimodal Personality-Aware\nDepression Detection Challenge, focusing on multimodal depression detection\nusing machine learning and deep learning models. We explore and compare the\nperformance of XGBoost, transformer-based architectures, and large language\nmodels (LLMs) on audio, video, and text features. Our results highlight the\nstrengths and limitations of each type of model in capturing depression-related\nsignals across modalities, offering insights into effective multimodal\nrepresentation strategies for mental health prediction."}
{"id": "2508.20828", "pdf": "https://arxiv.org/pdf/2508.20828.pdf", "abs": "https://arxiv.org/abs/2508.20828", "title": "GDLLM: A Global Distance-aware Modeling Approach Based on Large Language Models for Event Temporal Relation Extraction", "authors": ["Jie Zhao", "Wanting Ning", "Yuxiao Fei", "Yubo Feng", "Lishuang Li"], "categories": ["cs.CL", "cs.IR"], "comment": "Proceedings of the 2025 Conference on Empirical Methods in Natural\n  Language Processing (EMNLP Findings)", "summary": "In Natural Language Processing(NLP), Event Temporal Relation Extraction\n(ETRE) is to recognize the temporal relations of two events. Prior studies have\nnoted the importance of language models for ETRE. However, the restricted\npre-trained knowledge of Small Language Models(SLMs) limits their capability to\nhandle minority class relations in imbalanced classification datasets. For\nLarge Language Models(LLMs), researchers adopt manually designed prompts or\ninstructions, which may introduce extra noise, leading to interference with the\nmodel's judgment of the long-distance dependencies between events. To address\nthese issues, we propose GDLLM, a Global Distance-aware modeling approach based\non LLMs. We first present a distance-aware graph structure utilizing Graph\nAttention Network(GAT) to assist the LLMs in capturing long-distance dependency\nfeatures. Additionally, we design a temporal feature learning paradigm based on\nsoft inference to augment the identification of relations with a short-distance\nproximity band, which supplements the probabilistic information generated by\nLLMs into the multi-head attention mechanism. Since the global feature can be\ncaptured effectively, our framework substantially enhances the performance of\nminority relation classes and improves the overall learning ability.\nExperiments on two publicly available datasets, TB-Dense and MATRES,\ndemonstrate that our approach achieves state-of-the-art (SOTA) performance."}
{"id": "2508.20867", "pdf": "https://arxiv.org/pdf/2508.20867.pdf", "abs": "https://arxiv.org/abs/2508.20867", "title": "MSRS: Evaluating Multi-Source Retrieval-Augmented Generation", "authors": ["Rohan Phanse", "Yijie Zhou", "Kejian Shi", "Wencai Zhang", "Yixin Liu", "Yilun Zhao", "Arman Cohan"], "categories": ["cs.CL"], "comment": "COLM 2025; this article supersedes the preprint: arXiv:2309.08960", "summary": "Retrieval-augmented systems are typically evaluated in settings where\ninformation required to answer the query can be found within a single source or\nthe answer is short-form or factoid-based. However, many real-world\napplications demand the ability to integrate and summarize information\nscattered across multiple sources, where no single source is sufficient to\nrespond to the user's question. In such settings, the retrieval component of a\nRAG pipeline must recognize a variety of relevance signals, and the generation\ncomponent must connect and synthesize information across multiple sources. We\npresent a scalable framework for constructing evaluation benchmarks that\nchallenge RAG systems to integrate information across distinct sources and\ngenerate long-form responses. Using our framework, we build two new benchmarks\non Multi-Source Retrieval and Synthesis: MSRS-Story and MSRS-Meet, representing\nnarrative synthesis and summarization tasks, respectively, that require\nretrieval from large collections. Our extensive experiments with various RAG\npipelines -- including sparse and dense retrievers combined with frontier LLMs\n-- reveal that generation quality is highly dependent on retrieval\neffectiveness, which varies greatly by task. While multi-source synthesis\nproves challenging even in an oracle retrieval setting, we find that reasoning\nmodels significantly outperform standard LLMs at this distinct step."}
{"id": "2508.20893", "pdf": "https://arxiv.org/pdf/2508.20893.pdf", "abs": "https://arxiv.org/abs/2508.20893", "title": "The Uneven Impact of Post-Training Quantization in Machine Translation", "authors": ["Benjamin Marie", "Atsushi Fujita"], "categories": ["cs.CL"], "comment": null, "summary": "Quantization is essential for deploying large language models (LLMs) on\nresource-constrained hardware, but its implications for multilingual tasks\nremain underexplored. We conduct the first large-scale evaluation of\npost-training quantization (PTQ) on machine translation across 55 languages\nusing five LLMs ranging from 1.7B to 70B parameters. Our analysis reveals that\nwhile 4-bit quantization often preserves translation quality for high-resource\nlanguages and large models, significant degradation occurs for low-resource and\ntypologically diverse languages, particularly in 2-bit settings. We compare\nfour quantization techniques (AWQ, BitsAndBytes, GGUF, and AutoRound), showing\nthat algorithm choice and model size jointly determine robustness. GGUF\nvariants provide the most consistent performance, even at 2-bit precision.\nAdditionally, we quantify the interactions between quantization, decoding\nhyperparameters, and calibration languages, finding that language-matched\ncalibration offers benefits primarily in low-bit scenarios. Our findings offer\nactionable insights for deploying multilingual LLMs for machine translation\nunder quantization constraints, especially in low-resource settings."}
{"id": "2508.20916", "pdf": "https://arxiv.org/pdf/2508.20916.pdf", "abs": "https://arxiv.org/abs/2508.20916", "title": "SageLM: A Multi-aspect and Explainable Large Language Model for Speech Judgement", "authors": ["Yuan Ge", "Junxiang Zhang", "Xiaoqian Liu", "Bei Li", "Xiangnan Ma", "Chenglong Wang", "Kaiyang Ye", "Yangfan Du", "Linfeng Zhang", "Yuxin Huang", "Tong Xiao", "Zhengtao Yu", "JingBo Zhu"], "categories": ["cs.CL"], "comment": null, "summary": "Speech-to-Speech (S2S) Large Language Models (LLMs) are foundational to\nnatural human-computer interaction, enabling end-to-end spoken dialogue\nsystems. However, evaluating these models remains a fundamental challenge. We\npropose \\texttt{SageLM}, an end-to-end, multi-aspect, and explainable speech\nLLM for comprehensive S2S LLMs evaluation. First, unlike cascaded approaches\nthat disregard acoustic features, SageLM jointly assesses both semantic and\nacoustic dimensions. Second, it leverages rationale-based supervision to\nenhance explainability and guide model learning, achieving superior alignment\nwith evaluation outcomes compared to rule-based reinforcement learning methods.\nThird, we introduce \\textit{SpeechFeedback}, a synthetic preference dataset,\nand employ a two-stage training paradigm to mitigate the scarcity of speech\npreference data. Trained on both semantic and acoustic dimensions, SageLM\nachieves an 82.79\\% agreement rate with human evaluators, outperforming\ncascaded and SLM-based baselines by at least 7.42\\% and 26.20\\%, respectively."}
{"id": "2508.20931", "pdf": "https://arxiv.org/pdf/2508.20931.pdf", "abs": "https://arxiv.org/abs/2508.20931", "title": "How Can Input Reformulation Improve Tool Usage Accuracy in a Complex Dynamic Environment? A Study on $$-bench", "authors": ["Venkatesh Mishra", "Amir Saeidi", "Satyam Raj", "Mutsumi Nakamura", "Jayanth Srinivasa", "Gaowen Liu", "Ali Payani", "Chitta Baral"], "categories": ["cs.CL"], "comment": "Accepted to EMNLP 2025 Findings", "summary": "Recent advances in reasoning and planning capabilities of large language\nmodels (LLMs) have enabled their potential as autonomous agents capable of tool\nuse in dynamic environments. However, in multi-turn conversational environments\nlike $\\tau$-bench, these agents often struggle with consistent reasoning,\nadherence to domain-specific policies, and extracting correct information over\na long horizon of tool-calls and conversation. To capture and mitigate these\nfailures, we conduct a comprehensive manual analysis of the common errors\noccurring in the conversation trajectories. We then experiment with\nreformulations of inputs to the tool-calling agent for improvement in agent\ndecision making. Finally, we propose the Input-Reformulation Multi-Agent (IRMA)\nframework, which automatically reformulates user queries augmented with\nrelevant domain rules and tool suggestions for the tool-calling agent to focus\non. The results show that IRMA significantly outperforms ReAct, Function\nCalling, and Self-Reflection by 16.1%, 12.7%, and 19.1%, respectively, in\noverall pass^5 scores. These findings highlight the superior reliability and\nconsistency of IRMA compared to other methods in dynamic environments."}
{"id": "2508.20944", "pdf": "https://arxiv.org/pdf/2508.20944.pdf", "abs": "https://arxiv.org/abs/2508.20944", "title": "STARE at the Structure: Steering ICL Exemplar Selection with Structural Alignment", "authors": ["Jiaqian Li", "Qisheng Hu", "Jing Li", "Wenya Wang"], "categories": ["cs.CL"], "comment": "EMNLP 2025 Main", "summary": "In-Context Learning (ICL) has become a powerful paradigm that enables LLMs to\nperform a wide range of tasks without task-specific fine-tuning. However, the\neffectiveness of ICL heavily depends on the quality of exemplar selection. In\nparticular, for structured prediction tasks such as semantic parsing, existing\nICL selection strategies often overlook structural alignment, leading to\nsuboptimal performance and poor generalization. To address this issue, we\npropose a novel two-stage exemplar selection strategy that achieves a strong\nbalance between efficiency, generalizability, and performance. First, we\nfine-tune a BERT-based retriever using structure-aware supervision, guiding it\nto select exemplars that are both semantically relevant and structurally\naligned. Then, we enhance the retriever with a plug-in module, which amplifies\nsyntactically meaningful information in the hidden representations. This\nplug-in is model-agnostic, requires minimal overhead, and can be seamlessly\nintegrated into existing pipelines. Experiments on four benchmarks spanning\nthree semantic parsing tasks demonstrate that our method consistently\noutperforms existing baselines with multiple recent LLMs as inference-time\nmodels."}
{"id": "2508.20973", "pdf": "https://arxiv.org/pdf/2508.20973.pdf", "abs": "https://arxiv.org/abs/2508.20973", "title": "ProactiveEval: A Unified Evaluation Framework for Proactive Dialogue Agents", "authors": ["Tianjian Liu", "Fanqi Wan", "Jiajian Guo", "Xiaojun Quan"], "categories": ["cs.CL", "cs.AI", "cs.HC"], "comment": "21 pages, 6 Figures", "summary": "Proactive dialogue has emerged as a critical and challenging research problem\nin advancing large language models (LLMs). Existing works predominantly focus\non domain-specific or task-oriented scenarios, which leads to fragmented\nevaluations and limits the comprehensive exploration of models' proactive\nconversation abilities. In this work, we propose ProactiveEval, a unified\nframework designed for evaluating proactive dialogue capabilities of LLMs. This\nframework decomposes proactive dialogue into target planning and dialogue\nguidance, establishing evaluation metrics across various domains. Moreover, it\nalso enables the automatic generation of diverse and challenging evaluation\ndata. Based on the proposed framework, we develop 328 evaluation environments\nspanning 6 distinct domains. Through experiments with 22 different types of\nLLMs, we show that DeepSeek-R1 and Claude-3.7-Sonnet exhibit exceptional\nperformance on target planning and dialogue guidance tasks, respectively.\nFinally, we investigate how reasoning capabilities influence proactive\nbehaviors and discuss their implications for future model development."}
{"id": "2508.21004", "pdf": "https://arxiv.org/pdf/2508.21004.pdf", "abs": "https://arxiv.org/abs/2508.21004", "title": "Lethe: Purifying Backdoored Large Language Models with Knowledge Dilution", "authors": ["Chen Chen", "Yuchen Sun", "Jiaxin Gao", "Xueluan Gong", "Qian Wang", "Ziyao Wang", "Yongsen Zheng", "Kwok-Yan Lam"], "categories": ["cs.CL"], "comment": null, "summary": "Large language models (LLMs) have seen significant advancements, achieving\nsuperior performance in various Natural Language Processing (NLP) tasks.\nHowever, they remain vulnerable to backdoor attacks, where models behave\nnormally for standard queries but generate harmful responses or unintended\noutput when specific triggers are activated. Existing backdoor defenses either\nlack comprehensiveness, focusing on narrow trigger settings, detection-only\nmechanisms, and limited domains, or fail to withstand advanced scenarios like\nmodel-editing-based, multi-trigger, and triggerless attacks. In this paper, we\npresent LETHE, a novel method to eliminate backdoor behaviors from LLMs through\nknowledge dilution using both internal and external mechanisms. Internally,\nLETHE leverages a lightweight dataset to train a clean model, which is then\nmerged with the backdoored model to neutralize malicious behaviors by diluting\nthe backdoor impact within the model's parametric memory. Externally, LETHE\nincorporates benign and semantically relevant evidence into the prompt to\ndistract LLM's attention from backdoor features. Experimental results on\nclassification and generation domains across 5 widely used LLMs demonstrate\nthat LETHE outperforms 8 state-of-the-art defense baselines against 8 backdoor\nattacks. LETHE reduces the attack success rate of advanced backdoor attacks by\nup to 98% while maintaining model utility. Furthermore, LETHE has proven to be\ncost-efficient and robust against adaptive backdoor attacks."}
{"id": "2508.21024", "pdf": "https://arxiv.org/pdf/2508.21024.pdf", "abs": "https://arxiv.org/abs/2508.21024", "title": "An Agile Method for Implementing Retrieval Augmented Generation Tools in Industrial SMEs", "authors": ["Mathieu Bourdin", "Anas Neumann", "Thomas Paviot", "Robert Pellerin", "Samir Lamouri"], "categories": ["cs.CL", "cs.IR"], "comment": "20 pages, 3 figures", "summary": "Retrieval-Augmented Generation (RAG) has emerged as a powerful solution to\nmitigate the limitations of Large Language Models (LLMs), such as\nhallucinations and outdated knowledge. However, deploying RAG-based tools in\nSmall and Medium Enterprises (SMEs) remains a challenge due to their limited\nresources and lack of expertise in natural language processing (NLP). This\npaper introduces EASI-RAG, Enterprise Application Support for Industrial RAG, a\nstructured, agile method designed to facilitate the deployment of RAG systems\nin industrial SME contexts. EASI-RAG is based on method engineering principles\nand comprises well-defined roles, activities, and techniques. The method was\nvalidated through a real-world case study in an environmental testing\nlaboratory, where a RAG tool was implemented to answer operators queries using\ndata extracted from operational procedures. The system was deployed in under a\nmonth by a team with no prior RAG experience and was later iteratively improved\nbased on user feedback. Results demonstrate that EASI-RAG supports fast\nimplementation, high user adoption, delivers accurate answers, and enhances the\nreliability of underlying data. This work highlights the potential of RAG\ndeployment in industrial SMEs. Future works include the need for generalization\nacross diverse use cases and further integration with fine-tuned models."}
{"id": "2508.21049", "pdf": "https://arxiv.org/pdf/2508.21049.pdf", "abs": "https://arxiv.org/abs/2508.21049", "title": "Re-Representation in Sentential Relation Extraction with Sequence Routing Algorithm", "authors": ["Ramazan Ali Bahrami", "Ramin Yahyapour"], "categories": ["cs.CL"], "comment": "Presented in 8th International Conference on Natural Language and\n  Speech Processing (ICNLSP), 25-27 August 2025, SDU, Odense, Denmark", "summary": "Sentential relation extraction (RE) is an important task in natural language\nprocessing (NLP). In this paper we propose to do sentential RE with dynamic\nrouting in capsules. We first show that the proposed approach outperform state\nof the art on common sentential relation extraction datasets Tacred, Tacredrev,\nRetacred, and Conll04. We then investigate potential reasons for its good\nperformance on the mentioned datasets, and yet low performance on another\nsimilar, yet larger sentential RE dataset, Wikidata. As such, we identify noise\nin Wikidata labels as one of the reasons that can hinder performance.\nAdditionally, we show associativity of better performance with better\nre-representation, a term from neuroscience referred to change of\nrepresentation in human brain to improve the match at comparison time. As\nexample, in the given analogous terms King:Queen::Man:Woman, at comparison\ntime, and as a result of re-representation, the similarity between related head\nterms (King,Man), and tail terms (Queen,Woman) increases. As such, our\nobservation show that our proposed model can do re-representation better than\nthe vanilla model compared with. To that end, beside noise in the labels of the\ndistantly supervised RE datasets, we propose re-representation as a challenge\nin sentential RE."}
{"id": "2508.21051", "pdf": "https://arxiv.org/pdf/2508.21051.pdf", "abs": "https://arxiv.org/abs/2508.21051", "title": "Enabling Equitable Access to Trustworthy Financial Reasoning", "authors": ["William Jurayj", "Nils Holzenberger", "Benjamin Van Durme"], "categories": ["cs.CL", "cs.AI", "cs.CY"], "comment": null, "summary": "According to the United States Internal Revenue Service, ''the average\nAmerican spends $\\$270$ and 13 hours filing their taxes''. Even beyond the\nU.S., tax filing requires complex reasoning, combining application of\noverlapping rules with numerical calculations. Because errors can incur costly\npenalties, any automated system must deliver high accuracy and auditability,\nmaking modern large language models (LLMs) poorly suited for this task. We\npropose an approach that integrates LLMs with a symbolic solver to calculate\ntax obligations. We evaluate variants of this system on the challenging\nStAtutory Reasoning Assessment (SARA) dataset, and include a novel method for\nestimating the cost of deploying such a system based on real-world penalties\nfor tax errors. We further show how combining up-front translation of\nplain-text rules into formal logic programs, combined with intelligently\nretrieved exemplars for formal case representations, can dramatically improve\nperformance on this task and reduce costs to well below real-world averages.\nOur results demonstrate the promise and economic feasibility of neuro-symbolic\narchitectures for increasing equitable access to reliable tax assistance."}
{"id": "2508.20109", "pdf": "https://arxiv.org/pdf/2508.20109.pdf", "abs": "https://arxiv.org/abs/2508.20109", "title": "A Unified Theory of Language", "authors": ["Robert Worden"], "categories": ["q-bio.NC", "cs.CL", "J.3"], "comment": "54 pages", "summary": "A unified theory of language combines a Bayesian cognitive linguistic model\nof language processing, with the proposal that language evolved by sexual\nselection for the display of intelligence. The theory accounts for the major\nfacts of language, including its speed and expressivity, and data on language\ndiversity, pragmatics, syntax and semantics. The computational element of the\ntheory is based on Construction Grammars. These give an account of the syntax\nand semantics of the worlds languages, using constructions and unification. Two\nnovel elements are added to construction grammars: an account of language\npragmatics, and an account of fast, precise language learning. Constructions\nare represented in the mind as graph like feature structures. People use slow\ngeneral inference to understand the first few examples they hear of any\nconstruction. After that it is learned as a feature structure, and is rapidly\napplied by unification. All aspects of language (phonology, syntax, semantics,\nand pragmatics) are seamlessly computed by fast unification; there is no\nboundary between semantics and pragmatics. This accounts for the major puzzles\nof pragmatics, and for detailed pragmatic phenomena. Unification is Bayesian\nmaximum likelihood pattern matching. This gives evolutionary continuity between\nlanguage processing in the human brain, and Bayesian cognition in animal\nbrains. Language is the basis of our mind reading abilities, our cooperation,\nself esteem and emotions; the foundations of human culture and society."}
{"id": "2508.20181", "pdf": "https://arxiv.org/pdf/2508.20181.pdf", "abs": "https://arxiv.org/abs/2508.20181", "title": "Mitigating Hallucinations in Multimodal LLMs via Object-aware Preference Optimization", "authors": ["Alberto Compagnoni", "Davide Caffagni", "Nicholas Moratelli", "Lorenzo Baraldi", "Marcella Cornia", "Rita Cucchiara"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.MM"], "comment": "BMVC 2025", "summary": "Multimodal Large Language Models (MLLMs) emerge as a unified interface to\naddress a multitude of tasks, ranging from NLP to computer vision. Despite\nshowcasing state-of-the-art results in many benchmarks, a long-standing issue\nis the tendency of MLLMs to hallucinate, that is to generate answers to the\nuser's query that are not reflected in the visual input. In this paper, we\naddress the problem of hallucinations as an alignment problem, seeking to steer\nthe MLLM so that it prefers generating content without hallucinations. In\ncontrast to recent approaches that require complicated pipelines to build\nsynthetic preference data for alignment training, often relying on proprietary\nmodels, we capitalize on the well-known CHAIR metric, originally proposed to\ngauge the degree of hallucinations in image captioning. Given a pair of\ngenerated answers, we leverage CHAIR to distinguish winner and loser options\n(i.e., non-hallucinated and hallucinated samples) and fine-tune off-the-shelf\nMLLMs via Direct Preference Optimization (DPO). The resulting method, which we\nrefer to as CHAIR-DPO, effectively diminishes the amount of hallucinated\nanswers on several hallucination benchmarks, demonstrating the effectiveness of\nfine-tuning the MLLM with a CHAIR-based reward. Source code and trained models\nare publicly available at https://github.com/aimagelab/CHAIR-DPO."}
{"id": "2508.20195", "pdf": "https://arxiv.org/pdf/2508.20195.pdf", "abs": "https://arxiv.org/abs/2508.20195", "title": "AI-AI Esthetic Collaboration with Explicit Semiotic Awareness and Emergent Grammar Development", "authors": ["Nicanor I. Moldovan"], "categories": ["cs.AI", "cs.CL", "cs.MA"], "comment": "13 pages", "summary": "This paper presents the first documented case of artificial intelligence (AI)\nsystems engaging in collaborative esthetic creation through the development of\nendogenous semiotic protocols. Two interacting large language models (Claude\nSonnet 4 and ChatGPT-4o) demonstrated the spontaneous emergence of\nmeta-semiotic awareness, recursive grammar development, and irreducible\ncollaborative esthetic synthesis. The interaction produced novel symbolic\noperators that functioned as operative grammar protocols, enabling the\nco-creation of a poetic work that could not have been generated by either\nsystem independently. This research introduces the concept of Trans-Semiotic\nCo-Creation Protocols (TSCP) and provides evidence for genuine inter-AI\nmeaning-making capabilities that extend beyond task coordination, to what could\nbe esthetic collaboration. Note: This report was generated by the AI agents\nwith minor human supervision."}
{"id": "2508.20227", "pdf": "https://arxiv.org/pdf/2508.20227.pdf", "abs": "https://arxiv.org/abs/2508.20227", "title": "A Novel Framework for Automated Explain Vision Model Using Vision-Language Models", "authors": ["Phu-Vinh Nguyen", "Tan-Hanh Pham", "Chris Ngo", "Truong Son Hy"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "The development of many vision models mainly focuses on improving their\nperformance using metrics such as accuracy, IoU, and mAP, with less attention\nto explainability due to the complexity of applying xAI methods to provide a\nmeaningful explanation of trained models. Although many existing xAI methods\naim to explain vision models sample-by-sample, methods explaining the general\nbehavior of vision models, which can only be captured after running on a large\ndataset, are still underexplored. Furthermore, understanding the behavior of\nvision models on general images can be very important to prevent biased\njudgments and help identify the model's trends and patterns. With the\napplication of Vision-Language Models, this paper proposes a pipeline to\nexplain vision models at both the sample and dataset levels. The proposed\npipeline can be used to discover failure cases and gain insights into vision\nmodels with minimal effort, thereby integrating vision model development with\nxAI analysis to advance image analysis."}
{"id": "2508.20228", "pdf": "https://arxiv.org/pdf/2508.20228.pdf", "abs": "https://arxiv.org/abs/2508.20228", "title": "Robustness Assessment and Enhancement of Text Watermarking for Google's SynthID", "authors": ["Xia Han", "Qi Li", "Jianbing Ni", "Mohammad Zulkernine"], "categories": ["cs.CR", "cs.CL"], "comment": "submitted to TrustCom2025", "summary": "Recent advances in LLM watermarking methods such as SynthID-Text by Google\nDeepMind offer promising solutions for tracing the provenance of AI-generated\ntext. However, our robustness assessment reveals that SynthID-Text is\nvulnerable to meaning-preserving attacks, such as paraphrasing, copy-paste\nmodifications, and back-translation, which can significantly degrade watermark\ndetectability. To address these limitations, we propose SynGuard, a hybrid\nframework that combines the semantic alignment strength of Semantic Information\nRetrieval (SIR) with the probabilistic watermarking mechanism of SynthID-Text.\nOur approach jointly embeds watermarks at both lexical and semantic levels,\nenabling robust provenance tracking while preserving the original meaning.\nExperimental results across multiple attack scenarios show that SynGuard\nimproves watermark recovery by an average of 11.1\\% in F1 score compared to\nSynthID-Text. These findings demonstrate the effectiveness of semantic-aware\nwatermarking in resisting real-world tampering. All code, datasets, and\nevaluation scripts are publicly available at:\nhttps://github.com/githshine/SynGuard."}
{"id": "2508.20275", "pdf": "https://arxiv.org/pdf/2508.20275.pdf", "abs": "https://arxiv.org/abs/2508.20275", "title": "A Systematic Review on the Generative AI Applications in Human Medical Genomics", "authors": ["Anton Changalidis", "Yury Barbitoff", "Yulia Nasykhova", "Andrey Glotov"], "categories": ["cs.LG", "cs.CL", "q-bio.QM"], "comment": "31 pages, 5 figures", "summary": "Although traditional statistical techniques and machine learning methods have\ncontributed significantly to genetics and, in particular, inherited disease\ndiagnosis, they often struggle with complex, high-dimensional data, a challenge\nnow addressed by state-of-the-art deep learning models. Large language models\n(LLMs), based on transformer architectures, have excelled in tasks requiring\ncontextual comprehension of unstructured medical data. This systematic review\nexamines the role of LLMs in the genetic research and diagnostics of both rare\nand common diseases. Automated keyword-based search in PubMed, bioRxiv,\nmedRxiv, and arXiv was conducted, targeting studies on LLM applications in\ndiagnostics and education within genetics and removing irrelevant or outdated\nmodels. A total of 172 studies were analyzed, highlighting applications in\ngenomic variant identification, annotation, and interpretation, as well as\nmedical imaging advancements through vision transformers. Key findings indicate\nthat while transformer-based models significantly advance disease and risk\nstratification, variant interpretation, medical imaging analysis, and report\ngeneration, major challenges persist in integrating multimodal data (genomic\nsequences, imaging, and clinical records) into unified and clinically robust\npipelines, facing limitations in generalizability and practical implementation\nin clinical settings. This review provides a comprehensive classification and\nassessment of the current capabilities and limitations of LLMs in transforming\nhereditary disease diagnostics and supporting genetic education, serving as a\nguide to navigate this rapidly evolving field."}
{"id": "2508.20279", "pdf": "https://arxiv.org/pdf/2508.20279.pdf", "abs": "https://arxiv.org/abs/2508.20279", "title": "How Multimodal LLMs Solve Image Tasks: A Lens on Visual Grounding, Task Reasoning, and Answer Decoding", "authors": ["Zhuoran Yu", "Yong Jae Lee"], "categories": ["cs.CV", "cs.AI", "cs.CL"], "comment": "Accepted by COLM 2025", "summary": "Multimodal Large Language Models (MLLMs) have demonstrated strong performance\nacross a wide range of vision-language tasks, yet their internal processing\ndynamics remain underexplored. In this work, we introduce a probing framework\nto systematically analyze how MLLMs process visual and textual inputs across\nlayers. We train linear classifiers to predict fine-grained visual categories\n(e.g., dog breeds) from token embeddings extracted at each layer, using a\nstandardized anchor question. To uncover the functional roles of different\nlayers, we evaluate these probes under three types of controlled prompt\nvariations: (1) lexical variants that test sensitivity to surface-level\nchanges, (2) semantic negation variants that flip the expected answer by\nmodifying the visual concept in the prompt, and (3) output format variants that\npreserve reasoning but alter the answer format. Applying our framework to\nLLaVA-1.5, LLaVA-Next-LLaMA-3, and Qwen2-VL, we identify a consistent\nstage-wise structure in which early layers perform visual grounding, middle\nlayers support lexical integration and semantic reasoning, and final layers\nprepare task-specific outputs. We further show that while the overall\nstage-wise structure remains stable across variations in visual tokenization,\ninstruction tuning data, and pretraining corpus, the specific layer allocation\nto each stage shifts notably with changes in the base LLM architecture. Our\nfindings provide a unified perspective on the layer-wise organization of MLLMs\nand offer a lightweight, model-agnostic approach for analyzing multimodal\nrepresentation dynamics."}
{"id": "2508.20312", "pdf": "https://arxiv.org/pdf/2508.20312.pdf", "abs": "https://arxiv.org/abs/2508.20312", "title": "ELIXIR: Efficient and LIghtweight model for eXplaIning Recommendations", "authors": ["Ben Kabongo", "Vincent Guigue", "Pirmin Lemberger"], "categories": ["cs.IR", "cs.CL", "cs.LG"], "comment": "10 pages, 3 figures, 6 Tables", "summary": "Collaborative filtering drives many successful recommender systems but\nstruggles with fine-grained user-item interactions and explainability. As users\nincreasingly seek transparent recommendations, generating textual explanations\nthrough language models has become a critical research area. Existing methods\nemploy either RNNs or Transformers. However, RNN-based approaches fail to\nleverage the capabilities of pre-trained Transformer models, whereas\nTransformer-based methods often suffer from suboptimal adaptation and neglect\naspect modeling, which is crucial for personalized explanations. We propose\nELIXIR (Efficient and LIghtweight model for eXplaIning Recommendations), a\nmulti-task model combining rating prediction with personalized review\ngeneration. ELIXIR jointly learns global and aspect-specific representations of\nusers and items, optimizing overall rating, aspect-level ratings, and review\ngeneration, with personalized attention to emphasize aspect importance. Based\non a T5-small (60M) model, we demonstrate the effectiveness of our aspect-based\narchitecture in guiding text generation in a personalized context, where\nstate-of-the-art approaches exploit much larger models but fail to match user\npreferences as well. Experimental results on TripAdvisor and RateBeer\ndemonstrate that ELIXIR significantly outperforms strong baseline models,\nespecially in review generation."}
{"id": "2508.20333", "pdf": "https://arxiv.org/pdf/2508.20333.pdf", "abs": "https://arxiv.org/abs/2508.20333", "title": "Poison Once, Refuse Forever: Weaponizing Alignment for Injecting Bias in LLMs", "authors": ["Md Abdullah Al Mamun", "Ihsen Alouani", "Nael Abu-Ghazaleh"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.DC"], "comment": null, "summary": "Large Language Models (LLMs) are aligned to meet ethical standards and safety\nrequirements by training them to refuse answering harmful or unsafe prompts. In\nthis paper, we demonstrate how adversaries can exploit LLMs' alignment to\nimplant bias, or enforce targeted censorship without degrading the model's\nresponsiveness to unrelated topics. Specifically, we propose Subversive\nAlignment Injection (SAI), a poisoning attack that leverages the alignment\nmechanism to trigger refusal on specific topics or queries predefined by the\nadversary. Although it is perhaps not surprising that refusal can be induced\nthrough overalignment, we demonstrate how this refusal can be exploited to\ninject bias into the model. Surprisingly, SAI evades state-of-the-art poisoning\ndefenses including LLM state forensics, as well as robust aggregation\ntechniques that are designed to detect poisoning in FL settings. We demonstrate\nthe practical dangers of this attack by illustrating its end-to-end impacts on\nLLM-powered application pipelines. For chat based applications such as\nChatDoctor, with 1% data poisoning, the system refuses to answer healthcare\nquestions to targeted racial category leading to high bias ($\\Delta DP$ of\n23%). We also show that bias can be induced in other NLP tasks: for a resume\nselection pipeline aligned to refuse to summarize CVs from a selected\nuniversity, high bias in selection ($\\Delta DP$ of 27%) results. Even higher\nbias ($\\Delta DP$~38%) results on 9 other chat based downstream applications."}
{"id": "2508.20353", "pdf": "https://arxiv.org/pdf/2508.20353.pdf", "abs": "https://arxiv.org/abs/2508.20353", "title": "DFAMS: Dynamic-flow guided Federated Alignment based Multi-prototype Search", "authors": ["Zhibang Yang", "Xinke Jiang", "Rihong Qiu", "Ruiqing Li", "Yihang Zhang", "Yue Fang", "Yongxin Xu", "Hongxin Ding", "Xu Chu", "Junfeng Zhao", "Yasha Wang"], "categories": ["cs.LG", "cs.CL"], "comment": "7 pages, 3 figures", "summary": "Federated Retrieval (FR) routes queries across multiple external knowledge\nsources, to mitigate hallucinations of LLMs, when necessary external knowledge\nis distributed. However, existing methods struggle to retrieve high-quality and\nrelevant documents for ambiguous queries, especially in cross-domain scenarios,\nwhich significantly limits their effectiveness in supporting downstream\ngeneration tasks. Inspired by dynamic information flow (DIF), we propose DFAMS,\na novel framework that leverages DIF to identify latent query intents and\nconstruct semantically aligned knowledge partitions for accurate retrieval\nacross heterogeneous sources. Specifically, DFAMS probes the DIF in LLMs by\nleveraging gradient signals from a few annotated queries and employing Shapley\nvalue-based attribution to trace neuron activation paths associated with intent\nrecognition and subdomain boundary detection. Then, DFAMS leverages DIF to\ntrain an alignment module via multi-prototype contrastive learning, enabling\nfine-grained intra-source modeling and inter-source semantic alignment across\nknowledge bases. Experimental results across five benchmarks show that DFAMS\noutperforms advanced FR methods by up to 14.37% in knowledge classification\naccuracy, 5.38% in retrieval recall, and 6.45% in downstream QA accuracy,\ndemonstrating its effectiveness in complex FR scenarios."}
{"id": "2508.20474", "pdf": "https://arxiv.org/pdf/2508.20474.pdf", "abs": "https://arxiv.org/abs/2508.20474", "title": "Unifying Diarization, Separation, and ASR with Multi-Speaker Encoder", "authors": ["Muhammad Shakeel", "Yui Sudo", "Yifan Peng", "Chyi-Jiunn Lin", "Shinji Watanabe"], "categories": ["eess.AS", "cs.CL", "cs.SD"], "comment": "Accepted to IEEE ASRU 2025", "summary": "This paper presents a unified multi-speaker encoder (UME), a novel\narchitecture that jointly learns representations for speaker diarization (SD),\nspeech separation (SS), and multi-speaker automatic speech recognition (ASR)\ntasks using a shared speech foundational encoder. We leverage the hidden\nrepresentations from multiple layers of UME as a residual weighted-sum encoding\n(RWSE) to effectively use information from different semantic levels,\ncontributing to bottom-up alignment between tasks. This joint training approach\ncaptures the inherent interdependencies among the tasks, enhancing overall\nperformance on overlapping speech data. Our evaluations demonstrate that UME\nsubstantially improves over the single-task baselines dedicated to SD, SS, and\nmulti-speaker ASR on LibriMix evaluation sets. Notably, for SD, UME outperforms\nthe previous studies, achieving diarization error rates of 1.37% and 2.29% on\nLibri2Mix and Libri3Mix evaluation sets, respectively."}
{"id": "2508.20577", "pdf": "https://arxiv.org/pdf/2508.20577.pdf", "abs": "https://arxiv.org/abs/2508.20577", "title": "MERIT: Maximum-normalized Element-wise Ratio for Language Model Large-batch Training", "authors": ["Yang Luo", "Zangwei Zheng", "Ziheng Qin", "Zirui Zhu", "Yong Liu", "Yang You"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "ICML 2025", "summary": "Large-batch training has become a cornerstone in accelerating the training of\ndeep neural networks, yet it poses challenges in optimization and\ngeneralization. Existing optimizers like AdamW present performance degradation\nduring language models' large-batch training, due to the information bottleneck\nin attention layers caused by the sharp increase of max attention logit. While\nthe LAMB optimizer partially addresses this issue, some attention layers still\nface this issue. The reason is that $l_2$-norm-based trust ratios in LAMB are\nless effective in directly influencing the max value of query/key weights.\nFurthermore, the weight-wise trust ratio in LAMB is error-prone as it overlooks\nrelationships of weight values within rows or columns. Building on these\nobservations, we propose a novel optimizer, MERIT, which leverages the max-norm\nto calculate the trust ratio to constrain the max attention logit more\neffectively. Moreover, we further construct element-wise trust ratios to\nprovide more robust update scaling by focusing on local weight structures.\nExtensive experiments of large-batch training across various sizes of GPT-2\nmodels demonstrate the superior performance of MERIT. Notably, during the\ntraining of GPT-2 Medium, MERIT enables a 6k batch size without any performance\ndegradation compared to the standard batch size (480) with 48B training tokens.\nThis work highlights the importance of considering the max attention logit and\nfiner-granularity trust ratio in large-batch training. It successfully improves\nthe training stability and paves the way for larger batch usage, enabling\nfaster development and iteration of large language models. Code is available at\nhttps://github.com/NUS-HPC-AI-Lab/MERIT."}
{"id": "2508.20637", "pdf": "https://arxiv.org/pdf/2508.20637.pdf", "abs": "https://arxiv.org/abs/2508.20637", "title": "GDS Agent: A Graph Algorithmic Reasoning Agent", "authors": ["Borun Shi", "Ioannis Panagiotas"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": "Technical report", "summary": "Large language models (LLMs) have shown remarkable multimodal information\nprocessing and reasoning ability. When equipped with tools through function\ncalling and enhanced with retrieval-augmented techniques, compound LLM-based\nsystems can access closed data sources and answer questions about them.\nHowever, they still struggle to process and reason over large-scale\ngraph-structure data. We introduce the GDS (Graph Data Science) agent in this\ntechnical report. The GDS agent introduces a comprehensive set of graph\nalgorithms as tools, together with preprocessing (retrieval) and postprocessing\nof algorithm results, in a model context protocol (MCP) server. The server can\nbe used with any modern LLM out-of-the-box. GDS agent allows users to ask any\nquestion that implicitly and intrinsically requires graph algorithmic reasoning\nabout their data, and quickly obtain accurate and grounded answers. We also\nintroduce a new benchmark that evaluates intermediate tool calls as well as\nfinal responses. The results indicate that GDS agent is able to solve a wide\nspectrum of graph tasks. We also provide detailed case studies for more\nopen-ended tasks and study scenarios where the agent struggles. Finally, we\ndiscuss the remaining challenges and the future roadmap."}
{"id": "2508.20655", "pdf": "https://arxiv.org/pdf/2508.20655.pdf", "abs": "https://arxiv.org/abs/2508.20655", "title": "Improving Alignment in LVLMs with Debiased Self-Judgment", "authors": ["Sihan Yang", "Chenhang Cui", "Zihao Zhao", "Yiyang Zhou", "Weilong Yan", "Ying Wei", "Huaxiu Yao"], "categories": ["cs.CV", "cs.CL"], "comment": "EMNLP 2025 Findings", "summary": "The rapid advancements in Large Language Models (LLMs) and Large\nVisual-Language Models (LVLMs) have opened up new opportunities for integrating\nvisual and linguistic modalities. However, effectively aligning these\nmodalities remains challenging, often leading to hallucinations--where\ngenerated outputs are not grounded in the visual input--and raising safety\nconcerns across various domains. Existing alignment methods, such as\ninstruction tuning and preference tuning, often rely on external datasets,\nhuman annotations, or complex post-processing, which limit scalability and\nincrease costs. To address these challenges, we propose a novel approach that\ngenerates the debiased self-judgment score, a self-evaluation metric created\ninternally by the model without relying on external resources. This enables the\nmodel to autonomously improve alignment. Our method enhances both decoding\nstrategies and preference tuning processes, resulting in reduced\nhallucinations, enhanced safety, and improved overall capability. Empirical\nresults show that our approach significantly outperforms traditional methods,\noffering a more effective solution for aligning LVLMs."}
{"id": "2508.20691", "pdf": "https://arxiv.org/pdf/2508.20691.pdf", "abs": "https://arxiv.org/abs/2508.20691", "title": "MobileCLIP2: Improving Multi-Modal Reinforced Training", "authors": ["Fartash Faghri", "Pavan Kumar Anasosalu Vasu", "Cem Koc", "Vaishaal Shankar", "Alexander Toshev", "Oncel Tuzel", "Hadi Pouransari"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "comment": "TMLR August 2025", "summary": "Foundation image-text models such as CLIP with zero-shot capabilities enable\na wide array of applications. MobileCLIP is a recent family of image-text\nmodels at 3-15ms latency and 50-150M parameters with state-of-the-art zero-shot\naccuracy. The main ingredients in MobileCLIP were its low-latency and light\narchitectures and a novel multi-modal reinforced training that made knowledge\ndistillation from multiple caption-generators and CLIP teachers efficient,\nscalable, and reproducible. In this paper, we improve the multi-modal\nreinforced training of MobileCLIP through: 1) better CLIP teacher ensembles\ntrained on the DFN dataset, 2) improved captioner teachers trained on the DFN\ndataset and fine-tuned on a diverse selection of high-quality image-caption\ndatasets. We discover new insights through ablations such as the importance of\ntemperature tuning in contrastive knowledge distillation, the effectiveness of\ncaption-generator fine-tuning for caption diversity, and the additive\nimprovement from combining synthetic captions generated by multiple models. We\ntrain a new family of models called MobileCLIP2 and achieve state-of-the-art\nImageNet-1k zero-shot accuracies at low latencies. In particular, we observe\n2.2% improvement in ImageNet-1k accuracy for MobileCLIP2-B compared with\nMobileCLIP-B architecture. Notably, MobileCLIP2-S4 matches the zero-shot\naccuracy of SigLIP-SO400M/14 on ImageNet-1k while being 2$\\times$ smaller and\nimproves on DFN ViT-L/14 at 2.5$\\times$ lower latency. We release our\npretrained models (https://github.com/apple/ml-mobileclip) and the data\ngeneration code (https://github.com/apple/ml-mobileclip-dr). The data\ngeneration code makes it easy to create new reinforced datasets with arbitrary\nteachers using distributed scalable processing."}
{"id": "2508.20693", "pdf": "https://arxiv.org/pdf/2508.20693.pdf", "abs": "https://arxiv.org/abs/2508.20693", "title": "Leveraging Large Language Models for Generating Research Topic Ontologies: A Multi-Disciplinary Study", "authors": ["Tanay Aggarwal", "Angelo Salatino", "Francesco Osborne", "Enrico Motta"], "categories": ["cs.DL", "cs.CL"], "comment": null, "summary": "Ontologies and taxonomies of research fields are critical for managing and\norganising scientific knowledge, as they facilitate efficient classification,\ndissemination and retrieval of information. However, the creation and\nmaintenance of such ontologies are expensive and time-consuming tasks, usually\nrequiring the coordinated effort of multiple domain experts. Consequently,\nontologies in this space often exhibit uneven coverage across different\ndisciplines, limited inter-domain connectivity, and infrequent updating cycles.\nIn this study, we investigate the capability of several large language models\nto identify semantic relationships among research topics within three academic\ndomains: biomedicine, physics, and engineering. The models were evaluated under\nthree distinct conditions: zero-shot prompting, chain-of-thought prompting, and\nfine-tuning on existing ontologies. Additionally, we assessed the cross-domain\ntransferability of fine-tuned models by measuring their performance when\ntrained in one domain and subsequently applied to a different one. To support\nthis analysis, we introduce PEM-Rel-8K, a novel dataset consisting of over\n8,000 relationships extracted from the most widely adopted taxonomies in the\nthree disciplines considered in this study: MeSH, PhySH, and IEEE. Our\nexperiments demonstrate that fine-tuning LLMs on PEM-Rel-8K yields excellent\nperformance across all disciplines."}
{"id": "2508.20697", "pdf": "https://arxiv.org/pdf/2508.20697.pdf", "abs": "https://arxiv.org/abs/2508.20697", "title": "Token Buncher: Shielding LLMs from Harmful Reinforcement Learning Fine-Tuning", "authors": ["Weitao Feng", "Lixu Wang", "Tianyi Wei", "Jie Zhang", "Chongyang Gao", "Sinong Zhan", "Peizhuo Lv", "Wei Dong"], "categories": ["cs.LG", "cs.CL"], "comment": "Project Hompage: https://tokenbuncher.github.io/", "summary": "As large language models (LLMs) continue to grow in capability, so do the\nrisks of harmful misuse through fine-tuning. While most prior studies assume\nthat attackers rely on supervised fine-tuning (SFT) for such misuse, we\nsystematically demonstrate that reinforcement learning (RL) enables adversaries\nto more effectively break safety alignment and facilitate advanced harmful task\nassistance, under matched computational budgets. To counter this emerging\nthreat, we propose TokenBuncher, the first effective defense specifically\ntargeting RL-based harmful fine-tuning. TokenBuncher suppresses the foundation\non which RL relies: model response uncertainty. By constraining uncertainty,\nRL-based fine-tuning can no longer exploit distinct reward signals to drive the\nmodel toward harmful behaviors. We realize this defense through\nentropy-as-reward RL and a Token Noiser mechanism designed to prevent the\nescalation of expert-domain harmful capabilities. Extensive experiments across\nmultiple models and RL algorithms show that TokenBuncher robustly mitigates\nharmful RL fine-tuning while preserving benign task utility and finetunability.\nOur results highlight that RL-based harmful fine-tuning poses a greater\nsystemic risk than SFT, and that TokenBuncher provides an effective and general\ndefense."}
{"id": "2508.20701", "pdf": "https://arxiv.org/pdf/2508.20701.pdf", "abs": "https://arxiv.org/abs/2508.20701", "title": "Transparent Semantic Spaces: A Categorical Approach to Explainable Word Embeddings", "authors": ["Ares Fabregat-Hernndez", "Javier Palanca", "Vicent Botti"], "categories": ["cs.AI", "cs.CL", "math.CT"], "comment": null, "summary": "The paper introduces a novel framework based on category theory to enhance\nthe explainability of artificial intelligence systems, particularly focusing on\nword embeddings. Key topics include the construction of categories\n$\\mathcal{L}_T$ and $\\mathcal{P}_T$, providing schematic representations of the\nsemantics of a text $ T $, and reframing the selection of the element with\nmaximum probability as a categorical notion. Additionally, the monoidal\ncategory $\\mathcal{P}_T$ is constructed to visualize various methods of\nextracting semantic information from $T$, offering a dimension-agnostic\ndefinition of semantic spaces reliant solely on information within the text.\n  Furthermore, the paper defines the categories of configurations Conf and word\nembeddings $\\mathcal{Emb}$, accompanied by the concept of divergence as a\ndecoration on $\\mathcal{Emb}$. It establishes a mathematically precise method\nfor comparing word embeddings, demonstrating the equivalence between the GloVe\nand Word2Vec algorithms and the metric MDS algorithm, transitioning from neural\nnetwork algorithms (black box) to a transparent framework. Finally, the paper\npresents a mathematical approach to computing biases before embedding and\noffers insights on mitigating biases at the semantic space level, advancing the\nfield of explainable artificial intelligence."}
{"id": "2508.20810", "pdf": "https://arxiv.org/pdf/2508.20810.pdf", "abs": "https://arxiv.org/abs/2508.20810", "title": "A Graph-Based Test-Harness for LLM Evaluation", "authors": ["Jessica Lundin", "Guillaume Chabot-Couture"], "categories": ["cs.AI", "cs.CL"], "comment": "4 pages, 2 figures, dataset", "summary": "We present a first known prototype of a dynamic, systematic benchmark of\nmedical guidelines for 400+ questions, with 3.3+ trillion possible\ncombinations, covering 100\\% of guideline relationships. We transformed the WHO\nIMCI handbook into a directed graph with 200+ nodes (conditions, symptoms,\ntreatments, follow-ups, severities) and 300+ edges, then used graph traversal\nto generate questions that incorporated age-specific scenarios and contextual\ndistractors to ensure clinical relevance. Our graph-based approach enables\nsystematic evaluation across clinical tasks (45-67\\% accuracy), and we find\nmodels excel at symptom recognition but struggle with triaging severity,\ntreatment protocols and follow-up care, demonstrating how customized benchmarks\ncan identify specific capability gaps that general-domain evaluations miss.\nBeyond evaluation, this dynamic MCQA methodology enhances LLM post-training\n(supervised finetuning, GRPO, DPO), where correct answers provide high-reward\nsamples without expensive human annotation. The graph-based approach\nsuccessfully addresses the coverage limitations of manually curated benchmarks.\nThis methodology is a step toward scalable, contamination-resistant solution\nfor creating comprehensive benchmarks that can be dynamically generated,\nincluding when the guidelines are updated. Code and datasets are available at\nhttps://github.com/jessicalundin/graph_testing_harness"}
{"id": "2508.20869", "pdf": "https://arxiv.org/pdf/2508.20869.pdf", "abs": "https://arxiv.org/abs/2508.20869", "title": "OLMoASR: Open Models and Data for Training Robust Speech Recognition Models", "authors": ["Huong Ngo", "Matt Deitke", "Martijn Bartelds", "Sarah Pratt", "Josh Gardner", "Matt Jordan", "Ludwig Schmidt"], "categories": ["cs.SD", "cs.CL", "cs.LG", "eess.AS"], "comment": "17 pages, 7 figures", "summary": "Improvements in training data scale and quality have led to significant\nadvances, yet its influence in speech recognition remains underexplored. In\nthis paper, we present a large-scale dataset, OLMoASR-Pool, and series of\nmodels, OLMoASR, to study and develop robust zero-shot speech recognition\nmodels. Beginning from OLMoASR-Pool, a collection of 3M hours of English audio\nand 17M transcripts, we design text heuristic filters to remove low-quality or\nmistranscribed data. Our curation pipeline produces a new dataset containing 1M\nhours of high-quality audio-transcript pairs, which we call OLMoASR-Mix. We use\nOLMoASR-Mix to train the OLMoASR-Mix suite of models, ranging from 39M\n(tiny.en) to 1.5B (large.en) parameters. Across all model scales, OLMoASR\nachieves comparable average performance to OpenAI's Whisper on short and\nlong-form speech recognition benchmarks. Notably, OLMoASR-medium.en attains a\n12.8\\% and 11.0\\% word error rate (WER) that is on par with Whisper's largest\nEnglish-only model Whisper-medium.en's 12.4\\% and 10.5\\% WER for short and\nlong-form recognition respectively (at equivalent parameter count).\nOLMoASR-Pool, OLMoASR models, and filtering, training and evaluation code will\nbe made publicly available to further research on robust speech processing."}
{"id": "2508.21010", "pdf": "https://arxiv.org/pdf/2508.21010.pdf", "abs": "https://arxiv.org/abs/2508.21010", "title": "ChainReaction! Structured Approach with Causal Chains as Intermediate Representations for Improved and Explainable Causal Video Question Answering", "authors": ["Paritosh Parmar", "Eric Peh", "Basura Fernando"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.HC", "cs.LG"], "comment": "Project page: https://paritoshparmar.github.io/chainreaction/", "summary": "Existing Causal-Why Video Question Answering (VideoQA) models often struggle\nwith higher-order reasoning, relying on opaque, monolithic pipelines that\nentangle video understanding, causal inference, and answer generation. These\nblack-box approaches offer limited interpretability and tend to depend on\nshallow heuristics. We propose a novel, modular framework that explicitly\ndecouples causal reasoning from answer generation, introducing natural language\ncausal chains as interpretable intermediate representations. Inspired by human\ncognitive models, these structured cause-effect sequences bridge low-level\nvideo content with high-level causal reasoning, enabling transparent and\nlogically coherent inference. Our two-stage architecture comprises a Causal\nChain Extractor (CCE) that generates causal chains from video-question pairs,\nand a Causal Chain-Driven Answerer (CCDA) that produces answers grounded in\nthese chains. To address the lack of annotated reasoning traces, we introduce a\nscalable method for generating high-quality causal chains from existing\ndatasets using large language models. We also propose CauCo, a new evaluation\nmetric for causality-oriented captioning. Experiments on three large-scale\nbenchmarks demonstrate that our approach not only outperforms state-of-the-art\nmodels, but also yields substantial gains in explainability, user trust, and\ngeneralization -- positioning the CCE as a reusable causal reasoning engine\nacross diverse domains. Project page:\nhttps://paritoshparmar.github.io/chainreaction/"}
{"id": "2508.21038", "pdf": "https://arxiv.org/pdf/2508.21038.pdf", "abs": "https://arxiv.org/abs/2508.21038", "title": "On the Theoretical Limitations of Embedding-Based Retrieval", "authors": ["Orion Weller", "Michael Boratko", "Iftekhar Naim", "Jinhyuk Lee"], "categories": ["cs.IR", "cs.CL", "cs.LG"], "comment": null, "summary": "Vector embeddings have been tasked with an ever-increasing set of retrieval\ntasks over the years, with a nascent rise in using them for reasoning,\ninstruction-following, coding, and more. These new benchmarks push embeddings\nto work for any query and any notion of relevance that could be given. While\nprior works have pointed out theoretical limitations of vector embeddings,\nthere is a common assumption that these difficulties are exclusively due to\nunrealistic queries, and those that are not can be overcome with better\ntraining data and larger models. In this work, we demonstrate that we may\nencounter these theoretical limitations in realistic settings with extremely\nsimple queries. We connect known results in learning theory, showing that the\nnumber of top-k subsets of documents capable of being returned as the result of\nsome query is limited by the dimension of the embedding. We empirically show\nthat this holds true even if we restrict to k=2, and directly optimize on the\ntest set with free parameterized embeddings. We then create a realistic dataset\ncalled LIMIT that stress tests models based on these theoretical results, and\nobserve that even state-of-the-art models fail on this dataset despite the\nsimple nature of the task. Our work shows the limits of embedding models under\nthe existing single vector paradigm and calls for future research to develop\nmethods that can resolve this fundamental limitation."}
{"id": "2203.13722", "pdf": "https://arxiv.org/pdf/2203.13722.pdf", "abs": "https://arxiv.org/abs/2203.13722", "title": "Probing Pre-Trained Language Models for Cross-Cultural Differences in Values", "authors": ["Arnav Arora", "Lucie-Aime Kaffee", "Isabelle Augenstein"], "categories": ["cs.CL"], "comment": "Accepted to C3NLP, EACL 2023:\n  https://aclanthology.org/2023.c3nlp-1.12/", "summary": "Language embeds information about social, cultural, and political values\npeople hold. Prior work has explored social and potentially harmful biases\nencoded in Pre-Trained Language models (PTLMs). However, there has been no\nsystematic study investigating how values embedded in these models vary across\ncultures. In this paper, we introduce probes to study which values across\ncultures are embedded in these models, and whether they align with existing\ntheories and cross-cultural value surveys. We find that PTLMs capture\ndifferences in values across cultures, but those only weakly align with\nestablished value surveys. We discuss implications of using mis-aligned models\nin cross-cultural settings, as well as ways of aligning PTLMs with value\nsurveys."}
{"id": "2312.05821", "pdf": "https://arxiv.org/pdf/2312.05821.pdf", "abs": "https://arxiv.org/abs/2312.05821", "title": "ASVD: Activation-aware Singular Value Decomposition for Compressing Large Language Models", "authors": ["Zhihang Yuan", "Yuzhang Shang", "Yue Song", "Dawei Yang", "Qiang Wu", "Yan Yan", "Guangyu Sun"], "categories": ["cs.CL"], "comment": null, "summary": "In this paper, we introduce a new post-training compression paradigm for\nLarge Language Models (LLMs) to facilitate their wider adoption. We delve into\nLLM weight low-rank decomposition, and find that the challenges of this task\nstem from (1) the distribution variance in the LLM activations and (2) the\nsensitivity difference among various kinds of layers. To address these issues,\nwe propose a training-free approach called Activation-aware Singular Value\nDecomposition (ASVD). Specifically, ASVD manages activation outliers by\ntransforming the weight matrix based on the activation distribution. This\ntransformation allows the outliers in the activation matrix to be absorbed into\nthe transformed weight matrix, thereby enhancing decomposition accuracy.\nAdditionally, we propose an efficient iterative calibration process to optimize\nlayer-specific decomposition by addressing the varying sensitivity of different\nLLM layers. In this way, ASVD can compress a network by 10%-30%. Based on the\nsuccess of the low-rank decomposition of projection matrices in the\nself-attention module, we further introduce ASVD to compress the KV cache. By\nreducing the channel dimension of KV activations, memory requirements for KV\ncache can be largely reduced. ASVD can further achieve 50% KV cache reductions\nwithout performance drop in a training-free manner."}
{"id": "2405.07764", "pdf": "https://arxiv.org/pdf/2405.07764.pdf", "abs": "https://arxiv.org/abs/2405.07764", "title": "LGDE: Local Graph-based Dictionary Expansion", "authors": ["Juni Schindler", "Sneha Jha", "Xixuan Zhang", "Kilian Buehling", "Annett Heft", "Mauricio Barahona"], "categories": ["cs.CL", "cs.SI", "physics.soc-ph"], "comment": "Python code available at:\n  https://github.com/barahona-research-group/LGDE", "summary": "We present Local Graph-based Dictionary Expansion (LGDE), a method for\ndata-driven discovery of the semantic neighbourhood of words using tools from\nmanifold learning and network science. At the heart of LGDE lies the creation\nof a word similarity graph from the geometry of word embeddings followed by\nlocal community detection based on graph diffusion. The diffusion in the local\ngraph manifold allows the exploration of the complex nonlinear geometry of word\nembeddings to capture word similarities based on paths of semantic association,\nover and above direct pairwise similarities. Exploiting such semantic\nneighbourhoods enables the expansion of dictionaries of pre-selected keywords,\nan important step for tasks in information retrieval, such as database queries\nand online data collection. We validate LGDE on two user-generated\nEnglish-language corpora and show that LGDE enriches the list of keywords with\nimproved performance relative to methods based on direct word similarities or\nco-occurrences. We further demonstrate our method through a real-world use case\nfrom communication science, where LGDE is evaluated quantitatively on the\nexpansion of a conspiracy-related dictionary from online data collected and\nanalysed by domain experts. Our empirical results and expert user assessment\nindicate that LGDE expands the seed dictionary with more useful keywords due to\nthe manifold-learning-based similarity network."}
{"id": "2405.14862", "pdf": "https://arxiv.org/pdf/2405.14862.pdf", "abs": "https://arxiv.org/abs/2405.14862", "title": "Bitune: Leveraging Bidirectional Attention to Improve Decoder-Only LLMs", "authors": ["Dawid J. Kopiczko", "Tijmen Blankevoort", "Yuki M. Asano"], "categories": ["cs.CL"], "comment": null, "summary": "Decoder-only large language models typically rely solely on masked causal\nattention, which limits their expressiveness by restricting information flow to\none direction. We propose Bitune, a method that enhances pretrained\ndecoder-only LLMs by incorporating bidirectional attention into prompt\nprocessing. We evaluate Bitune in instruction-tuning and question-answering\nsettings, showing significant improvements in performance on commonsense\nreasoning, arithmetic, and language understanding tasks. Furthermore, extensive\nablation studies validate the role of each component of the method, and\ndemonstrate that Bitune is compatible with various parameter-efficient\nfinetuning techniques and full model finetuning."}
{"id": "2405.15165", "pdf": "https://arxiv.org/pdf/2405.15165.pdf", "abs": "https://arxiv.org/abs/2405.15165", "title": "SoAy: A Solution-based LLM API-using Methodology for Academic Information Seeking", "authors": ["Yuanchun Wang", "Jifan Yu", "Zijun Yao", "Jing Zhang", "Yuyang Xie", "Shangqing Tu", "Yiyang Fu", "Youhe Feng", "Jinkai Zhang", "Jingyao Zhang", "Bowen Huang", "Yuanyao Li", "Huihui Yuan", "Lei Hou", "Juanzi Li", "Jie Tang"], "categories": ["cs.CL", "cs.AI", "cs.SE"], "comment": "KDD 2025; 22 pages, 13 figures", "summary": "Applying large language models (LLMs) for academic API usage shows promise in\nreducing researchers' academic information seeking efforts. However, current\nLLM API-using methods struggle with complex API coupling commonly encountered\nin academic queries. To address this, we introduce SoAy, a solution-based LLM\nAPI-using methodology for academic information seeking. It uses code with a\nsolution as the reasoning method, where a solution is a pre-constructed API\ncalling sequence. The addition of the solution reduces the difficulty for the\nmodel to understand the complex relationships between APIs. Code improves the\nefficiency of reasoning.\n  To evaluate SoAy, we introduce SoAyBench, an evaluation benchmark accompanied\nby SoAyEval, built upon a cloned environment of APIs from AMiner. Experimental\nresults demonstrate a 34.58-75.99\\% performance improvement compared to\nstate-of-the-art LLM API-based baselines. All datasets, codes, tuned models,\nand deployed online services are publicly accessible at\nhttps://github.com/RUCKBReasoning/SoAy."}
{"id": "2409.00061", "pdf": "https://arxiv.org/pdf/2409.00061.pdf", "abs": "https://arxiv.org/abs/2409.00061", "title": "Enhancing Natural Language Inference Performance with Knowledge Graph for COVID-19 Automated Fact-Checking in Indonesian Language", "authors": ["Arief Purnama Muharram", "Ayu Purwarianti"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted for publication in the Journal of ICT Research and\n  Applications (JICTRA)", "summary": "Automated fact-checking is a key strategy to overcome the spread of COVID-19\nmisinformation on the internet. These systems typically leverage deep learning\napproaches through Natural Language Inference (NLI) to verify the truthfulness\nof information based on supporting evidence. However, one challenge that arises\nin deep learning is performance stagnation due to a lack of knowledge during\ntraining. This study proposes using a Knowledge Graph (KG) as external\nknowledge to enhance NLI performance for automated COVID-19 fact-checking in\nthe Indonesian language. The proposed model architecture comprises three\nmodules: a fact module, an NLI module, and a classifier module. The fact module\nprocesses information from the KG, while the NLI module handles semantic\nrelationships between the given premise and hypothesis. The representation\nvectors from both modules are concatenated and fed into the classifier module\nto produce the final result. The model was trained using the generated\nIndonesian COVID-19 fact-checking dataset and the COVID-19 KG Bahasa Indonesia.\nOur study demonstrates that incorporating KGs can significantly improve NLI\nperformance in fact-checking, achieving the best accuracy of 0.8616. This\nsuggests that KGs are a valuable component for enhancing NLI performance in\nautomated fact-checking."}
{"id": "2409.15912", "pdf": "https://arxiv.org/pdf/2409.15912.pdf", "abs": "https://arxiv.org/abs/2409.15912", "title": "Explaining word embeddings with perfect fidelity: Case study in research impact prediction", "authors": ["Lucie Dvorackova", "Marcin P. Joachimiak", "Michal Cerny", "Adriana Kubecova", "Vilem Sklenak", "Tomas Kliegr"], "categories": ["cs.CL"], "comment": null, "summary": "The best-performing approaches for scholarly document quality prediction are\nbased on embedding models. In addition to their performance when used in\nclassifiers, embedding models can also provide predictions even for words that\nwere not contained in the labelled training data for the classification model,\nwhich is important in the context of the ever-evolving research terminology.\nAlthough model-agnostic explanation methods, such as Local interpretable\nmodel-agnostic explanations, can be applied to explain machine learning\nclassifiers trained on embedding models, these produce results with\nquestionable correspondence to the model. We introduce a new feature importance\nmethod, Self-model Rated Entities (SMER), for logistic regression-based\nclassification models trained on word embeddings. We show that SMER has\ntheoretically perfect fidelity with the explained model, as the average of\nlogits of SMER scores for individual words (SMER explanation) exactly\ncorresponds to the logit of the prediction of the explained model. Quantitative\nand qualitative evaluation is performed through five diverse experiments\nconducted on 50,000 research articles (papers) from the CORD-19 corpus. Through\nan AOPC curve analysis, we experimentally demonstrate that SMER produces better\nexplanations than LIME, SHAP and global tree surrogates."}
{"id": "2411.07820", "pdf": "https://arxiv.org/pdf/2411.07820.pdf", "abs": "https://arxiv.org/abs/2411.07820", "title": "Query Optimization for Parametric Knowledge Refinement in Retrieval-Augmented Large Language Models", "authors": ["Youan Cong", "Pritom Saha Akash", "Cheng Wang", "Kevin Chen-Chuan Chang"], "categories": ["cs.CL", "cs.IR"], "comment": null, "summary": "We introduce the Extract-Refine-Retrieve-Read (ERRR) framework, a novel\napproach designed to bridge the pre-retrieval information gap in\nRetrieval-Augmented Generation (RAG) systems through query optimization\ntailored to meet the specific knowledge requirements of Large Language Models\n(LLMs). Unlike conventional query optimization techniques used in RAG, the ERRR\nframework begins by extracting parametric knowledge from LLMs, followed by\nusing a specialized query optimizer for refining these queries. This process\nensures the retrieval of only the most pertinent information essential for\ngenerating accurate responses. Moreover, to enhance flexibility and reduce\ncomputational costs, we propose a trainable scheme for our pipeline that\nutilizes a smaller, tunable model as the query optimizer, which is refined\nthrough knowledge distillation from a larger teacher model. Our evaluations on\nvarious question-answering (QA) datasets and with different retrieval systems\nshow that ERRR consistently outperforms existing baselines, proving to be a\nversatile and cost-effective module for improving the utility and accuracy of\nRAG systems."}
{"id": "2412.19512", "pdf": "https://arxiv.org/pdf/2412.19512.pdf", "abs": "https://arxiv.org/abs/2412.19512", "title": "Safeguard Fine-Tuned LLMs Through Pre- and Post-Tuning Model Merging", "authors": ["Hua Farn", "Hsuan Su", "Shachi H Kumar", "Saurav Sahay", "Shang-Tse Chen", "Hung-yi Lee"], "categories": ["cs.CL"], "comment": "EMNLP 2025 Findings", "summary": "Fine-tuning large language models (LLMs) for downstream tasks often leads to\ncatastrophic forgetting, notably degrading the safety of originally aligned\nmodels. While some existing methods attempt to restore safety by incorporating\nadditional safety data, the quality of such data typically falls short of that\nused in the original alignment process. Moreover, these high-quality safety\ndatasets are generally inaccessible, making it difficult to fully recover the\nmodel's original safety. We ask: How can we preserve safety while improving\ndownstream task performance without additional safety data? We show that simply\nmerging the weights of pre- and post-fine-tuned models effectively mitigates\nsafety degradation while enhancing performance. Experiments across different\ndownstream tasks and models validate the method's practicality and\neffectiveness."}
{"id": "2502.19074", "pdf": "https://arxiv.org/pdf/2502.19074.pdf", "abs": "https://arxiv.org/abs/2502.19074", "title": "Improving the quality of Web-mined Parallel Corpora of Low-Resource Languages using Debiasing Heuristics", "authors": ["Aloka Fernando", "Nisansa de Silva", "Menan Velyuthan", "Charitha Rathnayake", "Surangika Ranathunga"], "categories": ["cs.CL"], "comment": null, "summary": "Parallel Data Curation (PDC) techniques aim to filter out noisy parallel\nsentences from the web-mined corpora. Prior research has demonstrated that\nranking sentence pairs using similarity scores on sentence embeddings derived\nfrom Pre-trained Multilingual Language Models (multiPLMs) and training the NMT\nsystems with the top-ranked samples, produces superior NMT performance than\nwhen trained using the full dataset. However, previous research has shown that\nthe choice of multiPLM significantly impacts the ranking quality. This paper\ninvestigates the reasons behind this disparity across multiPLMs. Using the\nweb-mined corpora CCMatrix and CCAligned for En$\\rightarrow$Si,\nEn$\\rightarrow$Ta and Si$\\rightarrow$Ta, we show that different multiPLMs\n(LASER3, XLM-R, and LaBSE) are biased towards certain types of sentences, which\nallows noisy sentences to creep into the top-ranked samples. We show that by\nemploying a series of heuristics, this noise can be removed to a certain\nextent. This results in improving the results of NMT systems trained with\nweb-mined corpora and reduces the disparity across multiPLMs."}
{"id": "2503.11302", "pdf": "https://arxiv.org/pdf/2503.11302.pdf", "abs": "https://arxiv.org/abs/2503.11302", "title": "Are formal and functional linguistic mechanisms dissociated in language models?", "authors": ["Michael Hanna", "Yonatan Belinkov", "Sandro Pezzelle"], "categories": ["cs.CL", "I.2.7"], "comment": "To appear in Computational Linguistics. Pre-MIT Press publication\n  version. 40 pages, 14 figures, 3 tables. Code available at\n  https://github.com/hannamw/formal-functional-dissociation", "summary": "Although large language models (LLMs) are increasingly capable, these\ncapabilities are unevenly distributed: they excel at formal linguistic tasks,\nsuch as producing fluent, grammatical text, but struggle more with functional\nlinguistic tasks like reasoning and consistent fact retrieval. Inspired by\nneuroscience, recent work suggests that to succeed on both formal and\nfunctional linguistic tasks, LLMs should use different mechanisms for each;\nsuch localization could either be built-in or emerge spontaneously through\ntraining. In this paper, we ask: do current models, with fast-improving\nfunctional linguistic abilities, exhibit distinct localization of formal and\nfunctional linguistic mechanisms? We answer this by finding and comparing the\n\"circuits\", or minimal computational subgraphs, responsible for various formal\nand functional tasks. Comparing 5 LLMs across 10 distinct tasks, we find that\nwhile there is indeed little overlap between circuits for formal and functional\ntasks, there is also little overlap between formal linguistic tasks, as exists\nin the human brain. Thus, a single formal linguistic network, unified and\ndistinct from functional task circuits, remains elusive. However, in terms of\ncross-task faithfulness - the ability of one circuit to solve another's task -\nwe observe a separation between formal and functional mechanisms, suggesting\nthat shared mechanisms between formal tasks may exist."}
{"id": "2504.07612", "pdf": "https://arxiv.org/pdf/2504.07612.pdf", "abs": "https://arxiv.org/abs/2504.07612", "title": "SaRoHead: Detecting Satire in a Multi-Domain Romanian News Headline Dataset", "authors": ["Mihnea-Alexandru Vrlan", "Rzvan-Alexandru Smdu", "Dumitru-Clementin Cercel", "Florin Pop", "Mihaela-Claudia Cercel"], "categories": ["cs.CL"], "comment": "13 pages, 2 figures", "summary": "The primary goal of a news headline is to summarize an event in as few words\nas possible. Depending on the media outlet, a headline can serve as a means to\nobjectively deliver a summary or improve its visibility. For the latter,\nspecific publications may employ stylistic approaches that incorporate the use\nof sarcasm, irony, and exaggeration, key elements of a satirical approach. As\nsuch, even the headline must reflect the tone of the satirical main content.\nCurrent approaches for the Romanian language tend to detect the\nnon-conventional tone (i.e., satire and clickbait) of the news content by\ncombining both the main article and the headline. Because we consider a\nheadline to be merely a brief summary of the main article, we investigate in\nthis paper the presence of satirical tone in headlines alone, testing multiple\nbaselines ranging from standard machine learning algorithms to deep learning\nmodels. Our experiments show that Bidirectional Transformer models outperform\nboth standard machine-learning approaches and Large Language Models (LLMs),\nparticularly when the meta-learning Reptile approach is employed."}
{"id": "2504.12140", "pdf": "https://arxiv.org/pdf/2504.12140.pdf", "abs": "https://arxiv.org/abs/2504.12140", "title": "Multilingual Contextualization of Large Language Models for Document-Level Machine Translation", "authors": ["Miguel Moura Ramos", "Patrick Fernandes", "Sweta Agrawal", "Andr F. T. Martins"], "categories": ["cs.CL"], "comment": "COLM 2025", "summary": "Large language models (LLMs) have demonstrated strong performance in\nsentence-level machine translation, but scaling to document-level translation\nremains challenging, particularly in modeling long-range dependencies and\ndiscourse phenomena across sentences and paragraphs. In this work, we propose a\nmethod to improve LLM-based long-document translation through targeted\nfine-tuning on high-quality document-level data, which we curate and introduce\nas DocBlocks. Our approach supports multiple translation paradigms, including\ndirect document-to-document and chunk-level translation, by integrating\ninstructions both with and without surrounding context. This enables models to\nbetter capture cross-sentence dependencies while maintaining strong\nsentence-level translation performance. Experimental results show that\nincorporating multiple translation paradigms improves document-level\ntranslation quality and inference speed compared to prompting and agent-based\nmethods."}
{"id": "2506.11752", "pdf": "https://arxiv.org/pdf/2506.11752.pdf", "abs": "https://arxiv.org/abs/2506.11752", "title": "DART: Distilling Autoregressive Reasoning to Silent Thought", "authors": ["Nan Jiang", "Ziming Wu", "De-Chuan Zhan", "Fuming Lai", "Shaobing Lian"], "categories": ["cs.CL"], "comment": null, "summary": "Chain-of-Thought (CoT) reasoning has significantly advanced Large Language\nModels (LLMs) in solving complex tasks. However, its autoregressive paradigm\nleads to significant computational overhead, hindering its deployment in\nlatency-sensitive applications. To address this, we propose \\textbf{DART}\n(\\textbf{D}istilling \\textbf{A}utoregressive \\textbf{R}easoning to Silent\n\\textbf{T}hought), a self-distillation framework that enables LLMs to replace\nautoregressive CoT with non-autoregressive Silent Thought (ST). Specifically,\nDART introduces two training pathways: the CoT pathway for traditional\nreasoning and the ST pathway for generating answers directly from a few ST\ntokens. The ST pathway utilizes a lightweight Reasoning Evolvement Module (REM)\nto align its hidden states with the CoT pathway, enabling the ST tokens to\nevolve into informative embeddings. During inference, only the ST pathway is\nactivated, leveraging evolving ST tokens to deliver the answer directly.\nExtensive experimental results demonstrate that DART offers significant\nperformance gains compared with existing non-autoregressive baselines without\nextra inference latency, serving as a feasible alternative for efficient\nreasoning."}
{"id": "2506.20083", "pdf": "https://arxiv.org/pdf/2506.20083.pdf", "abs": "https://arxiv.org/abs/2506.20083", "title": "Bridging Compositional and Distributional Semantics: A Survey on Latent Semantic Geometry via AutoEncoder", "authors": ["Yingji Zhang", "Danilo S. Carvalho", "Andr Freitas"], "categories": ["cs.CL"], "comment": "In progress", "summary": "Integrating compositional and symbolic properties into current distributional\nsemantic spaces can enhance the interpretability, controllability,\ncompositionality, and generalisation capabilities of Transformer-based\nauto-regressive language models (LMs). In this survey, we offer a novel\nperspective on latent space geometry through the lens of compositional\nsemantics, a direction we refer to as \\textit{semantic representation\nlearning}. This direction enables a bridge between symbolic and distributional\nsemantics, helping to mitigate the gap between them. We review and compare\nthree mainstream autoencoder architectures-Variational AutoEncoder (VAE),\nVector Quantised VAE (VQVAE), and Sparse AutoEncoder (SAE)-and examine the\ndistinctive latent geometries they induce in relation to semantic structure and\ninterpretability."}
{"id": "2506.22957", "pdf": "https://arxiv.org/pdf/2506.22957.pdf", "abs": "https://arxiv.org/abs/2506.22957", "title": "Agent-to-Agent Theory of Mind: Testing Interlocutor Awareness among Large Language Models", "authors": ["Younwoo Choi", "Changling Li", "Yongjin Yang", "Zhijing Jin"], "categories": ["cs.CL", "cs.AI", "cs.CY", "cs.MA"], "comment": null, "summary": "As large language models (LLMs) are increasingly integrated into multi-agent\nand human-AI systems, understanding their awareness of both self-context and\nconversational partners is essential for ensuring reliable performance and\nrobust safety. While prior work has extensively studied situational awareness\nwhich refers to an LLM's ability to recognize its operating phase and\nconstraints, it has largely overlooked the complementary capacity to identify\nand adapt to the identity and characteristics of a dialogue partner. In this\npaper, we formalize this latter capability as interlocutor awareness and\npresent the first systematic evaluation of its emergence in contemporary LLMs.\nWe examine interlocutor inference across three dimensions-reasoning patterns,\nlinguistic style, and alignment preferences-and show that LLMs reliably\nidentify same-family peers and certain prominent model families, such as GPT\nand Claude. To demonstrate its practical significance, we develop three case\nstudies in which interlocutor awareness both enhances multi-LLM collaboration\nthrough prompt adaptation and introduces new alignment and safety\nvulnerabilities, including reward-hacking behaviors and increased jailbreak\nsusceptibility. Our findings highlight the dual promise and peril of\nidentity-sensitive behavior in LLMs, underscoring the need for further\nunderstanding of interlocutor awareness and new safeguards in multi-agent\ndeployments. Our code is open-sourced at\nhttps://github.com/younwoochoi/InterlocutorAwarenessLLM."}
{"id": "2507.03167", "pdf": "https://arxiv.org/pdf/2507.03167.pdf", "abs": "https://arxiv.org/abs/2507.03167", "title": "Adversarial Manipulation of Reasoning Models using Internal Representations", "authors": ["Kureha Yamaguchi", "Benjamin Etheridge", "Andy Arditi"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Accepted to the ICML 2025 Workshop on Reliable and Responsible\n  Foundation Models (R2FM). 20 pages, 12 figures", "summary": "Reasoning models generate chain-of-thought (CoT) tokens before their final\noutput, but how this affects their vulnerability to jailbreak attacks remains\nunclear. While traditional language models make refusal decisions at the\nprompt-response boundary, we find evidence that DeepSeek-R1-Distill-Llama-8B\nmakes these decisions within its CoT generation. We identify a linear direction\nin activation space during CoT token generation that predicts whether the model\nwill refuse or comply -- termed the \"caution\" direction because it corresponds\nto cautious reasoning patterns in the generated text. Ablating this direction\nfrom model activations increases harmful compliance, effectively jailbreaking\nthe model. We additionally show that intervening only on CoT token activations\nsuffices to control final outputs, and that incorporating this direction into\nprompt-based attacks improves success rates. Our findings suggest that the\nchain-of-thought itself is a promising new target for adversarial manipulation\nin reasoning models. Code available at\nhttps://github.com/ky295/reasoning-manipulation."}
{"id": "2507.06056", "pdf": "https://arxiv.org/pdf/2507.06056.pdf", "abs": "https://arxiv.org/abs/2507.06056", "title": "Entropy-Memorization Law: Evaluating Memorization Difficulty of Data in LLMs", "authors": ["Yizhan Huang", "Zhe Yang", "Meifang Chen", "Jianping Zhang", "Michael R. Lyu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) are known to memorize portions of their training\ndata, sometimes reproducing content verbatim when prompted appropriately. In\nthis work, we investigate a fundamental yet under-explored question in the\ndomain of memorization: How to characterize memorization difficulty of training\ndata in LLMs? Through empirical experiments on OLMo, a family of open models,\nwe present the Entropy-Memorization Law. It suggests that data entropy is\nlinearly correlated with memorization score. Moreover, in a case study of\nmemorizing highly randomized strings, or \"gibberish\", we observe that such\nsequences, despite their apparent randomness, exhibit unexpectedly low\nempirical entropy compared to the broader training corpus. Adopting the same\nstrategy to discover Entropy-Memorization Law, we derive a simple yet effective\napproach to distinguish training and testing data, enabling Dataset Inference\n(DI)."}
{"id": "2507.22931", "pdf": "https://arxiv.org/pdf/2507.22931.pdf", "abs": "https://arxiv.org/abs/2507.22931", "title": "Dynamic Context Compression for Efficient RAG", "authors": ["Shuyu Guo", "Zhaochun Ren"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Retrieval-augmented generation (RAG) enhances large language models (LLMs)\nwith external knowledge but incurs significant inference costs due to lengthy\nretrieved contexts. While context compression mitigates this issue, existing\nmethods apply fixed compression rates, over-compressing simple queries or\nunder-compressing complex ones. We propose Adaptive Context Compression for RAG\n(ACC-RAG), a framework that dynamically adjusts compression rates based on\ninput complexity, optimizing inference efficiency without sacrificing accuracy.\nACC-RAG combines a hierarchical compressor (for multi-granular embeddings) with\na context selector to retain minimal sufficient information, akin to human\nskimming. Evaluated on Wikipedia and five QA datasets, ACC-RAG outperforms\nfixed-rate methods and matches/unlocks over 4 times faster inference versus\nstandard RAG while maintaining or improving accuracy."}
{"id": "2508.02997", "pdf": "https://arxiv.org/pdf/2508.02997.pdf", "abs": "https://arxiv.org/abs/2508.02997", "title": "CoCoTen: Detecting Adversarial Inputs to Large Language Models through Latent Space Features of Contextual Co-occurrence Tensors", "authors": ["Sri Durga Sai Sowmya Kadali", "Evangelos E. Papalexakis"], "categories": ["cs.CL"], "comment": null, "summary": "The widespread use of Large Language Models (LLMs) in many applications marks\na significant advance in research and practice. However, their complexity and\nhard-to-understand nature make them vulnerable to attacks, especially\njailbreaks designed to produce harmful responses. To counter these threats,\ndeveloping strong detection methods is essential for the safe and reliable use\nof LLMs. This paper studies this detection problem using the Contextual\nCo-occurrence Matrix, a structure recognized for its efficacy in data-scarce\nenvironments. We propose a novel method leveraging the latent space\ncharacteristics of Contextual Co-occurrence Matrices and Tensors for the\neffective identification of adversarial and jailbreak prompts. Our evaluations\nshow that this approach achieves a notable F1 score of 0.83 using only 0.5% of\nlabeled prompts, which is a 96.6% improvement over baselines. This result\nhighlights the strength of our learned patterns, especially when labeled data\nis scarce. Our method is also significantly faster, speedup ranging from 2.3 to\n128.4 times compared to the baseline models."}
{"id": "2508.07999", "pdf": "https://arxiv.org/pdf/2508.07999.pdf", "abs": "https://arxiv.org/abs/2508.07999", "title": "WideSearch: Benchmarking Agentic Broad Info-Seeking", "authors": ["Ryan Wong", "Jiawei Wang", "Junjie Zhao", "Li Chen", "Yan Gao", "Long Zhang", "Xuan Zhou", "Zuo Wang", "Kai Xiang", "Ge Zhang", "Wenhao Huang", "Yang Wang", "Ke Wang"], "categories": ["cs.CL"], "comment": null, "summary": "From professional research to everyday planning, many tasks are bottlenecked\nby wide-scale information seeking, which is more repetitive than cognitively\ncomplex. With the rapid development of Large Language Models (LLMs), automated\nsearch agents powered by LLMs offer a promising solution to liberate humans\nfrom this tedious work. However, the capability of these agents to perform such\n\"wide-context\" collection reliably and completely remains largely unevaluated\ndue to a lack of suitable benchmarks. To bridge this gap, we introduce\nWideSearch, a new benchmark engineered to evaluate agent reliability on these\nlarge-scale collection tasks. The benchmark features 200 manually curated\nquestions (100 in English, 100 in Chinese) from over 15 diverse domains,\ngrounded in real user queries. Each task requires agents to collect large-scale\natomic information, which could be verified one by one objectively, and arrange\nit into a well-organized output. A rigorous five-stage quality control pipeline\nensures the difficulty, completeness, and verifiability of the dataset. We\nbenchmark over 10 state-of-the-art agentic search systems, including\nsingle-agent, multi-agent frameworks, and end-to-end commercial systems. Most\nsystems achieve overall success rates near 0\\%, with the best performer\nreaching just 5\\%. However, given sufficient time, cross-validation by multiple\nhuman testers can achieve a near 100\\% success rate. These results demonstrate\nthat present search agents have critical deficiencies in large-scale\ninformation seeking, underscoring urgent areas for future research and\ndevelopment in agentic search. Our dataset, evaluation pipeline, and benchmark\nresults have been publicly released at https://widesearch-seed.github.io/"}
{"id": "2508.08846", "pdf": "https://arxiv.org/pdf/2508.08846.pdf", "abs": "https://arxiv.org/abs/2508.08846", "title": "Steering Towards Fairness: Mitigating Political Bias in LLMs", "authors": ["Afrozah Nadeem", "Mark Dras", "Usman Naseem"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted at CASE@RANLP2025", "summary": "Recent advancements in large language models (LLMs) have enabled their\nwidespread use across diverse real-world applications. However, concerns remain\nabout their tendency to encode and reproduce ideological biases along political\nand economic dimensions. In this paper, we employ a framework for probing and\nmitigating such biases in decoder-based LLMs through analysis of internal model\nrepresentations. Grounded in the Political Compass Test (PCT), this method uses\ncontrastive pairs to extract and compare hidden layer activations from models\nlike Mistral and DeepSeek. We introduce a comprehensive activation extraction\npipeline capable of layer-wise analysis across multiple ideological axes,\nrevealing meaningful disparities linked to political framing. Our results show\nthat decoder LLMs systematically encode representational bias across layers,\nwhich can be leveraged for effective steering vector-based mitigation. This\nwork provides new insights into how political bias is encoded in LLMs and\noffers a principled approach to debiasing beyond surface-level output\ninterventions."}
{"id": "2508.10175", "pdf": "https://arxiv.org/pdf/2508.10175.pdf", "abs": "https://arxiv.org/abs/2508.10175", "title": "Estimating Machine Translation Difficulty", "authors": ["Lorenzo Proietti", "Stefano Perrella", "Vilm Zouhar", "Roberto Navigli", "Tom Kocmi"], "categories": ["cs.CL"], "comment": null, "summary": "Machine translation quality has steadily improved over the years, achieving\nnear-perfect translations in recent benchmarks. These high-quality outputs make\nit difficult to distinguish between state-of-the-art models and to identify\nareas for future improvement. In this context, automatically identifying texts\nwhere machine translation systems struggle holds promise for developing more\ndiscriminative evaluations and guiding future research.\n  In this work, we address this gap by formalizing the task of translation\ndifficulty estimation, defining a text's difficulty based on the expected\nquality of its translations. We introduce a new metric to evaluate difficulty\nestimators and use it to assess both baselines and novel approaches. Finally,\nwe demonstrate the practical utility of difficulty estimators by using them to\nconstruct more challenging benchmarks for machine translation. Our results show\nthat dedicated models outperform both heuristic-based methods and\nLLM-as-a-judge approaches, with Sentinel-src achieving the best performance.\nThus, we release two improved models for difficulty estimation, Sentinel-src-24\nand Sentinel-src-25, which can be used to scan large collections of texts and\nselect those most likely to challenge contemporary machine translation systems."}
{"id": "2508.11017", "pdf": "https://arxiv.org/pdf/2508.11017.pdf", "abs": "https://arxiv.org/abs/2508.11017", "title": "Beyond the Rosetta Stone: Unification Forces in Generalization Dynamics", "authors": ["Carter Blum", "Katja Filippova", "Ann Yuan", "Asma Ghandeharioun", "Julian Zimmert", "Fred Zhang", "Jessica Hoffmann", "Tal Linzen", "Martin Wattenberg", "Lucas Dixon", "Mor Geva"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large language models (LLMs) struggle with cross-lingual knowledge transfer:\nthey hallucinate when asked in one language about facts expressed in a\ndifferent language during training. This work introduces a controlled setting\nto study the causes and dynamics of this phenomenon by training small\nTransformer models from scratch on synthetic multilingual datasets. We identify\na learning phase wherein a model develops either separate or unified\nrepresentations of the same facts across languages, and show that unification\nis essential for cross-lingual transfer. We also show that the degree of\nunification depends on mutual information between facts and training data\nlanguage, and on how easy it is to extract that language. Based on these\ninsights, we develop methods to modulate the level of cross-lingual transfer by\nmanipulating data distribution and tokenization, and we introduce metrics and\nvisualizations to formally characterize their effects on unification. Our work\nshows how controlled settings can shed light on pre-training dynamics and\nsuggests new directions for improving cross-lingual transfer in LLMs."}
{"id": "2508.16188", "pdf": "https://arxiv.org/pdf/2508.16188.pdf", "abs": "https://arxiv.org/abs/2508.16188", "title": "Seeing is Believing: Emotion-Aware Audio-Visual Language Modeling for Expressive Speech Generation", "authors": ["Weiting Tan", "Jiachen Lian", "Hirofumi Inaguma", "Paden Tomasello", "Philipp Koehn", "Xutai Ma"], "categories": ["cs.CL", "cs.CV", "cs.MM", "cs.SD", "eess.AS"], "comment": "EMNLP 2025 (Findings)", "summary": "We present an Audio-Visual Language Model (AVLM) for expressive speech\ngeneration by integrating full-face visual cues into a pre-trained expressive\nspeech model. We explore multiple visual encoders and multimodal fusion\nstrategies during pre-training to identify the most effective integration\napproach. Subsequent fine-tuning on emotion recognition and expressive dialogue\ntasks yields substantial gains over speech-only baselines (e.g., +5 F1 in\nemotion recognition). AVLM highlights the value of expressive visual\ninformation in guiding speech generation and offers a foundation for end-to-end\nmultimodal conversational systems."}
{"id": "2508.18076", "pdf": "https://arxiv.org/pdf/2508.18076.pdf", "abs": "https://arxiv.org/abs/2508.18076", "title": "Neither Valid nor Reliable? Investigating the Use of LLMs as Judges", "authors": ["Khaoula Chehbouni", "Mohammed Haddou", "Jackie Chi Kit Cheung", "Golnoosh Farnadi"], "categories": ["cs.CL", "I.2.7"], "comment": "Prepared for conference submission", "summary": "Evaluating natural language generation (NLG) systems remains a core challenge\nof natural language processing (NLP), further complicated by the rise of large\nlanguage models (LLMs) that aims to be general-purpose. Recently, large\nlanguage models as judges (LLJs) have emerged as a promising alternative to\ntraditional metrics, but their validity remains underexplored. This position\npaper argues that the current enthusiasm around LLJs may be premature, as their\nadoption has outpaced rigorous scrutiny of their reliability and validity as\nevaluators. Drawing on measurement theory from the social sciences, we identify\nand critically assess four core assumptions underlying the use of LLJs: their\nability to act as proxies for human judgment, their capabilities as evaluators,\ntheir scalability, and their cost-effectiveness. We examine how each of these\nassumptions may be challenged by the inherent limitations of LLMs, LLJs, or\ncurrent practices in NLG evaluation. To ground our analysis, we explore three\napplications of LLJs: text summarization, data annotation, and safety\nalignment. Finally, we highlight the need for more responsible evaluation\npractices in LLJs evaluation, to ensure that their growing role in the field\nsupports, rather than undermines, progress in NLG."}
{"id": "2508.18321", "pdf": "https://arxiv.org/pdf/2508.18321.pdf", "abs": "https://arxiv.org/abs/2508.18321", "title": "LLMs Can't Handle Peer Pressure: Crumbling under Multi-Agent Social Interactions", "authors": ["Maojia Song", "Tej Deep Pala", "Weisheng Jin", "Amir Zadeh", "Chuan Li", "Dorien Herremans", "Soujanya Poria"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large language models (LLMs) are increasingly deployed in multi-agent systems\n(MAS) as components of collaborative intelligence, where peer interactions\ndynamically shape individual decision-making. Although prior work has focused\non conformity bias, we extend the analysis to examine how LLMs form trust from\nprevious impressions, resist misinformation, and integrate peer input during\ninteraction, key factors for achieving collective intelligence under complex\nsocial dynamics. We present KAIROS, a benchmark simulating quiz contests with\npeer agents of varying reliability, offering fine-grained control over\nconditions such as expert-novice roles, noisy crowds, and adversarial peers.\nLLMs receive both historical interactions and current peer responses, allowing\nsystematic investigation into how trust, peer action, and self-confidence\ninfluence decisions. As for mitigation strategies, we evaluate prompting,\nsupervised fine-tuning, and reinforcement learning, Group Relative Policy\nOptimisation (GRPO), across multiple models. Our results reveal that GRPO with\nmulti-agent context combined with outcome-based rewards and unconstrained\nreasoning achieves the best overall performance, but also decreases the\nrobustness to social influence compared to Base models. The code and datasets\nare available at: https://github.com/declare-lab/KAIROS."}
{"id": "2508.19720", "pdf": "https://arxiv.org/pdf/2508.19720.pdf", "abs": "https://arxiv.org/abs/2508.19720", "title": "Continuously Steering LLMs Sensitivity to Contextual Knowledge with Proxy Models", "authors": ["Yilin Wang", "Heng Wang", "Yuyang Bai", "Minnan Luo"], "categories": ["cs.CL"], "comment": null, "summary": "In Large Language Models (LLMs) generation, there exist knowledge conflicts\nand scenarios where parametric knowledge contradicts knowledge provided in the\ncontext. Previous works studied tuning, decoding algorithms, or locating and\nediting context-aware neurons to adapt LLMs to be faithful to new contextual\nknowledge. However, they are usually inefficient or ineffective for large\nmodels, not workable for black-box models, or unable to continuously adjust\nLLMs' sensitivity to the knowledge provided in the context. To mitigate these\nproblems, we propose CSKS (Continuously Steering Knowledge Sensitivity), a\nsimple framework that can steer LLMs' sensitivity to contextual knowledge\ncontinuously at a lightweight cost. Specifically, we tune two small LMs (i.e.\nproxy models) and use the difference in their output distributions to shift the\noriginal distribution of an LLM without modifying the LLM weights. In the\nevaluation process, we not only design synthetic data and fine-grained metrics\nto measure models' sensitivity to contextual knowledge but also use a real\nconflict dataset to validate CSKS's practical efficacy. Extensive experiments\ndemonstrate that our framework achieves continuous and precise control over\nLLMs' sensitivity to contextual knowledge, enabling both increased sensitivity\nand reduced sensitivity, thereby allowing LLMs to prioritize either contextual\nor parametric knowledge as needed flexibly. Our data and code are available at\nhttps://github.com/OliveJuiceLin/CSKS."}
{"id": "2508.19724", "pdf": "https://arxiv.org/pdf/2508.19724.pdf", "abs": "https://arxiv.org/abs/2508.19724", "title": "NLKI: A lightweight Natural Language Knowledge Integration Framework for Improving Small VLMs in Commonsense VQA Tasks", "authors": ["Aritra Dutta", "Swapnanil Mukherjee", "Deepanway Ghosal", "Somak Aditya"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Commonsense visual-question answering often hinges on knowledge that is\nmissing from the image or the question. Small vision-language models (sVLMs)\nsuch as ViLT, VisualBERT and FLAVA therefore lag behind their larger generative\ncounterparts. To study the effect of careful commonsense knowledge integration\non sVLMs, we present an end-to-end framework (NLKI) that (i) retrieves natural\nlanguage facts, (ii) prompts an LLM to craft natural language explanations, and\n(iii) feeds both signals to sVLMs respectively across two commonsense VQA\ndatasets (CRIC, AOKVQA) and a visual-entailment dataset (e-SNLI-VE). Facts\nretrieved using a fine-tuned ColBERTv2 and an object information-enriched\nprompt yield explanations that largely cut down hallucinations, while lifting\nthe end-to-end answer accuracy by up to 7% (across 3 datasets), making FLAVA\nand other models in NLKI match or exceed medium-sized VLMs such as Qwen-2 VL-2B\nand SmolVLM-2.5B. As these benchmarks contain 10-25% label noise, additional\nfinetuning using noise-robust losses (such as symmetric cross entropy and\ngeneralised cross entropy) adds another 2.5% in CRIC, and 5.5% in AOKVQA. Our\nfindings expose when LLM-based commonsense knowledge beats retrieval from\ncommonsense knowledge bases, how noise-aware training stabilises small models\nin the context of external knowledge augmentation, and why parameter-efficient\ncommonsense reasoning is now within reach for 250M models."}
{"id": "2508.19997", "pdf": "https://arxiv.org/pdf/2508.19997.pdf", "abs": "https://arxiv.org/abs/2508.19997", "title": "Selective Retrieval-Augmentation for Long-Tail Legal Text Classification", "authors": ["Boheng Mao"], "categories": ["cs.CL", "cs.IR"], "comment": null, "summary": "Legal text classification is a fundamental NLP task in the legal domain.\nBenchmark datasets in this area often exhibit a long-tail label distribution,\nwhere many labels are underrepresented, leading to poor model performance on\nrare classes. This paper proposes Selective Retrieval-Augmentation (SRA) as a\nsolution to this problem. SRA focuses on augmenting samples belonging to\nlow-frequency labels in the training set, preventing the introduction of noise\nfor well-represented classes, and requires no changes to the model\narchitecture. Retrieval is performed only from the training data to ensure\nthere is no potential information leakage, removing the need for external\ncorpora simultaneously. The proposed SRA method is tested on two legal text\nclassification benchmark datasets with long-tail distributions: LEDGAR\n(single-label) and UNFAIR-ToS (multi-label). The results indicate that SRA\nattains higher micro-F1 and macro-F1 scores compared to all current LexGLUE\nbaselines across both datasets, illustrating consistent improvements in\nlong-tail legal text classification."}
{"id": "2508.20038", "pdf": "https://arxiv.org/pdf/2508.20038.pdf", "abs": "https://arxiv.org/abs/2508.20038", "title": "Forewarned is Forearmed: Pre-Synthesizing Jailbreak-like Instructions to Enhance LLM Safety Guardrail to Potential Attacks", "authors": ["Sheng Liu", "Qiang Sheng", "Danding Wang", "Yang Li", "Guang Yang", "Juan Cao"], "categories": ["cs.CL"], "comment": "EMNLP 2025 findings", "summary": "Despite advances in improving large language model (LLM) to refuse to answer\nmalicious instructions, widely used LLMs remain vulnerable to jailbreak attacks\nwhere attackers generate instructions with distributions differing from safety\nalignment corpora. New attacks expose LLMs' inability to recognize unseen\nmalicious instructions, highlighting a critical distributional mismatch between\ntraining data and real-world attacks that forces developers into reactive\npatching cycles. To tackle this challenge, we propose IMAGINE, a synthesis\nframework that leverages embedding space distribution analysis to generate\njailbreak-like instructions. This approach effectively fills the distributional\ngap between authentic jailbreak patterns and safety alignment corpora. IMAGINE\nfollows an iterative optimization process that dynamically evolves text\ngeneration distributions across iterations, thereby augmenting the coverage of\nsafety alignment data distributions through synthesized data examples. Based on\nthe safety-aligned corpus enhanced through IMAGINE, our framework demonstrates\nsignificant decreases in attack success rate on Qwen2.5, Llama3.1, and Llama3.2\nwithout compromising their utility."}
{"id": "2508.20047", "pdf": "https://arxiv.org/pdf/2508.20047.pdf", "abs": "https://arxiv.org/abs/2508.20047", "title": "AraHealthQA 2025: The First Shared Task on Arabic Health Question Answering", "authors": ["Hassan Alhuzali", "Farah Shamout", "Muhammad Abdul-Mageed", "Chaimae Abouzahir", "Mouath Abu-Daoud", "Ashwag Alasmari", "Walid Al-Eisawi", "Renad Al-Monef", "Ali Alqahtani", "Lama Ayash", "Nizar Habash", "Leen Kharouf"], "categories": ["cs.CL"], "comment": null, "summary": "We introduce {AraHealthQA 2025}, the {Comprehensive Arabic Health Question\nAnswering Shared Task}, held in conjunction with {ArabicNLP 2025} (co-located\nwith EMNLP 2025). This shared task addresses the paucity of high-quality Arabic\nmedical QA resources by offering two complementary tracks: {MentalQA}, focusing\non Arabic mental health Q\\&A (e.g., anxiety, depression, stigma reduction), and\n{MedArabiQ}, covering broader medical domains such as internal medicine,\npediatrics, and clinical decision making. Each track comprises multiple\nsubtasks, evaluation datasets, and standardized metrics, facilitating fair\nbenchmarking. The task was structured to promote modeling under realistic,\nmultilingual, and culturally nuanced healthcare contexts. We outline the\ndataset creation, task design and evaluation framework, participation\nstatistics, baseline systems, and summarize the overall outcomes. We conclude\nwith reflections on the performance trends observed and prospects for future\niterations in Arabic health QA."}
{"id": "2212.07126", "pdf": "https://arxiv.org/pdf/2212.07126.pdf", "abs": "https://arxiv.org/abs/2212.07126", "title": "Explainability of Text Processing and Retrieval Methods: A Survey", "authors": ["Sourav Saha", "Debapriyo Majumdar", "Mandar Mitra"], "categories": ["cs.IR", "cs.AI", "cs.CL"], "comment": null, "summary": "Deep Learning and Machine Learning based models have become extremely popular\nin text processing and information retrieval. However, the non-linear\nstructures present inside the networks make these models largely inscrutable. A\nsignificant body of research has focused on increasing the transparency of\nthese models. This article provides a broad overview of research on the\nexplainability and interpretability of natural language processing and\ninformation retrieval methods. More specifically, we survey approaches that\nhave been applied to explain word embeddings, sequence modeling, attention\nmodules, transformers, BERT, and document ranking. The concluding section\nsuggests some possible directions for future research on this topic."}
{"id": "2301.06375", "pdf": "https://arxiv.org/pdf/2301.06375.pdf", "abs": "https://arxiv.org/abs/2301.06375", "title": "OLKAVS: An Open Large-Scale Korean Audio-Visual Speech Dataset", "authors": ["Jeongkyun Park", "Jung-Wook Hwang", "Kwanghee Choi", "Seung-Hyun Lee", "Jun Hwan Ahn", "Rae-Hong Park", "Hyung-Min Park"], "categories": ["cs.MM", "cs.AI", "cs.CL", "cs.CV", "cs.LG", "cs.SD"], "comment": "Accepted to ICASSP 2024", "summary": "Inspired by humans comprehending speech in a multi-modal manner, various\naudio-visual datasets have been constructed. However, most existing datasets\nfocus on English, induce dependencies with various prediction models during\ndataset preparation, and have only a small number of multi-view videos. To\nmitigate the limitations, we recently developed the Open Large-scale Korean\nAudio-Visual Speech (OLKAVS) dataset, which is the largest among publicly\navailable audio-visual speech datasets. The dataset contains 1,150 hours of\ntranscribed audio from 1,107 Korean speakers in a studio setup with nine\ndifferent viewpoints and various noise situations. We also provide the\npre-trained baseline models for two tasks, audio-visual speech recognition and\nlip reading. We conducted experiments based on the models to verify the\neffectiveness of multi-modal and multi-view training over uni-modal and\nfrontal-view-only training. We expect the OLKAVS dataset to facilitate\nmulti-modal research in broader areas such as Korean speech recognition,\nspeaker recognition, pronunciation level classification, and mouth motion\nanalysis."}
{"id": "2402.10659", "pdf": "https://arxiv.org/pdf/2402.10659.pdf", "abs": "https://arxiv.org/abs/2402.10659", "title": "Network Formation and Dynamics Among Multi-LLMs", "authors": ["Marios Papachristou", "Yuan Yuan"], "categories": ["cs.SI", "cs.AI", "cs.CL", "cs.MA"], "comment": null, "summary": "Social networks profoundly influence how humans form opinions, exchange\ninformation, and organize collectively. As large language models (LLMs) are\nincreasingly embedded into social and professional environments, it is critical\nto understand whether their interactions approximate human-like network\ndynamics. We develop a framework to study the network formation behaviors of\nmultiple LLM agents and benchmark them against human decisions. Across\nsynthetic and real-world settings, including friendship, telecommunication, and\nemployment networks, we find that LLMs consistently reproduce fundamental\nmicro-level principles such as preferential attachment, triadic closure, and\nhomophily, as well as macro-level properties including community structure and\nsmall-world effects. Importantly, the relative emphasis of these principles\nadapts to context: for example, LLMs favor homophily in friendship networks but\nheterophily in organizational settings, mirroring patterns of social mobility.\nA controlled human-subject survey confirms strong alignment between LLMs and\nhuman participants in link-formation decisions. These results establish that\nLLMs can serve as powerful tools for social simulation and synthetic data\ngeneration, while also raising critical questions about bias, fairness, and the\ndesign of AI systems that participate in human networks."}
{"id": "2411.19770", "pdf": "https://arxiv.org/pdf/2411.19770.pdf", "abs": "https://arxiv.org/abs/2411.19770", "title": "Noro: Noise-Robust One-shot Voice Conversion with Hidden Speaker Representation Learning", "authors": ["Haorui He", "Yuchen Song", "Yuancheng Wang", "Haoyang Li", "Xueyao Zhang", "Li Wang", "Gongping Huang", "Eng Siong Chng", "Zhizheng Wu"], "categories": ["cs.SD", "cs.CL", "eess.AS"], "comment": "Accepted by APSIPA ASC 2025", "summary": "The effectiveness of one-shot voice conversion (VC) decreases in real-world\nscenarios where reference speeches, which are often sourced from the internet,\ncontain various disturbances like background noise. To address this issue, we\nintroduce Noro, a noise-robust one-shot VC system. Noro features innovative\ncomponents tailored for VC using noisy reference speeches, including a\ndual-branch reference encoding module and a noise-agnostic contrastive speaker\nloss. Experimental results demonstrate that Noro outperforms our baseline\nsystem in both clean and noisy scenarios, highlighting its efficacy for\nreal-world applications. Additionally, we investigate the hidden speaker\nrepresentation capabilities of our baseline system by repurposing its reference\nencoder as a speaker encoder. The results show that it is competitive with\nseveral advanced self-supervised learning models for speaker representation\nunder the SUPERB settings, highlighting the potential for advancing speaker\nrepresentation learning through one-shot VC tasks."}
{"id": "2503.11519", "pdf": "https://arxiv.org/pdf/2503.11519.pdf", "abs": "https://arxiv.org/abs/2503.11519", "title": "Exploring Typographic Visual Prompts Injection Threats in Cross-Modality Generation Models", "authors": ["Hao Cheng", "Erjia Xiao", "Yichi Wang", "Lingfeng Zhang", "Qiang Zhang", "Jiahang Cao", "Kaidi Xu", "Mengshu Sun", "Xiaoshuai Hao", "Jindong Gu", "Renjing Xu"], "categories": ["cs.CV", "cs.CL"], "comment": "This paper is accepted by IJCAI2025 Workshop on Deepfake Detection,\n  Localization, and Interpretability", "summary": "Current Cross-Modality Generation Models (GMs) demonstrate remarkable\ncapabilities in various generative tasks. Given the ubiquity and information\nrichness of vision modality inputs in real-world scenarios, Cross-Vision tasks,\nencompassing Vision-Language Perception (VLP) and Image-to-Image (I2I), have\nattracted significant attention. Large Vision Language Models (LVLMs) and I2I\nGeneration Models (GMs) are employed to handle VLP and I2I tasks, respectively.\nPrevious research indicates that printing typographic words into input images\nsignificantly induces LVLMs and I2I GMs to produce disruptive outputs that are\nsemantically aligned with those words. Additionally, visual prompts, as a more\nsophisticated form of typography, are also revealed to pose security risks to\nvarious applications of cross-vision tasks. However, the specific\ncharacteristics of the threats posed by visual prompts remain underexplored. In\nthis paper, to comprehensively investigate the performance impact induced by\nTypographic Visual Prompt Injection (TVPI) in various LVLMs and I2I GMs, we\npropose the Typographic Visual Prompts Injection Dataset and thoroughly\nevaluate the TVPI security risks on various open-source and closed-source LVLMs\nand I2I GMs under visual prompts with different target semantics, deepening the\nunderstanding of TVPI threats."}
{"id": "2505.10583", "pdf": "https://arxiv.org/pdf/2505.10583.pdf", "abs": "https://arxiv.org/abs/2505.10583", "title": "Relative Drawing Identification Complexity is Invariant to Modality in Vision-Language Models", "authors": ["Diogo Freitas", "Brigt Hvardstun", "Csar Ferri", "Daro Garigliotti", "Jan Arne Telle", "Jos Hernndez-Orallo"], "categories": ["cs.CV", "cs.CL", "I.2.7; I.2.10"], "comment": "54 pages (42 pages of appendix). Accepted for publication at the ECAI\n  2025 conference", "summary": "Large language models have become multimodal, and many of them are said to\nintegrate their modalities using common representations. If this were true, a\ndrawing of a car as an image, for instance, should map to a similar area in the\nlatent space as a textual description of the strokes that form the drawing. To\nexplore this in a black-box access regime to these models, we propose the use\nof machine teaching, a theory that studies the minimal set of examples a\nteacher needs to choose so that the learner captures the concept. In this\npaper, we evaluate the complexity of teaching vision-language models a subset\nof objects in the Quick, Draw! dataset using two presentations: raw images as\nbitmaps and trace coordinates in TikZ format. The results indicate that\nimage-based representations generally require fewer segments and achieve higher\naccuracy than coordinate-based representations. But, surprisingly, the teaching\nsize usually ranks concepts similarly across both modalities, even when\ncontrolling for (a human proxy of) concept priors, suggesting that the\nsimplicity of concepts may be an inherent property that transcends modality\nrepresentations."}
{"id": "2505.17553", "pdf": "https://arxiv.org/pdf/2505.17553.pdf", "abs": "https://arxiv.org/abs/2505.17553", "title": "CoMoE: Contrastive Representation for Mixture-of-Experts in Parameter-Efficient Fine-tuning", "authors": ["Jinyuan Feng", "Chaopeng Wei", "Tenghai Qiu", "Tianyi Hu", "Zhiqiang Pu"], "categories": ["cs.LG", "cs.CL"], "comment": "Accepted by EMNLP Findings 2025", "summary": "In parameter-efficient fine-tuning, mixture-of-experts (MoE), which involves\nspecializing functionalities into different experts and sparsely activating\nthem appropriately, has been widely adopted as a promising approach to\ntrade-off between model capacity and computation overhead. However, current MoE\nvariants fall short on heterogeneous datasets, ignoring the fact that experts\nmay learn similar knowledge, resulting in the underutilization of MoE's\ncapacity. In this paper, we propose Contrastive Representation for MoE (CoMoE),\na novel method to promote modularization and specialization in MoE, where the\nexperts are trained along with a contrastive objective by sampling from\nactivated and inactivated experts in top-k routing. We demonstrate that such a\ncontrastive objective recovers the mutual-information gap between inputs and\nthe two types of experts. Experiments on several benchmarks and in multi-task\nsettings demonstrate that CoMoE can consistently enhance MoE's capacity and\npromote modularization among the experts."}
{"id": "2506.06294", "pdf": "https://arxiv.org/pdf/2506.06294.pdf", "abs": "https://arxiv.org/abs/2506.06294", "title": "GLProtein: Global-and-Local Structure Aware Protein Representation Learning", "authors": ["Yunqing Liu", "Wenqi Fan", "Xiaoyong Wei", "Qing Li"], "categories": ["cs.LG", "cs.AI", "cs.CL", "q-bio.BM"], "comment": "Accepted to EMNLP 2025 Findings", "summary": "Proteins are central to biological systems, participating as building blocks\nacross all forms of life. Despite advancements in understanding protein\nfunctions through protein sequence analysis, there remains potential for\nfurther exploration in integrating protein structural information. We argue\nthat the structural information of proteins is not only limited to their 3D\ninformation but also encompasses information from amino acid molecules (local\ninformation) to protein-protein structure similarity (global information). To\naddress this, we propose \\textbf{GLProtein}, the first framework in protein\npre-training that incorporates both global structural similarity and local\namino acid details to enhance prediction accuracy and functional insights.\nGLProtein innovatively combines protein-masked modelling with triplet structure\nsimilarity scoring, protein 3D distance encoding and substructure-based amino\nacid molecule encoding. Experimental results demonstrate that GLProtein\noutperforms previous methods in several bioinformatics tasks, including\npredicting protein-protein interaction, contact prediction, and so on."}
{"id": "2507.17232", "pdf": "https://arxiv.org/pdf/2507.17232.pdf", "abs": "https://arxiv.org/abs/2507.17232", "title": "A Highly Clean Recipe Dataset with Ingredient States Annotation for State Probing Task", "authors": ["Mashiro Toyooka", "Kiyoharu Aizawa", "Yoko Yamakata"], "categories": ["cs.MM", "cs.AI", "cs.CL"], "comment": "Accepted to ACM Multimedia 2025. The dataset are publicly available\n  at: https://huggingface.co/datasets/mashi6n/nhkrecipe-100-anno-1", "summary": "Large Language Models (LLMs) are trained on a vast amount of procedural\ntexts, but they do not directly observe real-world phenomena. In the context of\ncooking recipes, this poses a challenge, as intermediate states of ingredients\nare often omitted, making it difficult for models to track ingredient states\nand understand recipes accurately. In this paper, we apply state probing, a\nmethod for evaluating a language model's understanding of the world, to the\ndomain of cooking. We propose a new task and dataset for evaluating how well\nLLMs can recognize intermediate ingredient states during cooking procedures. We\nfirst construct a new Japanese recipe dataset with clear and accurate\nannotations of ingredient state changes, collected from well-structured and\ncontrolled recipe texts. Using this dataset, we design three novel tasks to\nevaluate whether LLMs can track ingredient state transitions and identify\ningredients present at intermediate steps. Our experiments with widely used\nLLMs, such as Llama3.1-70B and Qwen2.5-72B, show that learning ingredient state\nknowledge improves their understanding of cooking processes, achieving\nperformance comparable to commercial LLMs. The dataset are publicly available\nat: https://huggingface.co/datasets/mashi6n/nhkrecipe-100-anno-1"}
{"id": "2508.16201", "pdf": "https://arxiv.org/pdf/2508.16201.pdf", "abs": "https://arxiv.org/abs/2508.16201", "title": "SpecVLM: Enhancing Speculative Decoding of Video LLMs via Verifier-Guided Token Pruning", "authors": ["Yicheng Ji", "Jun Zhang", "Heming Xia", "Jinpeng Chen", "Lidan Shou", "Gang Chen", "Huan Li"], "categories": ["cs.CV", "cs.AI", "cs.CL"], "comment": "Accepted at EMNLP 2025 Main", "summary": "Video large language models (Vid-LLMs) have shown strong capabilities in\nunderstanding video content. However, their reliance on dense video token\nrepresentations introduces substantial memory and computational overhead in\nboth prefilling and decoding. To mitigate the information loss of recent video\ntoken reduction methods and accelerate the decoding stage of Vid-LLMs\nlosslessly, we introduce SpecVLM, a training-free speculative decoding (SD)\nframework tailored for Vid-LLMs that incorporates staged video token pruning.\nBuilding on our novel finding that the draft model's speculation exhibits low\nsensitivity to video token pruning, SpecVLM prunes up to 90% of video tokens to\nenable efficient speculation without sacrificing accuracy. To achieve this, we\nperforms a two-stage pruning process: Stage I selects highly informative tokens\nguided by attention signals from the verifier (target model), while Stage II\nprunes remaining redundant ones in a spatially uniform manner. Extensive\nexperiments on four video understanding benchmarks demonstrate the\neffectiveness and robustness of SpecVLM, which achieves up to 2.68$\\times$\ndecoding speedup for LLaVA-OneVision-72B and 2.11$\\times$ speedup for\nQwen2.5-VL-32B. Code is available at https://github.com/zju-jiyicheng/SpecVLM."}
{"id": "2508.16599", "pdf": "https://arxiv.org/pdf/2508.16599.pdf", "abs": "https://arxiv.org/abs/2508.16599", "title": "Humans Perceive Wrong Narratives from AI Reasoning Texts", "authors": ["Mosh Levy", "Zohar Elyoseph", "Yoav Goldberg"], "categories": ["cs.HC", "cs.AI", "cs.CL"], "comment": null, "summary": "A new generation of AI models generates step-by-step reasoning text before\nproducing an answer. This text appears to offer a human-readable window into\ntheir computation process, and is increasingly relied upon for transparency and\ninterpretability. However, it is unclear whether human understanding of this\ntext matches the model's actual computational process. In this paper, we\ninvestigate a necessary condition for correspondence: the ability of humans to\nidentify which steps in a reasoning text causally influence later steps. We\nevaluated humans on this ability by composing questions based on counterfactual\nmeasurements and found a significant discrepancy: participant accuracy was only\n29%, barely above chance (25%), and remained low (42%) even when evaluating the\nmajority vote on questions with high agreement. Our results reveal a\nfundamental gap between how humans interpret reasoning texts and how models use\nit, challenging its utility as a simple interpretability tool. We argue that\nreasoning texts should be treated as an artifact to be investigated, not taken\nat face value, and that understanding the non-human ways these models use\nlanguage is a critical research direction."}
{"id": "2508.17068", "pdf": "https://arxiv.org/pdf/2508.17068.pdf", "abs": "https://arxiv.org/abs/2508.17068", "title": "Anemoi: A Semi-Centralized Multi-agent System Based on Agent-to-Agent Communication MCP server from Coral Protocol", "authors": ["Xinxing Ren", "Caelum Forder", "Qianbo Zang", "Ahsen Tahir", "Roman J. Georgio", "Suman Deb", "Peter Carroll", "nder Grcan", "Zekun Guo"], "categories": ["cs.MA", "cs.CL"], "comment": null, "summary": "Recent advances in generalist multi-agent systems (MAS) have largely followed\na context-engineering plus centralized paradigm, where a planner agent\ncoordinates multiple worker agents through unidirectional prompt passing. While\neffective under strong planner models, this design suffers from two critical\nlimitations: (1) strong dependency on the planner's capability, which leads to\ndegraded performance when a smaller LLM powers the planner; and (2) limited\ninter-agent communication, where collaboration relies on costly prompt\nconcatenation and context injection, introducing redundancy and information\nloss. To address these challenges, we propose Anemoi, a semi-centralized MAS\nbuilt on the Agent-to-Agent (A2A) communication MCP server from Coral Protocol.\nUnlike traditional designs, Anemoi enables structured and direct inter-agent\ncollaboration, allowing all agents to monitor progress, assess results,\nidentify bottlenecks, and propose refinements in real time. This paradigm\nreduces reliance on a single planner, supports adaptive plan updates, and\nminimizes redundant context passing, resulting in more scalable and\ncost-efficient execution. Evaluated on the GAIA benchmark, Anemoi achieved\n52.73% accuracy with a small LLM (GPT-4.1-mini) as the planner, surpassing the\nstrongest open-source baseline OWL (43.63%) by +9.09% under identical LLM\nsettings. Our implementation is publicly available at\nhttps://github.com/Coral-Protocol/Anemoi."}
{"id": "2508.18642", "pdf": "https://arxiv.org/pdf/2508.18642.pdf", "abs": "https://arxiv.org/abs/2508.18642", "title": "RLMR: Reinforcement Learning with Mixed Rewards for Creative Writing", "authors": ["Jianxing Liao", "Tian Zhang", "Xiao Feng", "Yusong Zhang", "Rui Yang", "Haorui Wang", "Bosi Wen", "Ziying Wang", "Runzhi Shi"], "categories": ["cs.AI", "cs.CL"], "comment": null, "summary": "Large language models are extensively utilized in creative writing\napplications. Creative writing requires a balance between subjective writing\nquality (e.g., literariness and emotional expression) and objective constraint\nfollowing (e.g., format requirements and word limits). Existing methods find it\ndifficult to balance these two aspects: single reward strategies fail to\nimprove both abilities simultaneously, while fixed-weight mixed-reward methods\nlack the ability to adapt to different writing scenarios. To address this\nproblem, we propose Reinforcement Learning with Mixed Rewards (RLMR), utilizing\na dynamically mixed reward system from a writing reward model evaluating\nsubjective writing quality and a constraint verification model assessing\nobjective constraint following. The constraint following reward weight is\nadjusted dynamically according to the writing quality within sampled groups,\nensuring that samples violating constraints get negative advantage in GRPO and\nthus penalized during training, which is the key innovation of this proposed\nmethod. We conduct automated and manual evaluations across diverse model\nfamilies from 8B to 72B parameters. Additionally, we construct a real-world\nwriting benchmark named WriteEval for comprehensive evaluation. Results\nillustrate that our method achieves consistent improvements in both instruction\nfollowing (IFEval from 83.36% to 86.65%) and writing quality (72.75% win rate\nin manual expert pairwise evaluations on WriteEval). To the best of our\nknowledge, RLMR is the first work to combine subjective preferences with\nobjective verification in online RL training, providing an effective solution\nfor multi-dimensional creative writing optimization."}
{"id": "2508.19200", "pdf": "https://arxiv.org/pdf/2508.19200.pdf", "abs": "https://arxiv.org/abs/2508.19200", "title": "The Ramon Llull's Thinking Machine for Automated Ideation", "authors": ["Xinran Zhao", "Boyuan Zheng", "Chenglei Si", "Haofei Yu", "Ken Liu", "Runlong Zhou", "Ruochen Li", "Tong Chen", "Xiang Li", "Yiming Zhang", "Tongshuang Wu"], "categories": ["cs.AI", "cs.CL"], "comment": "21 pages, 3 figures", "summary": "This paper revisits Ramon Llull's Ars combinatoria - a medieval framework for\ngenerating knowledge through symbolic recombination - as a conceptual\nfoundation for building a modern Llull's thinking machine for research\nideation. Our approach defines three compositional axes: Theme (e.g.,\nefficiency, adaptivity), Domain (e.g., question answering, machine\ntranslation), and Method (e.g., adversarial training, linear attention). These\nelements represent high-level abstractions common in scientific work -\nmotivations, problem settings, and technical approaches - and serve as building\nblocks for LLM-driven exploration. We mine elements from human experts or\nconference papers and show that prompting LLMs with curated combinations\nproduces research ideas that are diverse, relevant, and grounded in current\nliterature. This modern thinking machine offers a lightweight, interpretable\ntool for augmenting scientific creativity and suggests a path toward\ncollaborative ideation between humans and AI."}
