{"id": "2509.03525", "pdf": "https://arxiv.org/pdf/2509.03525.pdf", "abs": "https://arxiv.org/abs/2509.03525", "title": "Speech-Based Cognitive Screening: A Systematic Evaluation of LLM Adaptation Strategies", "authors": ["Fatemeh Taherinezhad", "Mohamad Javad Momeni Nezhad", "Sepehr Karimi", "Sina Rashidi", "Ali Zolnour", "Maryam Dadkhah", "Yasaman Haghbin", "Hossein AzadMaleki", "Maryam Zolnoori"], "categories": ["cs.CL", "cs.AI", "eess.AS"], "comment": null, "summary": "Over half of US adults with Alzheimer disease and related dementias remain\nundiagnosed, and speech-based screening offers a scalable detection approach.\nWe compared large language model adaptation strategies for dementia detection\nusing the DementiaBank speech corpus, evaluating nine text-only models and\nthree multimodal audio-text models on recordings from DementiaBank speech\ncorpus. Adaptations included in-context learning with different demonstration\nselection policies, reasoning-augmented prompting, parameter-efficient\nfine-tuning, and multimodal integration. Results showed that class-centroid\ndemonstrations achieved the highest in-context learning performance, reasoning\nimproved smaller models, and token-level fine-tuning generally produced the\nbest scores. Adding a classification head substantially improved\nunderperforming models. Among multimodal models, fine-tuned audio-text systems\nperformed well but did not surpass the top text-only models. These findings\nhighlight that model adaptation strategies, including demonstration selection,\nreasoning design, and tuning method, critically influence speech-based dementia\ndetection, and that properly adapted open-weight models can match or exceed\ncommercial systems."}
{"id": "2509.03526", "pdf": "https://arxiv.org/pdf/2509.03526.pdf", "abs": "https://arxiv.org/abs/2509.03526", "title": "Enhancing Speech Large Language Models through Reinforced Behavior Alignment", "authors": ["Yansong Liu", "Jiateng Li", "Yuan Liu"], "categories": ["cs.CL", "eess.AS"], "comment": null, "summary": "The recent advancements of Large Language Models (LLMs) have spurred\nconsiderable research interest in extending their linguistic capabilities\nbeyond text to other modalities, which leads to emergence of speech-based LLMs\n(SpeechLMs) with capability of processing user request in either speech or\ntextual formats. However, owing to inter-modal discrepancies, these SpeechLMs\nstill exhibit a significant performance gap compared to their text-based LLM\ncounterparts in instruction-following, particularly when confronted with the\ndynamic and variable nature of user speech. To address this challenge, this\npaper introduces a framework termed Reinforced Behavior Alignment (RBA),\ndesigned to bolster the language generation proficiency of SpeechLMs. Instead\nof relying on supervised fine-tuning from human annotations, RBA employs a\nself-synthesis methodology to generate extensive, high-fidelity alignment data\nby a powerful teacher LLM. Then SpeechLMs is aligned its behavior with that of\na teacher using a reinforcement learning-based approach. Experimental results\ndemonstrate that this method effectively enhances the instruction-following\ncapabilities of SpeechLMs that outperform conventional distillation baselines.\nCrucially, we demonstrate that RBA can be seamlessly extended to tasks such\nincluding spoken question answering and speech-to-text translation, attaining\nstate-of-the-art performance on open benchmarks with only self-generated data."}
{"id": "2509.03527", "pdf": "https://arxiv.org/pdf/2509.03527.pdf", "abs": "https://arxiv.org/abs/2509.03527", "title": "Multilevel Analysis of Cryptocurrency News using RAG Approach with Fine-Tuned Mistral Large Language Model", "authors": ["Bohdan M. Pavlyshenko"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "In the paper, we consider multilevel multitask analysis of cryptocurrency\nnews using a fine-tuned Mistral 7B large language model with\nretrieval-augmented generation (RAG).\n  On the first level of analytics, the fine-tuned model generates graph and\ntext summaries with sentiment scores as well as JSON representations of\nsummaries. Higher levels perform hierarchical stacking that consolidates sets\nof graph-based and text-based summaries as well as summaries of summaries into\ncomprehensive reports. The combination of graph and text summaries provides\ncomplementary views of cryptocurrency news. The model is fine-tuned with 4-bit\nquantization using the PEFT/LoRA approach. The representation of cryptocurrency\nnews as knowledge graph can essentially eliminate problems with large language\nmodel hallucinations.\n  The obtained results demonstrate that the use of fine-tuned Mistral 7B LLM\nmodels for multilevel cryptocurrency news analysis can conduct informative\nqualitative and quantitative analytics, providing important insights."}
{"id": "2509.03528", "pdf": "https://arxiv.org/pdf/2509.03528.pdf", "abs": "https://arxiv.org/abs/2509.03528", "title": "The ProLiFIC dataset: Leveraging LLMs to Unveil the Italian Lawmaking Process", "authors": ["Matilde Contestabile", "Chiara Ferrara", "Alberto Giovannetti", "Giovanni Parrillo", "Andrea Vandin"], "categories": ["cs.CL", "cs.CY", "cs.LG"], "comment": null, "summary": "Process Mining (PM), initially developed for industrial and business\ncontexts, has recently been applied to social systems, including legal ones.\nHowever, PM's efficacy in the legal domain is limited by the accessibility and\nquality of datasets. We introduce ProLiFIC (Procedural Lawmaking Flow in\nItalian Chambers), a comprehensive event log of the Italian lawmaking process\nfrom 1987 to 2022. Created from unstructured data from the Normattiva portal\nand structured using large language models (LLMs), ProLiFIC aligns with recent\nefforts in integrating PM with LLMs. We exemplify preliminary analyses and\npropose ProLiFIC as a benchmark for legal PM, fostering new developments."}
{"id": "2509.03678", "pdf": "https://arxiv.org/pdf/2509.03678.pdf", "abs": "https://arxiv.org/abs/2509.03678", "title": "Promisedland: An XR Narrative Attraction Integrating Diorama-to-Virtual Workflow and Elemental Storytelling", "authors": ["Xianghan Wang", "Chingshuan Hsiao", "Shimei Qiu"], "categories": ["cs.HC", "cs.MM"], "comment": "Accepted to the Proceedings of the 2025 11th International Conference\n  on Virtual Reality (ICVR 2025). ISBN: 979-8-3503-9272-2. \\c{opyright} 2025\n  IEEE. This is the author-accepted manuscript. The final version will be\n  available via IEEE Xplore", "summary": "Promisedland is a mixed-reality (MR) narrative attraction that combines\ncultural storytelling, ecological education, and an innovative hybrid\nproduction workflow. Set in a future Earth suffering from elemental imbalance,\nusers embark on an interactive journey guided by symbolic characters to restore\nharmony through the collection of five classical elements: metal, wood, water,\nfire, and earth. To prototype this experience, we introduce a low-cost,\nhigh-fidelity Diorama-to-Virtual pipeline - handcrafting physical scale models,\n3D scanning, and integrating them into Unreal Engine. This process enables\nrapid spatial prototyping while preserving the material expressiveness and\nnarrative consistency of the physical environment. To further enhance\nimmersion, the experience incorporates a Stewart Platform to provide motion\nfeedback synchronized with the virtual ride dynamics, reinforcing spatial\npresence and embodied engagement. The final prototype runs on Meta Quest,\nsupporting dynamic interactions and real-time visual feedback. Promisedland\noffers a replicable design blueprint for future XR narrative installations\nacross museums, cultural exhibitions, and themed entertainment. It proposes a\nnew framework for XR Narrative Attractions - where physical and digital\nelements converge to deepen immersion, agency, and emotional engagement."}
{"id": "2509.03529", "pdf": "https://arxiv.org/pdf/2509.03529.pdf", "abs": "https://arxiv.org/abs/2509.03529", "title": "Multimodal Proposal for an AI-Based Tool to Increase Cross-Assessment of Messages", "authors": ["Alejandro Álvarez Castro", "Joaquín Ordieres-Meré"], "categories": ["cs.CL", "cs.AI", "eess.AS"], "comment": "Presented at NLMLT2025 (https://airccse.org/csit/V15N16.html), 15\n  pages, 5 figures", "summary": "Earnings calls represent a uniquely rich and semi-structured source of\nfinancial communication, blending scripted managerial commentary with\nunscripted analyst dialogue. Although recent advances in financial sentiment\nanalysis have integrated multi-modal signals, such as textual content and vocal\ntone, most systems rely on flat document-level or sentence-level models,\nfailing to capture the layered discourse structure of these interactions. This\npaper introduces a novel multi-modal framework designed to generate\nsemantically rich and structurally aware embeddings of earnings calls, by\nencoding them as hierarchical discourse trees. Each node, comprising either a\nmonologue or a question-answer pair, is enriched with emotional signals derived\nfrom text, audio, and video, as well as structured metadata including coherence\nscores, topic labels, and answer coverage assessments. A two-stage transformer\narchitecture is proposed: the first encodes multi-modal content and discourse\nmetadata at the node level using contrastive learning, while the second\nsynthesizes a global embedding for the entire conference. Experimental results\nreveal that the resulting embeddings form stable, semantically meaningful\nrepresentations that reflect affective tone, structural logic, and thematic\nalignment. Beyond financial reporting, the proposed system generalizes to other\nhigh-stakes unscripted communicative domains such as tele-medicine, education,\nand political discourse, offering a robust and explainable approach to\nmulti-modal discourse representation. This approach offers practical utility\nfor downstream tasks such as financial forecasting and discourse evaluation,\nwhile also providing a generalizable method applicable to other domains\ninvolving high-stakes communication."}
{"id": "2509.03693", "pdf": "https://arxiv.org/pdf/2509.03693.pdf", "abs": "https://arxiv.org/abs/2509.03693", "title": "Designing Effective AI Explanations for Misinformation Detection: A Comparative Study of Content, Social, and Combined Explanations", "authors": ["Yeaeun Gong", "Yifan Liu", "Lanyu Shang", "Na Wei", "Dong Wang"], "categories": ["cs.HC", "cs.MM"], "comment": "To appear at CSCW 2025", "summary": "In this paper, we study the problem of AI explanation of misinformation,\nwhere the goal is to identify explanation designs that help improve users'\nmisinformation detection abilities and their overall user experiences. Our work\nis motivated by the limitations of current Explainable AI (XAI) approaches,\nwhich predominantly focus on content explanations that elucidate the linguistic\nfeatures and sentence structures of the misinformation. To address this\nlimitation, we explore various explanations beyond content explanation, such as\n\"social explanation\" that considers the broader social context surrounding\nmisinformation, as well as a \"combined explanation\" where both the content and\nsocial explanations are presented in scenarios that are either aligned or\nmisaligned with each other. To evaluate the comparative effectiveness of these\nAI explanations, we conduct two online crowdsourcing experiments in the\nCOVID-19 (Study 1 on Prolific) and Politics domains (Study 2 on MTurk). Our\nresults show that AI explanations are generally effective in aiding users to\ndetect misinformation, with effectiveness significantly influenced by the\nalignment between content and social explanations. We also find that the order\nin which explanation types are presented - specifically, whether a content or\nsocial explanation comes first - can influence detection accuracy, with\ndifferences found between the COVID-19 and Political domains. This work\ncontributes towards more effective design of AI explanations, fostering a\ndeeper understanding of how different explanation types and their combinations\ninfluence misinformation detection."}
{"id": "2509.03530", "pdf": "https://arxiv.org/pdf/2509.03530.pdf", "abs": "https://arxiv.org/abs/2509.03530", "title": "Reading Between the Signs: Predicting Future Suicidal Ideation from Adolescent Social Media Texts", "authors": ["Paul Blum", "Enrico Liscio", "Ruixuan Zhang", "Caroline Figueroa", "Pradeep K. Murukannaiah"], "categories": ["cs.CL"], "comment": null, "summary": "Suicide is a leading cause of death among adolescents (12-18), yet predicting\nit remains a significant challenge. Many cases go undetected due to a lack of\ncontact with mental health services. Social media, however, offers a unique\nopportunity, as young people often share their thoughts and struggles online in\nreal time. In this work, we propose a novel task and method to approach it:\npredicting suicidal ideation and behavior (SIB) from forum posts before an\nadolescent explicitly expresses suicidal ideation on an online forum. This\npredictive framing, where no self-disclosure is used as input at any stage,\nremains largely unexplored in the suicide prediction literature. To this end,\nwe introduce Early-SIB, a transformer-based model that sequentially processes\nthe posts a user writes and engages with to predict whether they will write a\nSIB post. Our model achieves a balanced accuracy of 0.73 for predicting future\nSIB on a Dutch youth forum, demonstrating that such tools can offer a\nmeaningful addition to traditional methods."}
{"id": "2509.03741", "pdf": "https://arxiv.org/pdf/2509.03741.pdf", "abs": "https://arxiv.org/abs/2509.03741", "title": "Designing Gaze Analytics for ELA Instruction: A User-Centered Dashboard with Conversational AI Support", "authors": ["Eduardo Davalos", "Yike Zhang", "Shruti Jain", "Namrata Srivastava", "Trieu Truong", "Nafees-ul Haque", "Tristan Van", "Jorge Salas", "Sara McFadden", "Sun-Joo Cho", "Gautam Biswas", "Amanda Goodwin"], "categories": ["cs.HC", "cs.AI"], "comment": "22 pages, 9 figures, 3 tables, submitted to IUI2026", "summary": "Eye-tracking offers rich insights into student cognition and engagement, but\nremains underutilized in classroom-facing educational technology due to\nchallenges in data interpretation and accessibility. In this paper, we present\nthe iterative design and evaluation of a gaze-based learning analytics\ndashboard for English Language Arts (ELA), developed through five studies\ninvolving teachers and students. Guided by user-centered design and data\nstorytelling principles, we explored how gaze data can support reflection,\nformative assessment, and instructional decision-making. Our findings\ndemonstrate that gaze analytics can be approachable and pedagogically valuable\nwhen supported by familiar visualizations, layered explanations, and narrative\nscaffolds. We further show how a conversational agent, powered by a large\nlanguage model (LLM), can lower cognitive barriers to interpreting gaze data by\nenabling natural language interactions with multimodal learning analytics. We\nconclude with design implications for future EdTech systems that aim to\nintegrate novel data modalities in classroom contexts."}
{"id": "2509.03531", "pdf": "https://arxiv.org/pdf/2509.03531.pdf", "abs": "https://arxiv.org/abs/2509.03531", "title": "Real-Time Detection of Hallucinated Entities in Long-Form Generation", "authors": ["Oscar Obeso", "Andy Arditi", "Javier Ferrando", "Joshua Freeman", "Cameron Holmes", "Neel Nanda"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Large language models are now routinely used in high-stakes applications\nwhere hallucinations can cause serious harm, such as medical consultations or\nlegal advice. Existing hallucination detection methods, however, are\nimpractical for real-world use, as they are either limited to short factual\nqueries or require costly external verification. We present a cheap, scalable\nmethod for real-time identification of hallucinated tokens in long-form\ngenerations, and scale it effectively to 70B parameter models. Our approach\ntargets \\emph{entity-level hallucinations} -- e.g., fabricated names, dates,\ncitations -- rather than claim-level, thereby naturally mapping to token-level\nlabels and enabling streaming detection. We develop an annotation methodology\nthat leverages web search to annotate model responses with grounded labels\nindicating which tokens correspond to fabricated entities. This dataset enables\nus to train effective hallucination classifiers with simple and efficient\nmethods such as linear probes. Evaluating across four model families, our\nclassifiers consistently outperform baselines on long-form responses, including\nmore expensive methods such as semantic entropy (e.g., AUC 0.90 vs 0.71 for\nLlama-3.3-70B), and are also an improvement in short-form question-answering\nsettings. Moreover, despite being trained only with entity-level labels, our\nprobes effectively detect incorrect answers in mathematical reasoning tasks,\nindicating generalization beyond entities. While our annotation methodology is\nexpensive, we find that annotated responses from one model can be used to train\neffective classifiers on other models; accordingly, we publicly release our\ndatasets to facilitate reuse. Overall, our work suggests a promising new\napproach for scalable, real-world hallucination detection."}
{"id": "2509.03792", "pdf": "https://arxiv.org/pdf/2509.03792.pdf", "abs": "https://arxiv.org/abs/2509.03792", "title": "Map as a By-product: Collective Landmark Mapping from IMU Data and User-provided Texts in Situated Tasks", "authors": ["Ryo Yonetani", "Kotaro Hara"], "categories": ["cs.HC"], "comment": "(c) 2025 Copyright held by the owner/author(s). Publication rights\n  licensed to ACM. This is the author's version of the work. It is posted here\n  for your personal use. Not for redistribution. The definitive Version of\n  Record was published in Proc. ACM Interact. Mob. Wearable Ubiquitous Technol.\n  9, 3, Article 146 (September 2025), https://doi.org/10.1145/3749455", "summary": "This paper presents Collective Landmark Mapper, a novel map-as-a-by-product\nsystem for generating semantic landmark maps of indoor environments. Consider\nusers engaged in situated tasks that require them to navigate these\nenvironments and regularly take notes on their smartphones. Collective Landmark\nMapper exploits the smartphone's IMU data and the user's free text input during\nthese tasks to identify a set of landmarks encountered by the user. The\nidentified landmarks are then aggregated across multiple users to generate a\nunified map representing the positions and semantic information of all\nlandmarks. In developing the proposed system, we focused specifically on retail\napplications and conducted a formative interview with stakeholders to confirm\ntheir practical needs that motivate the map-as-a-byproduct approach. Our user\nstudy demonstrates the feasibility of the proposed system and its superior\nmapping performance in two different setups: creating a product availability\nmap from restocking checklist tasks at a retail store and constructing a room\nusage map from office inspection tasks, further demonstrating the potential\napplicability to non-retail applications."}
{"id": "2509.03533", "pdf": "https://arxiv.org/pdf/2509.03533.pdf", "abs": "https://arxiv.org/abs/2509.03533", "title": "Topic Identification in LLM Input-Output Pairs through the Lens of Information Bottleneck", "authors": ["Igor Halperin"], "categories": ["cs.CL", "cs.LG", "q-fin.GN"], "comment": "26 pages, 4 figures", "summary": "Large Language Models (LLMs) are prone to critical failure modes, including\n\\textit{intrinsic faithfulness hallucinations} (also known as confabulations),\nwhere a response deviates semantically from the provided context. Frameworks\ndesigned to detect this, such as Semantic Divergence Metrics (SDM), rely on\nidentifying latent topics shared between prompts and responses, typically by\napplying geometric clustering to their sentence embeddings. This creates a\ndisconnect, as the topics are optimized for spatial proximity, not for the\ndownstream information-theoretic analysis. In this paper, we bridge this gap by\ndeveloping a principled topic identification method grounded in the\nDeterministic Information Bottleneck (DIB) for geometric clustering. Our key\ncontribution is to transform the DIB method into a practical algorithm for\nhigh-dimensional data by substituting its intractable KL divergence term with a\ncomputationally efficient upper bound. The resulting method, which we dub UDIB,\ncan be interpreted as an entropy-regularized and robustified version of K-means\nthat inherently favors a parsimonious number of informative clusters. By\napplying UDIB to the joint clustering of LLM prompt and response embeddings, we\ngenerate a shared topic representation that is not merely spatially coherent\nbut is fundamentally structured to be maximally informative about the\nprompt-response relationship. This provides a superior foundation for the SDM\nframework and offers a novel, more sensitive tool for detecting confabulations."}
{"id": "2509.03812", "pdf": "https://arxiv.org/pdf/2509.03812.pdf", "abs": "https://arxiv.org/abs/2509.03812", "title": "Exploring the Integration of Extended Reality and Artificial Intelligence (AI) for Remote STEM Education and Assessment", "authors": ["Shadeeb Hossain", "Natalie Sommer", "Neda Adib"], "categories": ["cs.HC"], "comment": "9 pages, 5 figures, 1 table", "summary": "This paper presents a dynamic gamification architecture for an Extended\nReality Artificial Intelligence virtual training environment designed to\nenhance STEM education through immersive adaptive, and kinesthetic learning.\nThe proposed system can be introduced in four phases: Introduction Phase,\nComponent Development Phase, Fault Introduction and Correction Phase and\nGenerative AI XR scenarios Phase. Security and privacy are discussed via a\ndefense-in-depth approach spanning client, middleware, and backend layers,\nincorporating AES 256 encryption, multi-factor authentication, role-based\naccess control and GDPR or FERPA compliance. Risks such as sensor exploitation,\nperceptual manipulation, and virtual physical harm are identified, with\nmitigation strategies embedded at the design stage. Potential barriers to large\nscale adoption-including technical complexity, cost of deployment, and need for\ncybersecurity expertise are discussed."}
{"id": "2509.03535", "pdf": "https://arxiv.org/pdf/2509.03535.pdf", "abs": "https://arxiv.org/abs/2509.03535", "title": "QuesGenie: Intelligent Multimodal Question Generation", "authors": ["Ahmed Mubarak", "Amna Ahmed", "Amira Nasser", "Aya Mohamed", "Fares El-Sadek", "Mohammed Ahmed", "Ahmed Salah", "Youssef Sobhy"], "categories": ["cs.CL", "cs.AI"], "comment": "7 pages, 8 figures, 12 tables. Supervised by Dr. Ahmed Salah and TA\n  Youssef Sobhy", "summary": "In today's information-rich era, learners have access to abundant educational\nresources, but the lack of practice materials tailored to these resources\npresents a significant challenge. This project addresses that gap by developing\na multi-modal question generation system that can automatically generate\ndiverse question types from various content formats. The system features four\nmajor components: multi-modal input handling, question generation,\nreinforcement learning from human feedback (RLHF), and an end-to-end\ninteractive interface. This project lays the foundation for automated,\nscalable, and intelligent question generation, carefully balancing resource\nefficiency, robust functionality and a smooth user experience."}
{"id": "2509.03931", "pdf": "https://arxiv.org/pdf/2509.03931.pdf", "abs": "https://arxiv.org/abs/2509.03931", "title": "\"Low Frequency Tweeters Have More to Say!\" A New Approach to Identify Importance of Tweets", "authors": ["Gautam Khannaa", "Yeliz Yesilada", "Sukru Eraslan", "Simon Harper"], "categories": ["cs.HC", "cs.SI"], "comment": "12 pages", "summary": "Twitter is one of the most popular social media platforms.With a large number\nof tweets, the activity feed of users becomes noisy, challenging to read, and\nmost importantly tweets often get lost. We present a new approach to\npersonalise the ranking of the tweets toward solving the problem of information\noverload which is achieved by analysing the relationship between the importance\nof tweets to the frequency at which the author tweets. The hypothesis tested is\nthat \"low-frequency tweeters have more to say\", i.e. if a user who tweets\ninfrequently actually goes to the effort of tweeting, then it is more likely to\nbe of more importance or contain more \"meaning\" than a tweet by a user who\ntweets continuously. We propose six new measures to evaluate the importance of\ntweets based on the ability of the tweet to drive interaction among its\nreaders, which is measured through metrics such as retweets, favourites, and\ncomments, and the extent of the author's network interacting with the tweet.\nOur study shows that users who tweeted less than ten tweets per week were more\nlikely to be perceived as important by their followers and have the most\nimportant messages. This identified tweet-frequency band could be used to\nreorder the activity feed of users and such reordering would ensure the\nmessages of low-frequency tweeters do not get lost in the stream of tweets.\nThis could also serve as a scoring index for Twitter users to identify users\nfrequently tweeting important messages."}
{"id": "2509.03537", "pdf": "https://arxiv.org/pdf/2509.03537.pdf", "abs": "https://arxiv.org/abs/2509.03537", "title": "AR$^2$: Adversarial Reinforcement Learning for Abstract Reasoning in Large Language Models", "authors": ["Cheng-Kai Yeh", "Hsing-Wang Lee", "Chung-Hung Kuo", "Hen-Hsen Huang"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "7 pages, accepted by CIKM 2025 as a short paper", "summary": "Abstraction--the ability to recognize and distill essential computational\npatterns from complex problem statements--is a foundational skill in computer\nscience, critical both for human problem-solvers and coding-oriented large\nlanguage models (LLMs). Despite recent advances in training LLMs for code\ngeneration using reinforcement learning (RL), most existing approaches focus\nprimarily on superficial pattern recognition, overlooking explicit training for\nabstraction. In this study, we propose AR$^2$ (Adversarial Reinforcement\nLearning for Abstract Reasoning), a novel framework explicitly designed to\nenhance the abstraction abilities of LLMs. AR$^2$ employs a teacher model to\ntransform kernel problems into narrative-rich, challenging descriptions without\nchanging their fundamental logic. Simultaneously, a student coding model is\ntrained to solve these complex narrative problems by extracting their\nunderlying computational kernels. Experimental results demonstrate that AR$^2$\nsubstantially improves the student model's accuracy on previously unseen,\nchallenging programming tasks, underscoring abstraction as a key skill for\nenhancing LLM generalization."}
{"id": "2509.04088", "pdf": "https://arxiv.org/pdf/2509.04088.pdf", "abs": "https://arxiv.org/abs/2509.04088", "title": "Spiking Neural Network Decoders of Finger Forces from High-Density Intramuscular Microelectrode Arrays", "authors": ["Farah Baracat", "Agnese Grison", "Dario Farina", "Giacomo Indiveri", "Elisa Donati"], "categories": ["cs.HC", "eess.SP"], "comment": null, "summary": "Restoring naturalistic finger control in assistive technologies requires the\ncontinuous decoding of motor intent with high accuracy, efficiency, and\nrobustness. Here, we present a spike-based decoding framework that integrates\nspiking neural networks (SNNs) with motor unit activity extracted from\nhigh-density intramuscular microelectrode arrays. We demonstrate simultaneous\nand proportional decoding of individual finger forces from motor unit spike\ntrains during isometric contractions at 15% of maximum voluntary contraction\nusing SNNs. We systematically evaluated alternative SNN decoder configurations\nand compared two possible input modalities: physiologically grounded motor unit\nspike trains and spike-encoded intramuscular EMG signals. Through this\ncomparison, we quantified trade-offs between decoding accuracy, memory\nfootprint, and robustness to input errors. The results showed that shallow SNNs\ncan reliably decode finger-level motor intent with competitive accuracy and\nminimal latency, while operating with reduced memory requirements and without\nthe need for external preprocessing buffers. This work provides a practical\nblueprint for integrating SNNs into finger-level force decoding systems,\ndemonstrating how the choice of input representation can be strategically\ntailored to meet application-specific requirements for accuracy, robustness,\nand memory efficiency."}
{"id": "2509.03540", "pdf": "https://arxiv.org/pdf/2509.03540.pdf", "abs": "https://arxiv.org/abs/2509.03540", "title": "Improving Factuality in LLMs via Inference-Time Knowledge Graph Construction", "authors": ["Shanglin Wu", "Lihui Liu", "Jinho D. Choi", "Kai Shu"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) often struggle with producing factually\nconsistent answers due to limitations in their parametric memory.\nRetrieval-Augmented Generation (RAG) methods address this issue by\nincorporating external knowledge from trusted sources at inference time.\nHowever, such methods typically treat knowledge as unstructured text, which\nlimits their ability to support compositional reasoning and identify factual\ninconsistencies. To overcome these limitations, we propose a novel framework\nthat dynamically constructs and expands knowledge graphs (KGs) during\ninference, integrating both internal knowledge extracted from LLMs and external\ninformation retrieved from external sources. Our method begins by extracting a\nseed KG from the question via prompting, followed by iterative expansion using\nthe LLM's latent knowledge. The graph is then selectively refined through\nexternal retrieval, enhancing factual coverage and correcting inaccuracies. We\nevaluate our approach on three diverse factual QA benchmarks, demonstrating\nconsistent improvements in factual accuracy, answer precision, and\ninterpretability over baseline prompting and static KG-augmented methods. Our\nfindings suggest that inference-time KG construction is a promising direction\nfor enhancing LLM factuality in a structured, interpretable, and scalable\nmanner."}
{"id": "2509.04174", "pdf": "https://arxiv.org/pdf/2509.04174.pdf", "abs": "https://arxiv.org/abs/2509.04174", "title": "Unobtrusive In-Situ Measurement of Behavior Change by Deep Metric Similarity Learning of Motion Patterns", "authors": ["Christian Merz", "Lukas Schach", "Marie Luisa Fiedler", "Jean-Luc Lugrin", "Carolin Wienrich", "Marc Erich Latoschik"], "categories": ["cs.HC", "cs.LG"], "comment": null, "summary": "This paper introduces an unobtrusive in-situ measurement method to detect\nuser behavior changes during arbitrary exposures in XR systems. Here, such\nbehavior changes are typically associated with the Proteus effect or bodily\naffordances elicited by different avatars that the users embody in XR. We\npresent a biometric user model based on deep metric similarity learning, which\nuses high-dimensional embeddings as reference vectors to identify behavior\nchanges of individual users. We evaluate our model against two alternative\napproaches: a (non-learned) motion analysis based on central tendencies of\nmovement patterns and subjective post-exposure embodiment questionnaires\nfrequently used in various XR exposures. In a within-subject study,\nparticipants performed a fruit collection task while embodying avatars of\ndifferent body heights (short, actual-height, and tall). Subjective assessments\nconfirmed the effective manipulation of perceived body schema, while the\n(non-learned) objective analyses of head and hand movements revealed\nsignificant differences across conditions. Our similarity learning model\ntrained on the motion data successfully identified the elicited behavior change\nfor various query and reference data pairings of the avatar conditions. The\napproach has several advantages in comparison to existing methods: 1) In-situ\nmeasurement without additional user input, 2) generalizable and scalable motion\nanalysis for various use cases, 3) user-specific analysis on the individual\nlevel, and 4) with a trained model, users can be added and evaluated in real\ntime to study how avatar changes affect behavior."}
{"id": "2509.03565", "pdf": "https://arxiv.org/pdf/2509.03565.pdf", "abs": "https://arxiv.org/abs/2509.03565", "title": "ResearchPulse: Building Method-Experiment Chains through Multi-Document Scientific Inference", "authors": ["Qi Chen", "Jingxuan Wei", "Zhuoya Yao", "Haiguang Wang", "Gaowei Wu", "Bihui Yu", "Siyuan Li", "Cheng Tan"], "categories": ["cs.CL", "cs.MM"], "comment": "Accepted to ACM MM 2025", "summary": "Understanding how scientific ideas evolve requires more than summarizing\nindividual papers-it demands structured, cross-document reasoning over\nthematically related research. In this work, we formalize multi-document\nscientific inference, a new task that extracts and aligns motivation,\nmethodology, and experimental results across related papers to reconstruct\nresearch development chains. This task introduces key challenges, including\ntemporally aligning loosely structured methods and standardizing heterogeneous\nexperimental tables. We present ResearchPulse, an agent-based framework that\nintegrates instruction planning, scientific content extraction, and structured\nvisualization. It consists of three coordinated agents: a Plan Agent for task\ndecomposition, a Mmap-Agent that constructs motivation-method mind maps, and a\nLchart-Agent that synthesizes experimental line charts. To support this task,\nwe introduce ResearchPulse-Bench, a citation-aware benchmark of annotated paper\nclusters. Experiments show that our system, despite using 7B-scale agents,\nconsistently outperforms strong baselines like GPT-4o in semantic alignment,\nstructural consistency, and visual fidelity. The dataset are available in\nhttps://huggingface.co/datasets/ResearchPulse/ResearchPulse-Bench."}
{"id": "2509.04241", "pdf": "https://arxiv.org/pdf/2509.04241.pdf", "abs": "https://arxiv.org/abs/2509.04241", "title": "Would I regret being different? The influence of social norms on attitudes toward AI usage", "authors": ["Jaroslaw Kornowicz", "Maurice Pape", "Kirsten Thommes"], "categories": ["cs.HC"], "comment": "30 pages, 5 figures", "summary": "Prior research shows that social norms can reduce algorithm aversion, but\nlittle is known about how such norms become established. Most accounts\nemphasize technological and individual determinants, yet AI adoption unfolds\nwithin organizational social contexts shaped by peers and supervisors. We ask\nwhether the source of the norm-peers or supervisors-shapes AI usage behavior.\nThis question is practically relevant for organizations seeking to promote\neffective AI adoption. We conducted an online vignette experiment, complemented\nby qualitative data on participants' feelings and justifications after\n(counter-)normative behavior. In line with the theory, counter-normative\nchoices elicited higher regret than norm-adherent choices. On average, choosing\nAI increased regret compared to choosing an human. This aversion was weaker\nwhen AI use was presented as the prevailing norm, indicating a statistically\nsignificant interaction between AI use and an AI-favoring norm. Participants\nalso attributed less blame to technology than to humans, which increased regret\nwhen AI was chosen over human expertise. Both peer and supervisor influence\nemerged as relevant factors, though contrary to expectations they did not\nsignificantly affect regret. Our findings suggest that regret aversion,\nembedded in social norms, is a central mechanism driving imitation in\nAI-related decision-making."}
{"id": "2509.03610", "pdf": "https://arxiv.org/pdf/2509.03610.pdf", "abs": "https://arxiv.org/abs/2509.03610", "title": "NoteBar: An AI-Assisted Note-Taking System for Personal Knowledge Management", "authors": ["Josh Wisoff", "Yao Tang", "Zhengyu Fang", "Jordan Guzman", "YuTang Wang", "Alex Yu"], "categories": ["cs.CL"], "comment": null, "summary": "Note-taking is a critical practice for capturing, organizing, and reflecting\non information in both academic and professional settings. The recent success\nof large language models has accelerated the development of AI-assisted tools,\nyet existing solutions often struggle with efficiency. We present NoteBar, an\nAI-assisted note-taking tool that leverages persona information and efficient\nlanguage models to automatically organize notes into multiple categories and\nbetter support user workflows. To support research and evaluation in this\nspace, we further introduce a novel persona-conditioned dataset of 3,173 notes\nand 8,494 annotated concepts across 16 MBTI personas, offering both diversity\nand semantic richness for downstream tasks. Finally, we demonstrate that\nNoteBar can be deployed in a practical and cost-effective manner, enabling\ninteractive use without reliance on heavy infrastructure. Together, NoteBar and\nits accompanying dataset provide a scalable and extensible foundation for\nadvancing AI-assisted personal knowledge management."}
{"id": "2509.04254", "pdf": "https://arxiv.org/pdf/2509.04254.pdf", "abs": "https://arxiv.org/abs/2509.04254", "title": "MuMTAffect: A Multimodal Multitask Affective Framework for Personality and Emotion Recognition from Physiological Signals", "authors": ["Meisam Jamshidi Seikavandi", "Fabricio Batista Narcizo", "Ted Vucurevich", "Andrew Burke Dittberner", "Paolo Burelli"], "categories": ["cs.HC"], "comment": null, "summary": "We present MuMTAffect, a novel Multimodal Multitask Affective Embedding\nNetwork designed for joint emotion classification and personality prediction\n(re-identification) from short physiological signal segments. MuMTAffect\nintegrates multiple physiological modalities pupil dilation, eye gaze, facial\naction units, and galvanic skin response using dedicated, transformer-based\nencoders for each modality and a fusion transformer to model cross-modal\ninteractions. Inspired by the Theory of Constructed Emotion, the architecture\nexplicitly separates core affect encoding (valence/arousal) from higher-level\nconceptualization, thereby grounding predictions in contemporary affective\nneuroscience. Personality trait prediction is leveraged as an auxiliary task to\ngenerate robust, user-specific affective embeddings, significantly enhancing\nemotion recognition performance. We evaluate MuMTAffect on the AFFEC dataset,\ndemonstrating that stimulus-level emotional cues (Stim Emo) and galvanic skin\nresponse substantially improve arousal classification, while pupil and gaze\ndata enhance valence discrimination. The inherent modularity of MuMTAffect\nallows effortless integration of additional modalities, ensuring scalability\nand adaptability. Extensive experiments and ablation studies underscore the\nefficacy of our multimodal multitask approach in creating personalized,\ncontext-aware affective computing systems, highlighting pathways for further\nadvancements in cross-subject generalisation."}
{"id": "2509.03615", "pdf": "https://arxiv.org/pdf/2509.03615.pdf", "abs": "https://arxiv.org/abs/2509.03615", "title": "E-ARMOR: Edge case Assessment and Review of Multilingual Optical Character Recognition", "authors": ["Aryan Gupta", "Anupam Purwar"], "categories": ["cs.CL", "cs.AI"], "comment": "Sprinklr OCR provides a fast and compute light way of performing OCR", "summary": "Optical Character Recognition (OCR) in multilingual, noisy, and diverse\nreal-world images remains a significant challenge for optical character\nrecognition systems. With the rise of Large Vision-Language Models (LVLMs),\nthere is growing interest in their ability to generalize and reason beyond\nfixed OCR pipelines. In this work, we introduce Sprinklr-Edge-OCR, a novel OCR\nsystem built specifically optimized for edge deployment in resource-constrained\nenvironments. We present a large-scale comparative evaluation of five\nstate-of-the-art LVLMs (InternVL, Qwen, GOT OCR, LLaMA, MiniCPM) and two\ntraditional OCR systems (Sprinklr-Edge-OCR, SuryaOCR) on a proprietary, doubly\nhand annotated dataset of multilingual (54 languages) images. Our benchmark\ncovers a broad range of metrics including accuracy, semantic consistency,\nlanguage coverage, computational efficiency (latency, memory, GPU usage), and\ndeployment cost. To better reflect real-world applicability, we also conducted\nedge case deployment analysis, evaluating model performance on CPU only\nenvironments. Among the results, Qwen achieved the highest precision (0.54),\nwhile Sprinklr-Edge-OCR delivered the best overall F1 score (0.46) and\noutperformed others in efficiency, processing images 35 faster (0.17 seconds\nper image on average) and at less than 0.01 of the cost (0.006 USD per 1,000\nimages) compared to LVLM. Our findings demonstrate that the most optimal OCR\nsystems for edge deployment are the traditional ones even in the era of LLMs\ndue to their low compute requirements, low latency, and very high\naffordability."}
{"id": "2509.04303", "pdf": "https://arxiv.org/pdf/2509.04303.pdf", "abs": "https://arxiv.org/abs/2509.04303", "title": "HumAIne-Chatbot: Real-Time Personalized Conversational AI via Reinforcement Learning", "authors": ["Georgios Makridis", "Georgios Fragiadakis", "Jorge Oliveira", "Tomaz Saraiva", "Philip Mavrepis", "Georgios Fatouros", "Dimosthenis Kyriazis"], "categories": ["cs.HC", "cs.AI"], "comment": "11 pages, 4 figures, IEEE conference format", "summary": "Current conversational AI systems often provide generic, one-size-fits-all\ninteractions that overlook individual user characteristics and lack adaptive\ndialogue management. To address this gap, we introduce\n\\textbf{HumAIne-chatbot}, an AI-driven conversational agent that personalizes\nresponses through a novel user profiling framework. The system is pre-trained\non a diverse set of GPT-generated virtual personas to establish a broad prior\nover user types. During live interactions, an online reinforcement learning\nagent refines per-user models by combining implicit signals (e.g. typing speed,\nsentiment, engagement duration) with explicit feedback (e.g., likes and\ndislikes). This profile dynamically informs the chatbot dialogue policy,\nenabling real-time adaptation of both content and style. To evaluate the\nsystem, we performed controlled experiments with 50 synthetic personas in\nmultiple conversation domains. The results showed consistent improvements in\nuser satisfaction, personalization accuracy, and task achievement when\npersonalization features were enabled. Statistical analysis confirmed\nsignificant differences between personalized and nonpersonalized conditions,\nwith large effect sizes across key metrics. These findings highlight the\neffectiveness of AI-driven user profiling and provide a strong foundation for\nfuture real-world validation."}
{"id": "2509.03647", "pdf": "https://arxiv.org/pdf/2509.03647.pdf", "abs": "https://arxiv.org/abs/2509.03647", "title": "Breaking the Mirror: Activation-Based Mitigation of Self-Preference in LLM Evaluators", "authors": ["Dani Roytburg", "Matthew Bozoukov", "Matthew Nguyen", "Jou Barzdukas", "Simon Fu", "Narmeen Oozeer"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Large language models (LLMs) increasingly serve as automated evaluators, yet\nthey suffer from \"self-preference bias\": a tendency to favor their own outputs\nover those of other models. This bias undermines fairness and reliability in\nevaluation pipelines, particularly for tasks like preference tuning and model\nrouting. We investigate whether lightweight steering vectors can mitigate this\nproblem at inference time without retraining. We introduce a curated dataset\nthat distinguishes self-preference bias into justified examples of\nself-preference and unjustified examples of self-preference, and we construct\nsteering vectors using two methods: Contrastive Activation Addition (CAA) and\nan optimization-based approach. Our results show that steering vectors can\nreduce unjustified self-preference bias by up to 97\\%, substantially\noutperforming prompting and direct preference optimization baselines. Yet\nsteering vectors are unstable on legitimate self-preference and unbiased\nagreement, implying self-preference spans multiple or nonlinear directions.\nThis underscores both their promise and limits as safeguards for LLM-as-judges\nand motivates more robust interventions."}
{"id": "2509.04340", "pdf": "https://arxiv.org/pdf/2509.04340.pdf", "abs": "https://arxiv.org/abs/2509.04340", "title": "Write on Paper, Wrong in Practice: Why LLMs Still Struggle with Writing Clinical Notes", "authors": ["Kristina L. Kupferschmidt", "Kieran O'Doherty", "Joshua A. Skorburg"], "categories": ["cs.HC"], "comment": null, "summary": "Large Language Models (LLMs) are often proposed as tools to streamline\nclinical documentation, a task viewed as both high-volume and low-risk.\nHowever, even seemingly straightforward applications of LLMs raise complex\nsociotechnical considerations to translate into practice. This case study,\nconducted at KidsAbility, a pediatric rehabilitation facility in Ontario,\nCanada examined the use of LLMs to support occupational therapists in reducing\ndocumentation burden.We conducted a qualitative study involving 20 clinicians\nwho participated in pilot programs using two AI technologies: a general-purpose\nproprietary LLM and a bespoke model fine-tuned on proprietary historical\ndocumentation.\n  Our findings reveal that documentation challenges are sociotechnical in\nnature, shaped by clinical workflows, organizational policies, and system\nconstraints. Four key themes emerged: (1) the heterogeneity of workflows, (2)\nthe documentation burden is systemic and not directly linked to the creation of\nany single type of documentation, (3) the need for flexible tools and clinician\nautonomy, and (4) effective implementation requires mutual learning between\nclinicians and AI systems.\n  While LLMs show promise in easing documentation tasks, their success will\ndepend on flexible, adaptive integration that supports clinician autonomy.\nBeyond technical performance, sustained adoption will require training programs\nand implementation strategies that reflect the complexity of clinical\nenvironments."}
{"id": "2509.03662", "pdf": "https://arxiv.org/pdf/2509.03662.pdf", "abs": "https://arxiv.org/abs/2509.03662", "title": "Semantic Analysis of SNOMED CT Concept Co-occurrences in Clinical Documentation using MIMIC-IV", "authors": ["Ali Noori", "Somya Mohanty", "Prashanti Manda"], "categories": ["cs.CL"], "comment": null, "summary": "Clinical notes contain rich clinical narratives but their unstructured format\nposes challenges for large-scale analysis. Standardized terminologies such as\nSNOMED CT improve interoperability, yet understanding how concepts relate\nthrough co-occurrence and semantic similarity remains underexplored. In this\nstudy, we leverage the MIMIC-IV database to investigate the relationship\nbetween SNOMED CT concept co-occurrence patterns and embedding-based semantic\nsimilarity. Using Normalized Pointwise Mutual Information (NPMI) and pretrained\nembeddings (e.g., ClinicalBERT, BioBERT), we examine whether frequently\nco-occurring concepts are also semantically close, whether embeddings can\nsuggest missing concepts, and how these relationships evolve temporally and\nacross specialties. Our analyses reveal that while co-occurrence and semantic\nsimilarity are weakly correlated, embeddings capture clinically meaningful\nassociations not always reflected in documentation frequency. Embedding-based\nsuggestions frequently matched concepts later documented, supporting their\nutility for augmenting clinical annotations. Clustering of concept embeddings\nyielded coherent clinical themes (symptoms, labs, diagnoses, cardiovascular\nconditions) that map to patient phenotypes and care patterns. Finally,\nco-occurrence patterns linked to outcomes such as mortality and readmission\ndemonstrate the practical utility of this approach. Collectively, our findings\nhighlight the complementary value of co-occurrence statistics and semantic\nembeddings in improving documentation completeness, uncovering latent clinical\nrelationships, and informing decision support and phenotyping applications."}
{"id": "2509.04356", "pdf": "https://arxiv.org/pdf/2509.04356.pdf", "abs": "https://arxiv.org/abs/2509.04356", "title": "SRWToolkit: An Open Source Wizard of Oz Toolkit to Create Social Robotic Avatars", "authors": ["Atikkhan Faridkhan Nilgar", "Kristof Van Laerhoven", "Ayub Kinoti"], "categories": ["cs.HC", "cs.RO"], "comment": null, "summary": "We present SRWToolkit, an open-source Wizard of Oz toolkit designed to\nfacilitate the rapid prototyping of social robotic avatars powered by local\nlarge language models (LLMs). Our web-based toolkit enables multimodal\ninteraction through text input, button-activated speech, and wake-word command.\nThe toolkit offers real-time configuration of avatar appearance, behavior,\nlanguage, and voice via an intuitive control panel. In contrast to prior works\nthat rely on cloud-based LLM services, SRWToolkit emphasizes modularity and\nensures on-device functionality through local LLM inference. In our small-scale\nuser study ($n=11$), participants created and interacted with diverse robotic\nroles (hospital receptionist, mathematics teacher, and driving assistant),\nwhich demonstrated positive outcomes in the toolkit's usability, trust, and\nuser experience. The toolkit enables rapid and efficient development of robot\ncharacters customized to researchers' needs, supporting scalable research in\nhuman-robot interaction."}
{"id": "2509.03725", "pdf": "https://arxiv.org/pdf/2509.03725.pdf", "abs": "https://arxiv.org/abs/2509.03725", "title": "MLSD: A Novel Few-Shot Learning Approach to Enhance Cross-Target and Cross-Domain Stance Detection", "authors": ["Parush Gera", "Tempestt Neal"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "We present the novel approach for stance detection across domains and\ntargets, Metric Learning-Based Few-Shot Learning for Cross-Target and\nCross-Domain Stance Detection (MLSD). MLSD utilizes metric learning with\ntriplet loss to capture semantic similarities and differences between stance\ntargets, enhancing domain adaptation. By constructing a discriminative\nembedding space, MLSD allows a cross-target or cross-domain stance detection\nmodel to acquire useful examples from new target domains. We evaluate MLSD in\nmultiple cross-target and cross-domain scenarios across two datasets, showing\nstatistically significant improvement in stance detection performance across\nsix widely used stance detection models."}
{"id": "2509.04358", "pdf": "https://arxiv.org/pdf/2509.04358.pdf", "abs": "https://arxiv.org/abs/2509.04358", "title": "Privacy Perceptions in Robot-Assisted Well-Being Coaching: Examining the Roles of Information Transparency, User Control, and Proactivity", "authors": ["Atikkhan Faridkhan Nilgar", "Manuel Dietrich", "Kristof Van Laerhoven"], "categories": ["cs.HC", "cs.RO"], "comment": null, "summary": "Social robots are increasingly recognized as valuable supporters in the field\nof well-being coaching. They can function as independent coaches or provide\nsupport alongside human coaches, and healthcare professionals. In coaching\ninteractions, these robots often handle sensitive information shared by users,\nmaking privacy a relevant issue. Despite this, little is known about the\nfactors that shape users' privacy perceptions. This research aims to examine\nthree key factors systematically: (1) the transparency about information usage,\n(2) the level of specific user control over how the robot uses their\ninformation, and (3) the robot's behavioral approach - whether it acts\nproactively or only responds on demand. Our results from an online study (N =\n200) show that even when users grant the robot general access to personal data,\nthey additionally expect the ability to explicitly control how that information\nis interpreted and shared during sessions. Experimental conditions that\nprovided such control received significantly higher ratings for perceived\nprivacy appropriateness and trust. Compared to user control, the effects of\ntransparency and proactivity on privacy appropriateness perception were low,\nand we found no significant impact. The results suggest that merely informing\nusers or proactive sharing is insufficient without accompanying user control.\nThese insights underscore the need for further research on mechanisms that\nallow users to manage robots' information processing and sharing, especially\nwhen social robots take on more proactive roles alongside humans."}
{"id": "2509.03791", "pdf": "https://arxiv.org/pdf/2509.03791.pdf", "abs": "https://arxiv.org/abs/2509.03791", "title": "SiLVERScore: Semantically-Aware Embeddings for Sign Language Generation Evaluation", "authors": ["Saki Imai", "Mert İnan", "Anthony Sicilia", "Malihe Alikhani"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Evaluating sign language generation is often done through back-translation,\nwhere generated signs are first recognized back to text and then compared to a\nreference using text-based metrics. However, this two-step evaluation pipeline\nintroduces ambiguity: it not only fails to capture the multimodal nature of\nsign language-such as facial expressions, spatial grammar, and prosody-but also\nmakes it hard to pinpoint whether evaluation errors come from sign generation\nmodel or the translation system used to assess it. In this work, we propose\nSiLVERScore, a novel semantically-aware embedding-based evaluation metric that\nassesses sign language generation in a joint embedding space. Our contributions\ninclude: (1) identifying limitations of existing metrics, (2) introducing\nSiLVERScore for semantically-aware evaluation, (3) demonstrating its robustness\nto semantic and prosodic variations, and (4) exploring generalization\nchallenges across datasets. On PHOENIX-14T and CSL-Daily datasets, SiLVERScore\nachieves near-perfect discrimination between correct and random pairs (ROC AUC\n= 0.99, overlap < 7%), substantially outperforming traditional metrics."}
{"id": "2509.03536", "pdf": "https://arxiv.org/pdf/2509.03536.pdf", "abs": "https://arxiv.org/abs/2509.03536", "title": "PG-Agent: An Agent Powered by Page Graph", "authors": ["Weizhi Chen", "Ziwei Wang", "Leyang Yang", "Sheng Zhou", "Xiaoxuan Tang", "Jiajun Bu", "Yong Li", "Wei Jiang"], "categories": ["cs.AI", "cs.HC"], "comment": "Paper accepted to ACM MM 2025", "summary": "Graphical User Interface (GUI) agents possess significant commercial and\nsocial value, and GUI agents powered by advanced multimodal large language\nmodels (MLLMs) have demonstrated remarkable potential. Currently, existing GUI\nagents usually utilize sequential episodes of multi-step operations across\npages as the prior GUI knowledge, which fails to capture the complex transition\nrelationship between pages, making it challenging for the agents to deeply\nperceive the GUI environment and generalize to new scenarios. Therefore, we\ndesign an automated pipeline to transform the sequential episodes into page\ngraphs, which explicitly model the graph structure of the pages that are\nnaturally connected by actions. To fully utilize the page graphs, we further\nintroduce Retrieval-Augmented Generation (RAG) technology to effectively\nretrieve reliable perception guidelines of GUI from them, and a tailored\nmulti-agent framework PG-Agent with task decomposition strategy is proposed to\nbe injected with the guidelines so that it can generalize to unseen scenarios.\nExtensive experiments on various benchmarks demonstrate the effectiveness of\nPG-Agent, even with limited episodes for page graph construction."}
{"id": "2509.03805", "pdf": "https://arxiv.org/pdf/2509.03805.pdf", "abs": "https://arxiv.org/abs/2509.03805", "title": "Measuring How (Not Just Whether) VLMs Build Common Ground", "authors": ["Saki Imai", "Mert İnan", "Anthony Sicilia", "Malihe Alikhani"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large vision language models (VLMs) increasingly claim reasoning skills, yet\ncurrent benchmarks evaluate them in single-turn or question answering settings.\nHowever, grounding is an interactive process in which people gradually develop\nshared understanding through ongoing communication. We introduce a four-metric\nsuite (grounding efficiency, content alignment, lexical adaptation, and\nhuman-likeness) to systematically evaluate VLM performance in interactive\ngrounding contexts. We deploy the suite on 150 self-play sessions of\ninteractive referential games between three proprietary VLMs and compare them\nwith human dyads. All three models diverge from human patterns on at least\nthree metrics, while GPT4o-mini is the closest overall. We find that (i) task\nsuccess scores do not indicate successful grounding and (ii) high\nimage-utterance alignment does not necessarily predict task success. Our metric\nsuite and findings offer a framework for future research on VLM grounding."}
{"id": "2509.03728", "pdf": "https://arxiv.org/pdf/2509.03728.pdf", "abs": "https://arxiv.org/abs/2509.03728", "title": "PersonaTeaming: Exploring How Introducing Personas Can Improve Automated AI Red-Teaming", "authors": ["Wesley Hanwen Deng", "Sunnie S. Y. Kim", "Akshita Jha", "Ken Holstein", "Motahhare Eslami", "Lauren Wilcox", "Leon A Gatys"], "categories": ["cs.AI", "cs.HC"], "comment": null, "summary": "Recent developments in AI governance and safety research have called for\nred-teaming methods that can effectively surface potential risks posed by AI\nmodels. Many of these calls have emphasized how the identities and backgrounds\nof red-teamers can shape their red-teaming strategies, and thus the kinds of\nrisks they are likely to uncover. While automated red-teaming approaches\npromise to complement human red-teaming by enabling larger-scale exploration of\nmodel behavior, current approaches do not consider the role of identity. As an\ninitial step towards incorporating people's background and identities in\nautomated red-teaming, we develop and evaluate a novel method, PersonaTeaming,\nthat introduces personas in the adversarial prompt generation process to\nexplore a wider spectrum of adversarial strategies. In particular, we first\nintroduce a methodology for mutating prompts based on either \"red-teaming\nexpert\" personas or \"regular AI user\" personas. We then develop a dynamic\npersona-generating algorithm that automatically generates various persona types\nadaptive to different seed prompts. In addition, we develop a set of new\nmetrics to explicitly measure the \"mutation distance\" to complement existing\ndiversity measurements of adversarial prompts. Our experiments show promising\nimprovements (up to 144.1%) in the attack success rates of adversarial prompts\nthrough persona mutation, while maintaining prompt diversity, compared to\nRainbowPlus, a state-of-the-art automated red-teaming method. We discuss the\nstrengths and limitations of different persona types and mutation methods,\nshedding light on future opportunities to explore complementarities between\nautomated and human red-teaming approaches."}
{"id": "2509.03809", "pdf": "https://arxiv.org/pdf/2509.03809.pdf", "abs": "https://arxiv.org/abs/2509.03809", "title": "Align-then-Slide: A complete evaluation framework for Ultra-Long Document-Level Machine Translation", "authors": ["Jiaxin Guo", "Daimeng Wei", "Yuanchang Luo", "Xiaoyu Chen", "Zhanglin Wu", "Huan Yang", "Hengchao Shang", "Zongyao Li", "Zhiqiang Rao", "Jinlong Yang", "Hao Yang"], "categories": ["cs.CL", "cs.AI"], "comment": "under preview", "summary": "Large language models (LLMs) have ushered in a new era for document-level\nmachine translation (\\textit{doc}-mt), yet their whole-document outputs\nchallenge existing evaluation methods that assume sentence-by-sentence\nalignment. We introduce \\textit{\\textbf{Align-then-Slide}}, a complete\nevaluation framework for ultra-long doc-mt. In the Align stage, we\nautomatically infer sentence-level source-target correspondences and rebuild\nthe target to match the source sentence number, resolving omissions and\nmany-to-one/one-to-many mappings. In the n-Chunk Sliding Evaluate stage, we\ncalculate averaged metric scores under 1-, 2-, 3- and 4-chunk for\nmulti-granularity assessment. Experiments on the WMT benchmark show a Pearson\ncorrelation of 0.929 between our method with expert MQM rankings. On a newly\ncurated real-world test set, our method again aligns closely with human\njudgments. Furthermore, preference data produced by Align-then-Slide enables\neffective CPO training and its direct use as a reward model for GRPO, both\nyielding translations preferred over a vanilla SFT baseline. The results\nvalidate our framework as an accurate, robust, and actionable evaluation tool\nfor doc-mt systems."}
{"id": "2509.03848", "pdf": "https://arxiv.org/pdf/2509.03848.pdf", "abs": "https://arxiv.org/abs/2509.03848", "title": "Towards an Understanding of Developer Experience-Driven Transparency in Software Ecosystems", "authors": ["Rodrigo Oliveira Zacarias", "Rodrigo Pereira dos Santos", "Patricia Lago"], "categories": ["cs.SE", "cs.HC"], "comment": "36 pages Submitted to the ACM Transactions on Software Engineering\n  and Methodology. 2025", "summary": "Software ecosystems (SECO) have become a dominant paradigm in the software\nindustry, enabling third-party developers to co-create value through\ncomplementary components and services. While Developer Experience (DX) is\nincreasingly recognized as critical for sustainable SECO, transparency remains\nan underexplored factor shaping how developers perceive and interact with\necosystems. Existing studies acknowledge transparency as essential for trust,\nfairness, and engagement, yet its relationship with DX has not been\nsystematically conceptualized. Hence, this work aims to advance the\nunderstanding of transparency in SECO from a developer-centered perspective. To\nthis end, we propose SECO-TransDX (Transparency in Software Ecosystems from a\nDeveloper Experience Perspective), a conceptual model that introduces the\nnotion of DX-driven transparency. The model identifies 63 interrelated\nconcepts, including conditioning factors, ecosystem procedures, artifacts, and\nrelational dynamics that influence how transparency is perceived and\nconstructed during developer interactions. SECO-TransDX was built upon prior\nresearch and refined through a Delphi study with experts from academia and\nindustry. It offers a structured lens to examine how transparency mediates DX\nacross technical, social, and organizational layers. For researchers, it lays\nthe groundwork for future studies and tool development; for practitioners, it\nsupports the design of trustworthy, developer-centered platforms that improve\ntransparency and foster long-term engagement in SECO."}
{"id": "2509.03829", "pdf": "https://arxiv.org/pdf/2509.03829.pdf", "abs": "https://arxiv.org/abs/2509.03829", "title": "NE-PADD: Leveraging Named Entity Knowledge for Robust Partial Audio Deepfake Detection via Attention Aggregation", "authors": ["Huhong Xian", "Rui Liu", "Berrak Sisman", "Haizhou Li"], "categories": ["cs.CL"], "comment": null, "summary": "Different from traditional sentence-level audio deepfake detection (ADD),\npartial audio deepfake detection (PADD) requires frame-level positioning of the\nlocation of fake speech. While some progress has been made in this area,\nleveraging semantic information from audio, especially named entities, remains\nan underexplored aspect. To this end, we propose NE-PADD, a novel method for\nPartial Audio Deepfake Detection (PADD) that leverages named entity knowledge\nthrough two parallel branches: Speech Name Entity Recognition (SpeechNER) and\nPADD. The approach incorporates two attention aggregation mechanisms: Attention\nFusion (AF) for combining attention weights and Attention Transfer (AT) for\nguiding PADD with named entity semantics using an auxiliary loss. Built on the\nPartialSpoof-NER dataset, experiments show our method outperforms existing\nbaselines, proving the effectiveness of integrating named entity knowledge in\nPADD. The code is available at https://github.com/AI-S2-Lab/NE-PADD."}
{"id": "2509.04056", "pdf": "https://arxiv.org/pdf/2509.04056.pdf", "abs": "https://arxiv.org/abs/2509.04056", "title": "The MolecularWeb Universe: Web-Based, Immersive, Multiuser Molecular Graphics And Modeling, for Education and Work in Chemistry, Structural Biology, and Materials Sciences", "authors": ["Luciano A. Abriata"], "categories": ["physics.chem-ph", "cs.HC"], "comment": "37 pages, 7 figures", "summary": "Molecular visualization software has long supported research and education in\nchemical and structural sciences, but consumer devices constrained to 2D inputs\nand outputs pose two major challenges: they poorly convey 3D nature, and 3D\nmanipulation is very difficult. eXtended Reality (XR, including AR and VR)\noffers new ways to see and interact with molecules in three dimensions. This\nchapter presents the \"MolecularWeb\" ecosystem (https://molecularweb.org), a set\nof web-based tools for immersive visualization, modeling, and simulations,\nalready widely used in education and science communication and now expanding\ntoward research applications. We cover moleculARweb, which provides AR\neducational activities via phones, tablets, and computers; MolecularWebXR, a\nmultiuser WebXR platform accessible from both headsets and simpler devices,\nsupporting immersive education, outreach, and scientific discussion; and\nPDB2AR, which enables users to generate custom content for MolecularWebXR and\nstandalone AR/VR. Finally, we introduce a prototype and an upcoming version of\nHandMol, our latest WebXR software which allows concurrent multiuser immersive\nvisualization and modeling of molecules with bare hands supported by real-time\nmolecular mechanics, natural language input via a language model, and access\nthrough both high-end headsets or consumer devices like smartphones and\nlaptops. Together, these tools demonstrate the present and near-future of\naccessible, interactive molecular science on the web."}
{"id": "2509.03867", "pdf": "https://arxiv.org/pdf/2509.03867.pdf", "abs": "https://arxiv.org/abs/2509.03867", "title": "Drivel-ology: Challenging LLMs with Interpreting Nonsense with Depth", "authors": ["Yang Wang", "Chenghao Xiao", "Chia-Yi Hsiao", "Zi Yan Chang", "Chi-Li Chen", "Tyler Loakman", "Chenghua Lin"], "categories": ["cs.CL"], "comment": "Accepted for oral presentation at the EMNLP 2025 Main Conference", "summary": "We introduce Drivelology, a unique linguistic phenomenon characterised as\n\"nonsense with depth\", utterances that are syntactically coherent yet\npragmatically paradoxical, emotionally loaded, or rhetorically subversive.\nWhile such expressions may resemble surface-level nonsense, they encode\nimplicit meaning requiring contextual inference, moral reasoning, or emotional\ninterpretation. We find that current large language models (LLMs), despite\nexcelling at many natural language processing (NLP) tasks, consistently fail to\ngrasp the layered semantics of Drivelological text. To investigate this, we\nconstruct a small but diverse benchmark dataset of over 1,200 meticulously\ncurated examples, with select instances in English, Mandarin, Spanish, French,\nJapanese, and Korean. Annotation was especially challenging: each of the\nexamples required careful expert review to verify that it truly reflected\nDrivelological characteristics. The process involved multiple rounds of\ndiscussion and adjudication to address disagreements, highlighting the subtle\nand subjective nature of the Drivelology. We evaluate a range of LLMs on\nclassification, generation, and reasoning tasks. Our results reveal clear\nlimitations of LLMs: models often confuse Drivelology with shallow nonsense,\nproduce incoherent justifications, or miss the implied rhetorical function\naltogether. These findings highlight a deeper representational gap in LLMs'\npragmatic understanding and challenge the assumption that statistical fluency\nimplies cognitive comprehension. We release our dataset and code to facilitate\nfurther research in modelling linguistic depth beyond surface-level coherence."}
{"id": "2509.04104", "pdf": "https://arxiv.org/pdf/2509.04104.pdf", "abs": "https://arxiv.org/abs/2509.04104", "title": "Towards Stable and Personalised Profiles for Lexical Alignment in Spoken Human-Agent Dialogue", "authors": ["Keara Schaaij", "Roel Boumans", "Tibor Bosse", "Iris Hendrickx"], "categories": ["cs.CL", "cs.HC"], "comment": "Accepted for TSD 2025", "summary": "Lexical alignment, where speakers start to use similar words across\nconversation, is known to contribute to successful communication. However, its\nimplementation in conversational agents remains underexplored, particularly\nconsidering the recent advancements in large language models (LLMs). As a first\nstep towards enabling lexical alignment in human-agent dialogue, this study\ndraws on strategies for personalising conversational agents and investigates\nthe construction of stable, personalised lexical profiles as a basis for\nlexical alignment. Specifically, we varied the amounts of transcribed spoken\ndata used for construction as well as the number of items included in the\nprofiles per part-of-speech (POS) category and evaluated profile performance\nacross time using recall, coverage, and cosine similarity metrics. It was shown\nthat smaller and more compact profiles, created after 10 min of transcribed\nspeech containing 5 items for adjectives, 5 items for conjunctions, and 10\nitems for adverbs, nouns, pronouns, and verbs each, offered the best balance in\nboth performance and data efficiency. In conclusion, this study offers\npractical insights into constructing stable, personalised lexical profiles,\ntaking into account minimal data requirements, serving as a foundational step\ntoward lexical alignment strategies in conversational agents."}
{"id": "2509.03871", "pdf": "https://arxiv.org/pdf/2509.03871.pdf", "abs": "https://arxiv.org/abs/2509.03871", "title": "A Comprehensive Survey on Trustworthiness in Reasoning with Large Language Models", "authors": ["Yanbo Wang", "Yongcan Yu", "Jian Liang", "Ran He"], "categories": ["cs.CL", "cs.AI", "cs.CR"], "comment": "38 pages. This survey considers papers published up to June 30, 2025.\n  Work in progress", "summary": "The development of Long-CoT reasoning has advanced LLM performance across\nvarious tasks, including language understanding, complex problem solving, and\ncode generation. This paradigm enables models to generate intermediate\nreasoning steps, thereby improving both accuracy and interpretability. However,\ndespite these advancements, a comprehensive understanding of how CoT-based\nreasoning affects the trustworthiness of language models remains\nunderdeveloped. In this paper, we survey recent work on reasoning models and\nCoT techniques, focusing on five core dimensions of trustworthy reasoning:\ntruthfulness, safety, robustness, fairness, and privacy. For each aspect, we\nprovide a clear and structured overview of recent studies in chronological\norder, along with detailed analyses of their methodologies, findings, and\nlimitations. Future research directions are also appended at the end for\nreference and discussion. Overall, while reasoning techniques hold promise for\nenhancing model trustworthiness through hallucination mitigation, harmful\ncontent detection, and robustness improvement, cutting-edge reasoning models\nthemselves often suffer from comparable or even greater vulnerabilities in\nsafety, robustness, and privacy. By synthesizing these insights, we hope this\nwork serves as a valuable and timely resource for the AI safety community to\nstay informed on the latest progress in reasoning trustworthiness. A full list\nof related papers can be found at\n\\href{https://github.com/ybwang119/Awesome-reasoning-safety}{https://github.com/ybwang119/Awesome-reasoning-safety}."}
{"id": "2509.04343", "pdf": "https://arxiv.org/pdf/2509.04343.pdf", "abs": "https://arxiv.org/abs/2509.04343", "title": "Psychologically Enhanced AI Agents", "authors": ["Maciej Besta", "Shriram Chandran", "Robert Gerstenberger", "Mathis Lindner", "Marcin Chrapek", "Sebastian Hermann Martschat", "Taraneh Ghandi", "Patrick Iff", "Hubert Niewiadomski", "Piotr Nyczyk", "Jürgen Müller", "Torsten Hoefler"], "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.HC", "cs.MA"], "comment": null, "summary": "We introduce MBTI-in-Thoughts, a framework for enhancing the effectiveness of\nLarge Language Model (LLM) agents through psychologically grounded personality\nconditioning. Drawing on the Myers-Briggs Type Indicator (MBTI), our method\nprimes agents with distinct personality archetypes via prompt engineering,\nenabling control over behavior along two foundational axes of human psychology,\ncognition and affect. We show that such personality priming yields consistent,\ninterpretable behavioral biases across diverse tasks: emotionally expressive\nagents excel in narrative generation, while analytically primed agents adopt\nmore stable strategies in game-theoretic settings. Our framework supports\nexperimenting with structured multi-agent communication protocols and reveals\nthat self-reflection prior to interaction improves cooperation and reasoning\nquality. To ensure trait persistence, we integrate the official 16Personalities\ntest for automated verification. While our focus is on MBTI, we show that our\napproach generalizes seamlessly to other psychological frameworks such as Big\nFive, HEXACO, or Enneagram. By bridging psychological theory and LLM behavior\ndesign, we establish a foundation for psychologically enhanced AI agents\nwithout any fine-tuning."}
{"id": "2509.03888", "pdf": "https://arxiv.org/pdf/2509.03888.pdf", "abs": "https://arxiv.org/abs/2509.03888", "title": "False Sense of Security: Why Probing-based Malicious Input Detection Fails to Generalize", "authors": ["Cheng Wang", "Zeming Wei", "Qin Liu", "Muhao Chen"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) can comply with harmful instructions, raising\nserious safety concerns despite their impressive capabilities. Recent work has\nleveraged probing-based approaches to study the separability of malicious and\nbenign inputs in LLMs' internal representations, and researchers have proposed\nusing such probing methods for safety detection. We systematically re-examine\nthis paradigm. Motivated by poor out-of-distribution performance, we\nhypothesize that probes learn superficial patterns rather than semantic\nharmfulness. Through controlled experiments, we confirm this hypothesis and\nidentify the specific patterns learned: instructional patterns and trigger\nwords. Our investigation follows a systematic approach, progressing from\ndemonstrating comparable performance of simple n-gram methods, to controlled\nexperiments with semantically cleaned datasets, to detailed analysis of pattern\ndependencies. These results reveal a false sense of security around current\nprobing-based approaches and highlight the need to redesign both models and\nevaluation protocols, for which we provide further discussions in the hope of\nsuggesting responsible further research in this direction. We have open-sourced\nthe project at https://github.com/WangCheng0116/Why-Probe-Fails."}
{"id": "2509.04404", "pdf": "https://arxiv.org/pdf/2509.04404.pdf", "abs": "https://arxiv.org/abs/2509.04404", "title": "No Thoughts Just AI: Biased LLM Recommendations Limit Human Agency in Resume Screening", "authors": ["Kyra Wilson", "Mattea Sim", "Anna-Maria Gueorguieva", "Aylin Caliskan"], "categories": ["cs.CY", "cs.AI", "cs.CL", "cs.HC", "K.4.2"], "comment": "Published in Proceedings of the 2025 AAAI/ACM Conference on AI,\n  Ethics, and Society; code available at\n  https://github.com/kyrawilson/No-Thoughts-Just-AI", "summary": "In this study, we conduct a resume-screening experiment (N=528) where people\ncollaborate with simulated AI models exhibiting race-based preferences (bias)\nto evaluate candidates for 16 high and low status occupations. Simulated AI\nbias approximates factual and counterfactual estimates of racial bias in\nreal-world AI systems. We investigate people's preferences for White, Black,\nHispanic, and Asian candidates (represented through names and affinity groups\non quality-controlled resumes) across 1,526 scenarios and measure their\nunconscious associations between race and status using implicit association\ntests (IATs), which predict discriminatory hiring decisions but have not been\ninvestigated in human-AI collaboration. When making decisions without AI or\nwith AI that exhibits no race-based preferences, people select all candidates\nat equal rates. However, when interacting with AI favoring a particular group,\npeople also favor those candidates up to 90% of the time, indicating a\nsignificant behavioral shift. The likelihood of selecting candidates whose\nidentities do not align with common race-status stereotypes can increase by 13%\nif people complete an IAT before conducting resume screening. Finally, even if\npeople think AI recommendations are low quality or not important, their\ndecisions are still vulnerable to AI bias under certain circumstances. This\nwork has implications for people's autonomy in AI-HITL scenarios, AI and work,\ndesign and evaluation of AI hiring systems, and strategies for mitigating bias\nin collaborative decision-making tasks. In particular, organizational and\nregulatory policy should acknowledge the complex nature of AI-HITL decision\nmaking when implementing these systems, educating people who use them, and\ndetermining which are subject to oversight."}
{"id": "2509.03891", "pdf": "https://arxiv.org/pdf/2509.03891.pdf", "abs": "https://arxiv.org/abs/2509.03891", "title": "MobileRAG: Enhancing Mobile Agent with Retrieval-Augmented Generation", "authors": ["Gowen Loo", "Chang Liu", "Qinghong Yin", "Xiang Chen", "Jiawei Chen", "Jingyuan Zhang", "Yu Tian"], "categories": ["cs.CL", "cs.CV"], "comment": null, "summary": "Smartphones have become indispensable in people's daily lives, permeating\nnearly every aspect of modern society. With the continuous advancement of large\nlanguage models (LLMs), numerous LLM-based mobile agents have emerged. These\nagents are capable of accurately parsing diverse user queries and automatically\nassisting users in completing complex or repetitive operations. However,\ncurrent agents 1) heavily rely on the comprehension ability of LLMs, which can\nlead to errors caused by misoperations or omitted steps during tasks, 2) lack\ninteraction with the external environment, often terminating tasks when an app\ncannot fulfill user queries, and 3) lack memory capabilities, requiring each\ninstruction to reconstruct the interface and being unable to learn from and\ncorrect previous mistakes. To alleviate the above issues, we propose MobileRAG,\na mobile agents framework enhanced by Retrieval-Augmented Generation (RAG),\nwhich includes InterRAG, LocalRAG, and MemRAG. It leverages RAG to more quickly\nand accurately identify user queries and accomplish complex and long-sequence\nmobile tasks. Additionally, to more comprehensively assess the performance of\nMobileRAG, we introduce MobileRAG-Eval, a more challenging benchmark\ncharacterized by numerous complex, real-world mobile tasks that require\nexternal knowledge assistance. Extensive experimental results on MobileRAG-Eval\ndemonstrate that MobileRAG can easily handle real-world mobile tasks, achieving\n10.3\\% improvement over state-of-the-art methods with fewer operational steps.\nOur code is publicly available at:\nhttps://github.com/liuxiaojieOutOfWorld/MobileRAG_arxiv"}
{"id": "2509.04441", "pdf": "https://arxiv.org/pdf/2509.04441.pdf", "abs": "https://arxiv.org/abs/2509.04441", "title": "DEXOP: A Device for Robotic Transfer of Dexterous Human Manipulation", "authors": ["Hao-Shu Fang", "Branden Romero", "Yichen Xie", "Arthur Hu", "Bo-Ruei Huang", "Juan Alvarez", "Matthew Kim", "Gabriel Margolis", "Kavya Anbarasu", "Masayoshi Tomizuka", "Edward Adelson", "Pulkit Agrawal"], "categories": ["cs.RO", "cs.AI", "cs.CV", "cs.HC"], "comment": "project page: https://dex-op.github.io", "summary": "We introduce perioperation, a paradigm for robotic data collection that\nsensorizes and records human manipulation while maximizing the transferability\nof the data to real robots. We implement this paradigm in DEXOP, a passive hand\nexoskeleton designed to maximize human ability to collect rich sensory (vision\n+ tactile) data for diverse dexterous manipulation tasks in natural\nenvironments. DEXOP mechanically connects human fingers to robot fingers,\nproviding users with direct contact feedback (via proprioception) and mirrors\nthe human hand pose to the passive robot hand to maximize the transfer of\ndemonstrated skills to the robot. The force feedback and pose mirroring make\ntask demonstrations more natural for humans compared to teleoperation,\nincreasing both speed and accuracy. We evaluate DEXOP across a range of\ndexterous, contact-rich tasks, demonstrating its ability to collect\nhigh-quality demonstration data at scale. Policies learned with DEXOP data\nsignificantly improve task performance per unit time of data collection\ncompared to teleoperation, making DEXOP a powerful tool for advancing robot\ndexterity. Our project page is at https://dex-op.github.io."}
{"id": "2509.03918", "pdf": "https://arxiv.org/pdf/2509.03918.pdf", "abs": "https://arxiv.org/abs/2509.03918", "title": "MTQA:Matrix of Thought for Enhanced Reasoning in Complex Question Answering", "authors": ["Fengxiao Tang", "Yufeng Li", "Zongzong Wu", "Ming Zhao"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Complex Question Answering (QA) is a fundamental and challenging task in NLP.\nWhile large language models (LLMs) exhibit impressive performance in QA, they\nsuffer from significant performance degradation when facing complex and\nabstract QA tasks due to insufficient reasoning capabilities. Works such as\nChain-of-Thought (CoT) and Tree-of-Thought (ToT) aim to enhance LLMs' reasoning\nabilities, but they face issues such as in-layer redundancy in tree structures\nand single paths in chain structures. Although some studies utilize\nRetrieval-Augmented Generation (RAG) methods to assist LLMs in reasoning, the\nchallenge of effectively utilizing large amounts of information involving\nmultiple entities and hops remains critical. To address this, we propose the\nMatrix of Thought (MoT), a novel and efficient LLM thought structure. MoT\nexplores the problem in both horizontal and vertical dimensions through the\n\"column-cell communication\" mechanism, enabling LLMs to actively engage in\nmulti-strategy and deep-level thinking, reducing redundancy within the column\ncells and enhancing reasoning capabilities. Furthermore, we develop a\nfact-correction mechanism by constructing knowledge units from retrieved\nknowledge graph triples and raw text to enhance the initial knowledge for LLM\nreasoning and correct erroneous answers. This leads to the development of an\nefficient and accurate QA framework (MTQA). Experimental results show that our\nframework outperforms state-of-the-art methods on four widely-used datasets in\nterms of F1 and EM scores, with reasoning time only 14.4\\% of the baseline\nmethods, demonstrating both its efficiency and accuracy. The code for this\nframework is available at https://github.com/lyfiter/mtqa."}
{"id": "2502.18348", "pdf": "https://arxiv.org/pdf/2502.18348.pdf", "abs": "https://arxiv.org/abs/2502.18348", "title": "Towards softerware: Enabling personalization of interactive data representations for users with disabilities", "authors": ["Frank Elavsky", "Marita Vindedal", "Ted Gies", "Patrick Carrington", "Dominik Moritz", "Øystein Moseng"], "categories": ["cs.HC"], "comment": "pre-print, accepted for CG&A special issue on Inclusive Data\n  Experiences, 13 pages", "summary": "Accessible design for some may still produce barriers for others. This\ntension, called access friction, creates challenges for both designers and\nend-users with disabilities. To address this, we present the concept of\nsofterware, a system design approach that provides end users with agency to\nmeaningfully customize and adapt interfaces to their needs. To apply softerware\nto visualization, we assembled 195 data visualization customization options\ncentered on the barriers we expect users with disabilities will experience. We\nbuilt a prototype that applies a subset of these options and interviewed\npractitioners for feedback. Lastly, we conducted a design probe study with\nblind and low vision accessibility professionals to learn more about their\nchallenges and visions for softerware. We observed access frictions between our\nparticipant's designs and they expressed that for softerware's success, current\nand future systems must be designed with accessible defaults, interoperability,\npersistence, and respect for a user's perceived effort-to-outcome ratio."}
{"id": "2509.03932", "pdf": "https://arxiv.org/pdf/2509.03932.pdf", "abs": "https://arxiv.org/abs/2509.03932", "title": "Decoding the Poetic Language of Emotion in Korean Modern Poetry: Insights from a Human-Labeled Dataset and AI Modeling", "authors": ["Iro Lim", "Haein Ji", "Byungjun Kim"], "categories": ["cs.CL", "cs.CY", "cs.LG"], "comment": "30 pages, 13 tables, 2 figures, Digital Humanities and Social\n  Sciences Korea Conference, James Joo-Jin Kim Center for Korean Studies,\n  University of Pennsylvania, Philadelphia, USA", "summary": "This study introduces KPoEM (Korean Poetry Emotion Mapping) , a novel dataset\nfor computational emotion analysis in modern Korean poetry. Despite remarkable\nprogress in text-based emotion classification using large language models,\npoetry-particularly Korean poetry-remains underexplored due to its figurative\nlanguage and cultural specificity. We built a multi-label emotion dataset of\n7,662 entries, including 7,007 line-level entries from 483 poems and 615\nwork-level entries, annotated with 44 fine-grained emotion categories from five\ninfluential Korean poets. A state-of-the-art Korean language model fine-tuned\non this dataset significantly outperformed previous models, achieving 0.60\nF1-micro compared to 0.34 from models trained on general corpora. The KPoEM\nmodel, trained through sequential fine-tuning-first on general corpora and then\non the KPoEM dataset-demonstrates not only an enhanced ability to identify\ntemporally and culturally specific emotional expressions, but also a strong\ncapacity to preserve the core sentiments of modern Korean poetry. This study\nbridges computational methods and literary analysis, presenting new\npossibilities for the quantitative exploration of poetic emotions through\nstructured data that faithfully retains the emotional and cultural nuances of\nKorean literature."}
{"id": "2505.05923", "pdf": "https://arxiv.org/pdf/2505.05923.pdf", "abs": "https://arxiv.org/abs/2505.05923", "title": "Human causal perception in a cube-stacking task", "authors": ["Nikolai Bahr", "Christoph Zetzsche"], "categories": ["cs.HC"], "comment": "7 pages, 6 figures", "summary": "In intuitive physics the process of stacking cubes has become a paradigmatic,\ncanonical task. Even though it gets employed in various shades and\ncomplexities, the very fundamental setting with two cubes has not been\nthoroughly investigated. Furthermore, the majority of settings feature only a\nreduced, one dimensional (1D) decision space. In this paper an experiment is\nconducted in which participants judge the stability of two cubes stacked on top\nof each other. It is performed in the full 3D setting which features a 2D\ndecision surface. The analysis yield a shape of a rotated square for the\nperceived stability area instead of the commonly reported safety margin in 1D.\nThis implies a more complex decision behavior in human than previously assumed."}
{"id": "2509.03934", "pdf": "https://arxiv.org/pdf/2509.03934.pdf", "abs": "https://arxiv.org/abs/2509.03934", "title": "SelfAug: Mitigating Catastrophic Forgetting in Retrieval-Augmented Generation via Distribution Self-Alignment", "authors": ["Yuqing Huang", "Rongyang Zhang", "Qimeng Wang", "Chengqiang Lu", "Yan Gao", "Yi Wu", "Yao Hu", "Xuyang Zhi", "Guiquan Liu", "Xin Li", "Hao Wang", "Enhong Chen"], "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Recent advancements in large language models (LLMs) have revolutionized\nnatural language processing through their remarkable capabilities in\nunderstanding and executing diverse tasks. While supervised fine-tuning,\nparticularly in Retrieval-Augmented Generation (RAG) scenarios, effectively\nenhances task-specific performance, it often leads to catastrophic forgetting,\nwhere models lose their previously acquired knowledge and general capabilities.\nExisting solutions either require access to general instruction data or face\nlimitations in preserving the model's original distribution. To overcome these\nlimitations, we propose SelfAug, a self-distribution alignment method that\naligns input sequence logits to preserve the model's semantic distribution,\nthereby mitigating catastrophic forgetting and improving downstream\nperformance. Extensive experiments demonstrate that SelfAug achieves a superior\nbalance between downstream learning and general capability retention. Our\ncomprehensive empirical analysis reveals a direct correlation between\ndistribution shifts and the severity of catastrophic forgetting in RAG\nscenarios, highlighting how the absence of RAG capabilities in general\ninstruction tuning leads to significant distribution shifts during fine-tuning.\nOur findings not only advance the understanding of catastrophic forgetting in\nRAG contexts but also provide a practical solution applicable across diverse\nfine-tuning scenarios. Our code is publicly available at\nhttps://github.com/USTC-StarTeam/SelfAug."}
{"id": "2508.08524", "pdf": "https://arxiv.org/pdf/2508.08524.pdf", "abs": "https://arxiv.org/abs/2508.08524", "title": "StreetViewAI: Making Street View Accessible Using Context-Aware Multimodal AI", "authors": ["Jon E. Froehlich", "Alexander Fiannaca", "Nimer Jaber", "Victor Tsaran", "Shaun Kane"], "categories": ["cs.HC", "cs.AI", "H.5; I.2"], "comment": "Accepted to UIST'25 v2. Fixed a missing word in the PDF v3. Fixed a\n  typo in an author's name", "summary": "Interactive streetscape mapping tools such as Google Street View (GSV) and\nMeta Mapillary enable users to virtually navigate and experience real-world\nenvironments via immersive 360{\\deg} imagery but remain fundamentally\ninaccessible to blind users. We introduce StreetViewAI, the first-ever\naccessible street view tool, which combines context-aware, multimodal AI,\naccessible navigation controls, and conversational speech. With StreetViewAI,\nblind users can virtually examine destinations, engage in open-world\nexploration, or virtually tour any of the over 220 billion images and 100+\ncountries where GSV is deployed. We iteratively designed StreetViewAI with a\nmixed-visual ability team and performed an evaluation with eleven blind users.\nOur findings demonstrate the value of an accessible street view in supporting\nPOI investigations and remote route planning. We close by enumerating key\nguidelines for future work."}
{"id": "2509.03937", "pdf": "https://arxiv.org/pdf/2509.03937.pdf", "abs": "https://arxiv.org/abs/2509.03937", "title": "SPFT-SQL: Enhancing Large Language Model for Text-to-SQL Parsing by Self-Play Fine-Tuning", "authors": ["Yuhao Zhang", "Shaoming Duan", "Jinhang Su", "Chuanyi Liu", "Peiyi Han"], "categories": ["cs.CL", "cs.AI"], "comment": "EMNLP 2025 Findings", "summary": "Despite the significant advancements of self-play fine-tuning (SPIN), which\ncan transform a weak large language model (LLM) into a strong one through\ncompetitive interactions between models of varying capabilities, it still faces\nchallenges in the Text-to-SQL task. SPIN does not generate new information, and\nthe large number of correct SQL queries produced by the opponent model during\nself-play reduces the main model's ability to generate accurate SQL queries. To\naddress this challenge, we propose a new self-play fine-tuning method tailored\nfor the Text-to-SQL task, called SPFT-SQL. Prior to self-play, we introduce a\nverification-based iterative fine-tuning approach, which synthesizes\nhigh-quality fine-tuning data iteratively based on the database schema and\nvalidation feedback to enhance model performance, while building a model base\nwith varying capabilities. During the self-play fine-tuning phase, we propose\nan error-driven loss method that incentivizes incorrect outputs from the\nopponent model, enabling the main model to distinguish between correct SQL and\nerroneous SQL generated by the opponent model, thereby improving its ability to\ngenerate correct SQL. Extensive experiments and in-depth analyses on six\nopen-source LLMs and five widely used benchmarks demonstrate that our approach\noutperforms existing state-of-the-art (SOTA) methods."}
{"id": "2211.12143", "pdf": "https://arxiv.org/pdf/2211.12143.pdf", "abs": "https://arxiv.org/abs/2211.12143", "title": "Autonomation, Not Automation: Activities and Needs of European Fact-checkers as a Basis for Designing Human-Centered AI Systems", "authors": ["Andrea Hrckova", "Robert Moro", "Ivan Srba", "Jakub Simko", "Maria Bielikova"], "categories": ["cs.CY", "cs.AI", "cs.HC"], "comment": "44 pages, 13 figures, 2 annexes. Accepted to ACM Journal on\n  Responsible Computing", "summary": "To mitigate the negative effects of false information more effectively, the\ndevelopment of Artificial Intelligence (AI) systems to assist fact-checkers is\nneeded. Nevertheless, the lack of focus on the needs of these stakeholders\nresults in their limited acceptance and skepticism toward automating the whole\nfact-checking process. In this study, we conducted semi-structured in-depth\ninterviews with Central European fact-checkers. Their activities and problems\nwere analyzed using iterative content analysis. The most significant problems\nwere validated with a survey of European fact-checkers, in which we collected\n24 responses from 20 countries, i.e., 62% of active European signatories of the\nInternational Fact-Checking Network (IFCN). Our contributions include an\nin-depth examination of the variability of fact-checking work in\nnon-English-speaking regions, which still remained largely uncovered. By\naligning them with the knowledge from prior studies, we created conceptual\nmodels that help to understand the fact-checking processes. In addition, we\nmapped our findings on the fact-checkers' activities and needs to the relevant\ntasks for AI research, while providing a discussion on three AI tasks that were\nnot covered by previous similar studies. The new opportunities identified for\nAI researchers and developers have implications for the focus of AI research in\nthis domain."}
{"id": "2509.03940", "pdf": "https://arxiv.org/pdf/2509.03940.pdf", "abs": "https://arxiv.org/abs/2509.03940", "title": "VoxRole: A Comprehensive Benchmark for Evaluating Speech-Based Role-Playing Agents", "authors": ["Weihao Wu", "Liang Cao", "Xinyu Wu", "Zhiwei Lin", "Rui Niu", "Jingbei Li", "Zhiyong Wu"], "categories": ["cs.CL", "cs.AI", "cs.SD"], "comment": null, "summary": "Recent significant advancements in Large Language Models (LLMs) have greatly\npropelled the development of Role-Playing Conversational Agents (RPCAs). These\nsystems aim to create immersive user experiences through consistent persona\nadoption. However, current RPCA research faces dual limitations. First,\nexisting work predominantly focuses on the textual modality, entirely\noverlooking critical paralinguistic features including intonation, prosody, and\nrhythm in speech, which are essential for conveying character emotions and\nshaping vivid identities. Second, the speech-based role-playing domain suffers\nfrom a long-standing lack of standardized evaluation benchmarks. Most current\nspoken dialogue datasets target only fundamental capability assessments,\nfeaturing thinly sketched or ill-defined character profiles. Consequently, they\nfail to effectively quantify model performance on core competencies like\nlong-term persona consistency. To address this critical gap, we introduce\nVoxRole, the first comprehensive benchmark specifically designed for the\nevaluation of speech-based RPCAs. The benchmark comprises 13335 multi-turn\ndialogues, totaling 65.6 hours of speech from 1228 unique characters across 261\nmovies. To construct this resource, we propose a novel two-stage automated\npipeline that first aligns movie audio with scripts and subsequently employs an\nLLM to systematically build multi-dimensional profiles for each character.\nLeveraging VoxRole, we conduct a multi-dimensional evaluation of contemporary\nspoken dialogue models, revealing crucial insights into their respective\nstrengths and limitations in maintaining persona consistency."}
{"id": "2306.17477", "pdf": "https://arxiv.org/pdf/2306.17477.pdf", "abs": "https://arxiv.org/abs/2306.17477", "title": "Beyond-Voice: Towards Continuous 3D Hand Pose Tracking on Commercial Home Assistant Devices", "authors": ["Yin Li", "Rohan Reddy", "Cheng Zhang", "Rajalakshmi Nandakumar"], "categories": ["cs.SD", "cs.HC", "eess.AS"], "comment": "Accepted by IPSN 2024", "summary": "The surging popularity of home assistants and their voice user interface\n(VUI) have made them an ideal central control hub for smart home devices.\nHowever, current form factors heavily rely on VUI, which poses accessibility\nand usability issues; some latest ones are equipped with additional cameras and\ndisplays, which are costly and raise privacy concerns. These concerns jointly\nmotivate Beyond-Voice, a novel high-fidelity acoustic sensing system that\nallows commodity home assistant devices to track and reconstruct hand poses\ncontinuously. It transforms the home assistant into an active sonar system\nusing its existing onboard microphones and speakers. We feed a high-resolution\nrange profile to the deep learning model that can analyze the motions of\nmultiple body parts and predict the 3D positions of 21 finger joints, bringing\nthe granularity for acoustic hand tracking to the next level. It operates\nacross different environments and users without the need for personalized\ntraining data. A user study with 11 participants in 3 different environments\nshows that Beyond-Voice can track joints with an average mean absolute error of\n16.47mm without any training data provided by the testing subject."}
{"id": "2509.03957", "pdf": "https://arxiv.org/pdf/2509.03957.pdf", "abs": "https://arxiv.org/abs/2509.03957", "title": "CANDY: Benchmarking LLMs' Limitations and Assistive Potential in Chinese Misinformation Fact-Checking", "authors": ["Ruiling Guo", "Xinwei Yang", "Chen Huang", "Tong Zhang", "Yong Hu"], "categories": ["cs.CL", "cs.AI"], "comment": "Findings of EMNLP 2025", "summary": "The effectiveness of large language models (LLMs) to fact-check\nmisinformation remains uncertain, despite their growing use. To this end, we\npresent CANDY, a benchmark designed to systematically evaluate the capabilities\nand limitations of LLMs in fact-checking Chinese misinformation. Specifically,\nwe curate a carefully annotated dataset of ~20k instances. Our analysis shows\nthat current LLMs exhibit limitations in generating accurate fact-checking\nconclusions, even when enhanced with chain-of-thought reasoning and few-shot\nprompting. To understand these limitations, we develop a taxonomy to categorize\nflawed LLM-generated explanations for their conclusions and identify factual\nfabrication as the most common failure mode. Although LLMs alone are unreliable\nfor fact-checking, our findings indicate their considerable potential to\naugment human performance when deployed as assistive tools in scenarios. Our\ndataset and code can be accessed at https://github.com/SCUNLP/CANDY"}
{"id": "2311.17165", "pdf": "https://arxiv.org/pdf/2311.17165.pdf", "abs": "https://arxiv.org/abs/2311.17165", "title": "(Ir)rationality in AI: State of the Art, Research Challenges and Open Questions", "authors": ["Olivia Macmillan-Scott", "Mirco Musolesi"], "categories": ["cs.AI", "cs.CY", "cs.HC", "cs.LG", "cs.MA"], "comment": null, "summary": "The concept of rationality is central to the field of artificial intelligence\n(AI). Whether we are seeking to simulate human reasoning, or trying to achieve\nbounded optimality, our goal is generally to make artificial agents as rational\nas possible. Despite the centrality of the concept within AI, there is no\nunified definition of what constitutes a rational agent. This article provides\na survey of rationality and irrationality in AI, and sets out the open\nquestions in this area. We consider how the understanding of rationality in\nother fields has influenced its conception within AI, in particular work in\neconomics, philosophy and psychology. Focusing on the behaviour of artificial\nagents, we examine irrational behaviours that can prove to be optimal in\ncertain scenarios. Some methods have been developed to deal with irrational\nagents, both in terms of identification and interaction, however work in this\narea remains limited. Methods that have up to now been developed for other\npurposes, namely adversarial scenarios, may be adapted to suit interactions\nwith artificial agents. We further discuss the interplay between human and\nartificial agents, and the role that rationality plays within this interaction;\nmany questions remain in this area, relating to potentially irrational\nbehaviour of both humans and artificial agents."}
{"id": "2509.03962", "pdf": "https://arxiv.org/pdf/2509.03962.pdf", "abs": "https://arxiv.org/abs/2509.03962", "title": "Exploring NLP Benchmarks in an Extremely Low-Resource Setting", "authors": ["Ulin Nuha", "Adam Jatowt"], "categories": ["cs.CL"], "comment": null, "summary": "The effectiveness of Large Language Models (LLMs) diminishes for extremely\nlow-resource languages, such as indigenous languages, primarily due to the lack\nof labeled data. Despite growing interest, the availability of high-quality\nnatural language processing (NLP) datasets for these languages remains limited,\nmaking it difficult to develop robust language technologies. This paper\naddresses such gap by focusing on Ladin, an endangered Romance language,\nspecifically targeting the Val Badia variant. Leveraging a small set of\nparallel Ladin-Italian sentence pairs, we create synthetic datasets for\nsentiment analysis and multiple-choice question answering (MCQA) by translating\nmonolingual Italian data. To ensure linguistic quality and reliability, we\napply rigorous filtering and back-translation procedures in our method. We\nfurther demonstrate that incorporating these synthetic datasets into machine\ntranslation training leads to substantial improvements over existing\nItalian-Ladin translation baselines. Our contributions include the first\npublicly available sentiment analysis and MCQA datasets for Ladin, establishing\nfoundational resources that can support broader NLP research and downstream\napplications for this underrepresented language."}
{"id": "2408.04348", "pdf": "https://arxiv.org/pdf/2408.04348.pdf", "abs": "https://arxiv.org/abs/2408.04348", "title": "Fuzzy to Clear: Elucidating the Threat Hunter Cognitive Process and Cognitive Support Needs", "authors": ["Alessandra Maciel Paz Milani", "Arty Starr", "Samantha Hill", "Callum Curtis", "Norman Anderson", "David Moreno-Lumbreras", "Margaret-Anne Storey"], "categories": ["cs.CR", "cs.HC"], "comment": "22 Pages; 5 Figures; 8 Tables", "summary": "With security threats increasing in frequency and severity, it is critical\nthat we consider the important role of threat hunters. These highly-trained\nsecurity professionals learn to see, identify, and intercept security threats.\nMany recent works and existing tools in cybersecurity are focused on automating\nthe threat hunting process, often overlooking the critical human element. Our\nstudy shifts this paradigm by emphasizing a human-centered approach to\nunderstanding the lived experiences of threat hunters. By observing threat\nhunters during hunting sessions and analyzing the rich insights they provide,\nwe seek to advance the understanding of their cognitive processes and the tool\nsupport they need. Through an in-depth observational study of threat hunters,\nwe introduce a model of how they build and refine their mental models during\nthreat hunting sessions. We also present 23 themes that provide a foundation to\nbetter understand threat hunter needs and suggest five actionable design\npropositions to enhance the tools that support them. Through these\ncontributions, our work enriches the theoretical understanding of threat\nhunting and provides practical insights for designing more effective,\nhuman-centered cybersecurity tools."}
{"id": "2509.03972", "pdf": "https://arxiv.org/pdf/2509.03972.pdf", "abs": "https://arxiv.org/abs/2509.03972", "title": "Expanding Foundational Language Capabilities in Open-Source LLMs through a Korean Case Study", "authors": ["Junghwan Lim", "Gangwon Jo", "Sungmin Lee", "Jiyoung Park", "Dongseok Kim", "Jihwan Kim", "Junhyeok Lee", "Wai Ting Cheung", "Dahye Choi", "Kibong Choi", "Jaeyeon Huh", "Beomgyu Kim", "Jangwoong Kim", "Taehyun Kim", "Haesol Lee", "Jeesoo Lee", "Dongpin Oh", "Changseok Song", "Daewon Suh"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "We introduce Llama-3-Motif, a language model consisting of 102 billion\nparameters, specifically designed to enhance Korean capabilities while\nretaining strong performance in English. Developed on the Llama 3 architecture,\nLlama-3-Motif employs advanced training techniques, including LlamaPro and\nMasked Structure Growth, to effectively scale the model without altering its\ncore Transformer architecture. Using the MoAI platform for efficient training\nacross hyperscale GPU clusters, we optimized Llama-3-Motif using a carefully\ncurated dataset that maintains a balanced ratio of Korean and English data.\nLlama-3-Motif shows decent performance on Korean-specific benchmarks,\noutperforming existing models and achieving results comparable to GPT-4."}
{"id": "2501.19241", "pdf": "https://arxiv.org/pdf/2501.19241.pdf", "abs": "https://arxiv.org/abs/2501.19241", "title": "Emancipatory Information Retrieval", "authors": ["Bhaskar Mitra"], "categories": ["cs.IR", "cs.HC"], "comment": null, "summary": "Our world today is facing a confluence of several mutually reinforcing crises\neach of which intersects with concerns of social justice and emancipation. This\npaper is a provocation for the role of computer-mediated information access in\nour emancipatory struggles. We define emancipatory information retrieval as the\nstudy and development of information access methods that challenge various\nforms of human oppression, and situates its activities within broader\ncollective emancipatory praxis. The term \"emancipatory\" here signifies the\nmoral concerns of universal humanization of all peoples and the elimination of\noppression to create the conditions under which we can collectively flourish.\nTo develop an emancipatory research agenda for information retrieval (IR), in\nthis paper we speculate about the practices that the community can adopt,\nenumerate some of the projects that the field should undertake, and discuss\nprovocations to spark new ideas and directions for research. We challenge the\nfield of IR research to embrace humanistic values and commit to universal\nemancipation and social justice. We also invite scholars from fields such as\nhuman-computer interaction, information sciences, media studies, design,\nscience and technology studies, social and political sciences, philosophy, law,\nenvironmental sciences, public health, educational sciences, as well as legal\nand policy experts, civil rights advocates, social justice activists and\nmovement organizers, and artists to join us in realizing this transformation.\nIn this process, we must both imagine post-oppressive worlds, and reimagine the\nrole of IR in that world and in the journey that leads us there."}
{"id": "2509.03995", "pdf": "https://arxiv.org/pdf/2509.03995.pdf", "abs": "https://arxiv.org/abs/2509.03995", "title": "RTQA : Recursive Thinking for Complex Temporal Knowledge Graph Question Answering with Large Language Models", "authors": ["Zhaoyan Gong", "Juan Li", "Zhiqiang Liu", "Lei Liang", "Huajun Chen", "Wen Zhang"], "categories": ["cs.CL", "cs.AI"], "comment": "EMNLP 2025", "summary": "Current temporal knowledge graph question answering (TKGQA) methods primarily\nfocus on implicit temporal constraints, lacking the capability of handling more\ncomplex temporal queries, and struggle with limited reasoning abilities and\nerror propagation in decomposition frameworks. We propose RTQA, a novel\nframework to address these challenges by enhancing reasoning over TKGs without\nrequiring training. Following recursive thinking, RTQA recursively decomposes\nquestions into sub-problems, solves them bottom-up using LLMs and TKG\nknowledge, and employs multi-path answer aggregation to improve fault\ntolerance. RTQA consists of three core components: the Temporal Question\nDecomposer, the Recursive Solver, and the Answer Aggregator. Experiments on\nMultiTQ and TimelineKGQA benchmarks demonstrate significant Hits@1 improvements\nin \"Multiple\" and \"Complex\" categories, outperforming state-of-the-art methods.\nOur code and data are available at https://github.com/zjukg/RTQA."}
{"id": "2504.13392", "pdf": "https://arxiv.org/pdf/2504.13392.pdf", "abs": "https://arxiv.org/abs/2504.13392", "title": "POET: Supporting Prompting Creativity and Personalization with Automated Expansion of Text-to-Image Generation", "authors": ["Evans Xu Han", "Alice Qian Zhang", "Haiyi Zhu", "Hong Shen", "Paul Pu Liang", "Jane Hsieh"], "categories": ["cs.CV", "cs.HC"], "comment": null, "summary": "State-of-the-art visual generative AI tools hold immense potential to assist\nusers in the early ideation stages of creative tasks -- offering the ability to\ngenerate (rather than search for) novel and unprecedented (instead of existing)\nimages of considerable quality that also adhere to boundless combinations of\nuser specifications. However, many large-scale text-to-image systems are\ndesigned for broad applicability, yielding conventional output that may limit\ncreative exploration. They also employ interaction methods that may be\ndifficult for beginners. Given that creative end users often operate in\ndiverse, context-specific ways that are often unpredictable, more variation and\npersonalization are necessary. We introduce POET, a real-time interactive tool\nthat (1) automatically discovers dimensions of homogeneity in text-to-image\ngenerative models, (2) expands these dimensions to diversify the output space\nof generated images, and (3) learns from user feedback to personalize\nexpansions. An evaluation with 28 users spanning four creative task domains\ndemonstrated POET's ability to generate results with higher perceived diversity\nand help users reach satisfaction in fewer prompts during creative tasks,\nthereby prompting them to deliberate and reflect more on a wider range of\npossible produced results during the co-creative process. Focusing on visual\ncreativity, POET offers a first glimpse of how interaction techniques of future\ntext-to-image generation tools may support and align with more pluralistic\nvalues and the needs of end users during the ideation stages of their work."}
{"id": "2509.04013", "pdf": "https://arxiv.org/pdf/2509.04013.pdf", "abs": "https://arxiv.org/abs/2509.04013", "title": "On Robustness and Reliability of Benchmark-Based Evaluation of LLMs", "authors": ["Riccardo Lunardi", "Vincenzo Della Mea", "Stefano Mizzaro", "Kevin Roitero"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted at ECAI 2025", "summary": "Large Language Models (LLMs) effectiveness is usually evaluated by means of\nbenchmarks such as MMLU, ARC-C, or HellaSwag, where questions are presented in\ntheir original wording, thus in a fixed, standardized format. However,\nreal-world applications involve linguistic variability, requiring models to\nmaintain their effectiveness across diverse rewordings of the same question or\nquery. In this study, we systematically assess the robustness of LLMs to\nparaphrased benchmark questions and investigate whether benchmark-based\nevaluations provide a reliable measure of model capabilities. We systematically\ngenerate various paraphrases of all the questions across six different common\nbenchmarks, and measure the resulting variations in effectiveness of 34\nstate-of-the-art LLMs, of different size and effectiveness. Our findings reveal\nthat while LLM rankings remain relatively stable across paraphrased inputs,\nabsolute effectiveness scores change, and decline significantly. This suggests\nthat LLMs struggle with linguistic variability, raising concerns about their\ngeneralization abilities and evaluation methodologies. Furthermore, the\nobserved performance drop challenges the reliability of benchmark-based\nevaluations, indicating that high benchmark scores may not fully capture a\nmodel's robustness to real-world input variations. We discuss the implications\nof these findings for LLM evaluation methodologies, emphasizing the need for\nrobustness-aware benchmarks that better reflect practical deployment scenarios."}
{"id": "2509.00167", "pdf": "https://arxiv.org/pdf/2509.00167.pdf", "abs": "https://arxiv.org/abs/2509.00167", "title": "Pilot Study on Generative AI and Critical Thinking in Higher Education Classrooms", "authors": ["W. F. Lamberti", "S. R. Lawrence", "D. White", "S. Kim", "S. Abdullah"], "categories": ["cs.CY", "cs.AI", "cs.HC", "stat.AP"], "comment": null, "summary": "Generative AI (GAI) tools have seen rapid adoption in educational settings,\nyet their role in fostering critical thinking remains underexplored. While\nprevious studies have examined GAI as a tutor for specific lessons or as a tool\nfor completing assignments, few have addressed how students critically evaluate\nthe accuracy and appropriateness of GAI-generated responses. This pilot study\ninvestigates students' ability to apply structured critical thinking when\nassessing Generative AI outputs in introductory Computational and Data Science\ncourses. Given that GAI tools often produce contextually flawed or factually\nincorrect answers, we designed learning activities that require students to\nanalyze, critique, and revise AI-generated solutions. Our findings offer\ninitial insights into students' ability to engage critically with GAI content\nand lay the groundwork for more comprehensive studies in future semesters."}
{"id": "2509.04032", "pdf": "https://arxiv.org/pdf/2509.04032.pdf", "abs": "https://arxiv.org/abs/2509.04032", "title": "What if I ask in \\textit{alia lingua}? Measuring Functional Similarity Across Languages", "authors": ["Debangan Mishra", "Arihant Rastogi", "Agyeya Negi", "Shashwat Goel", "Ponnurangam Kumaraguru"], "categories": ["cs.CL", "cs.LG"], "comment": "Preprint, 11 Pages", "summary": "How similar are model outputs across languages? In this work, we study this\nquestion using a recently proposed model similarity metric $\\kappa_p$ applied\nto 20 languages and 47 subjects in GlobalMMLU. Our analysis reveals that a\nmodel's responses become increasingly consistent across languages as its size\nand capability grow. Interestingly, models exhibit greater cross-lingual\nconsistency within themselves than agreement with other models prompted in the\nsame language. These results highlight not only the value of $\\kappa_p$ as a\npractical tool for evaluating multilingual reliability, but also its potential\nto guide the development of more consistent multilingual systems."}
{"id": "2509.00616", "pdf": "https://arxiv.org/pdf/2509.00616.pdf", "abs": "https://arxiv.org/abs/2509.00616", "title": "TimeCopilot", "authors": ["Azul Garza", "Reneé Rosillo"], "categories": ["cs.LG", "cs.AI", "cs.HC"], "comment": null, "summary": "We introduce TimeCopilot, the first open-source agentic framework for\nforecasting that combines multiple Time Series Foundation Models (TSFMs) with\nLarge Language Models (LLMs) through a single unified API. TimeCopilot\nautomates the forecasting pipeline: feature analysis, model selection,\ncross-validation, and forecast generation, while providing natural language\nexplanations and supporting direct queries about the future. The framework is\nLLM-agnostic, compatible with both commercial and open-source models, and\nsupports ensembles across diverse forecasting families. Results on the\nlarge-scale GIFT-Eval benchmark show that TimeCopilot achieves state-of-the-art\nprobabilistic forecasting performance at low cost. Our framework provides a\npractical foundation for reproducible, explainable, and accessible agentic\nforecasting systems."}
{"id": "2509.04046", "pdf": "https://arxiv.org/pdf/2509.04046.pdf", "abs": "https://arxiv.org/abs/2509.04046", "title": "A RoBERTa-Based Functional Syntax Annotation Model for Chinese Texts", "authors": ["Han Xiaohui", "Zhang Yunlong", "Guo Yuxi"], "categories": ["cs.CL", "I.2.7"], "comment": "The paper includes 10 pages, 6 tables, and 4 figures. This project is\n  completed with the assistance of National Center for Language Technology and\n  Digital Economy Research (No. GJLX20250002), and is funded by Heilongjiang\n  Language Research Committee Project Construction of an Adaptive Intelligent\n  Chinese Learning Platform for International Students in China (No. G2025Y003)", "summary": "Systemic Functional Grammar and its branch, Cardiff Grammar, have been widely\napplied to discourse analysis, semantic function research, and other tasks\nacross various languages and texts. However, an automatic annotation system\nbased on this theory for Chinese texts has not yet been developed, which\nsignificantly constrains the application and promotion of relevant theories. To\nfill this gap, this research introduces a functional syntax annotation model\nfor Chinese based on RoBERTa (Robustly Optimized BERT Pretraining Approach).\nThe study randomly selected 4,100 sentences from the People's Daily 2014 corpus\nand annotated them according to functional syntax theory to establish a dataset\nfor training. The study then fine-tuned the RoBERTa-Chinese wwm-ext model based\non the dataset to implement the named entity recognition task, achieving an F1\nscore of 0.852 on the test set that significantly outperforms other comparative\nmodels. The model demonstrated excellent performance in identifying core\nsyntactic elements such as Subject (S), Main Verb (M), and Complement (C).\nNevertheless, there remains room for improvement in recognizing entities with\nimbalanced label samples. As the first integration of functional syntax with\nattention-based NLP models, this research provides a new method for automated\nChinese functional syntax analysis and lays a solid foundation for subsequent\nstudies."}
{"id": "2509.01909", "pdf": "https://arxiv.org/pdf/2509.01909.pdf", "abs": "https://arxiv.org/abs/2509.01909", "title": "Oyster-I: Beyond Refusal -- Constructive Safety Alignment for Responsible Language Models", "authors": ["Ranjie Duan", "Jiexi Liu", "Xiaojun Jia", "Shiji Zhao", "Ruoxi Cheng", "Fengxiang Wang", "Cheng Wei", "Yong Xie", "Chang Liu", "Defeng Li", "Yinpeng Dong", "Yichi Zhang", "Yuefeng Chen", "Chongwen Wang", "Xingjun Ma", "Xingxing Wei", "Yang Liu", "Hang Su", "Jun Zhu", "Xinfeng Li", "Yitong Sun", "Jie Zhang", "Jinzhao Hu", "Sha Xu", "Yitong Yang", "Jialing Tao", "Hui Xue"], "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.HC", "cs.SC"], "comment": "Technical Report Code & Model weights available:\n  https://github.com/Alibaba-AAIG/Oyster", "summary": "Large language models (LLMs) typically deploy safety mechanisms to prevent\nharmful content generation. Most current approaches focus narrowly on risks\nposed by malicious actors, often framing risks as adversarial events and\nrelying on defensive refusals. However, in real-world settings, risks also come\nfrom non-malicious users seeking help while under psychological distress (e.g.,\nself-harm intentions). In such cases, the model's response can strongly\ninfluence the user's next actions. Simple refusals may lead them to repeat,\nescalate, or move to unsafe platforms, creating worse outcomes. We introduce\nConstructive Safety Alignment (CSA), a human-centric paradigm that protects\nagainst malicious misuse while actively guiding vulnerable users toward safe\nand helpful results. Implemented in Oyster-I (Oy1), CSA combines game-theoretic\nanticipation of user reactions, fine-grained risk boundary discovery, and\ninterpretable reasoning control, turning safety into a trust-building process.\nOy1 achieves state-of-the-art safety among open models while retaining high\ngeneral capabilities. On our Constructive Benchmark, it shows strong\nconstructive engagement, close to GPT-5, and unmatched robustness on the\nStrata-Sword jailbreak dataset, nearing GPT-o1 levels. By shifting from\nrefusal-first to guidance-first safety, CSA redefines the model-user\nrelationship, aiming for systems that are not just safe, but meaningfully\nhelpful. We release Oy1, code, and the benchmark to support responsible,\nuser-centered AI."}
{"id": "2509.04059", "pdf": "https://arxiv.org/pdf/2509.04059.pdf", "abs": "https://arxiv.org/abs/2509.04059", "title": "Synthesizing Sheet Music Problems for Evaluation and Reinforcement Learning", "authors": ["Zhilin Wang", "Zhe Yang", "Yun Luo", "Yafu Li", "Haoran Zhang", "Runzhe Zhan", "Derek F. Wong", "Jizhe Zhou", "Yu Cheng"], "categories": ["cs.CL"], "comment": "11 pages", "summary": "Enhancing the ability of Large Language Models (LLMs) and Multimodal Large\nLanguage Models (MLLMs) to interpret sheet music is a crucial step toward\nbuilding AI musicians. However, current research lacks both evaluation\nbenchmarks and training data for sheet music reasoning. To address this, we\npropose the idea of synthesizing sheet music problems grounded in music theory,\nwhich can serve both as evaluation benchmarks and as training data for\nreinforcement learning with verifiable rewards (RLVR). We introduce a data\nsynthesis framework that generates verifiable sheet music questions in both\ntextual and visual modalities, leading to the Synthetic Sheet Music Reasoning\nBenchmark (SSMR-Bench) and a complementary training set. Evaluation results on\nSSMR-Bench show the importance of models' reasoning abilities in interpreting\nsheet music. At the same time, the poor performance of Gemini 2.5-Pro\nhighlights the challenges that MLLMs still face in interpreting sheet music in\na visual format. By leveraging synthetic data for RLVR, Qwen3-8B-Base and\nQwen2.5-VL-Instruct achieve improvements on the SSMR-Bench. Besides, the\ntrained Qwen3-8B-Base surpasses GPT-4 in overall performance on\nMusicTheoryBench and achieves reasoning performance comparable to GPT-4 with\nthe strategies of Role play and Chain-of-Thought. Notably, its performance on\nmath problems also improves relative to the original Qwen3-8B-Base.\nFurthermore, our results show that the enhanced reasoning ability can also\nfacilitate music composition. In conclusion, we are the first to propose the\nidea of synthesizing sheet music problems based on music theory rules, and\ndemonstrate its effectiveness not only in advancing model reasoning for sheet\nmusic understanding but also in unlocking new possibilities for AI-assisted\nmusic creation."}
{"id": "2509.04066", "pdf": "https://arxiv.org/pdf/2509.04066.pdf", "abs": "https://arxiv.org/abs/2509.04066", "title": "Arabic Chatbot Technologies in Education: An Overview", "authors": ["Hicham Bourhil", "Yacine El Younoussi"], "categories": ["cs.CL"], "comment": "Published as a book chapter in: Transformaci\\'on Digital en la\n  Educaci\\'on: Innovaciones y Desaf\\'ios desde los Campus Virtuales (UA\n  Journals, 2024), pp. 11-14", "summary": "The recent advancements in Artificial Intelligence (AI) in general, and in\nNatural Language Processing (NLP) in particular, and some of its applications\nsuch as chatbots, have led to their implementation in different domains like\neducation, healthcare, tourism, and customer service. Since the COVID-19\npandemic, there has been an increasing interest in these digital technologies\nto allow and enhance remote access. In education, e-learning systems have been\nmassively adopted worldwide. The emergence of Large Language Models (LLM) such\nas BERT (Bidirectional Encoder Representations from Transformers) and GPT\n(Generative Pre-trained Transformers) made chatbots even more popular. In this\nstudy, we present a survey on existing Arabic chatbots in education and their\ndifferent characteristics such as the adopted approaches, language variety, and\nmetrics used to measure their performance. We were able to identified some\nresearch gaps when we discovered that, despite the success of chatbots in other\nlanguages such as English, only a few educational Arabic chatbots used modern\ntechniques. Finally, we discuss future directions of research in this field."}
{"id": "2509.04077", "pdf": "https://arxiv.org/pdf/2509.04077.pdf", "abs": "https://arxiv.org/abs/2509.04077", "title": "Improving Narrative Classification and Explanation via Fine Tuned Language Models", "authors": ["Rishit Tyagi", "Rahul Bouri", "Mohit Gupta"], "categories": ["cs.CL"], "comment": null, "summary": "Understanding covert narratives and implicit messaging is essential for\nanalyzing bias and sentiment. Traditional NLP methods struggle with detecting\nsubtle phrasing and hidden agendas. This study tackles two key challenges: (1)\nmulti-label classification of narratives and sub-narratives in news articles,\nand (2) generating concise, evidence-based explanations for dominant\nnarratives. We fine-tune a BERT model with a recall-oriented approach for\ncomprehensive narrative detection, refining predictions using a GPT-4o pipeline\nfor consistency. For narrative explanation, we propose a ReACT (Reasoning +\nActing) framework with semantic retrieval-based few-shot prompting, ensuring\ngrounded and relevant justifications. To enhance factual accuracy and reduce\nhallucinations, we incorporate a structured taxonomy table as an auxiliary\nknowledge base. Our results show that integrating auxiliary knowledge in\nprompts improves classification accuracy and justification reliability, with\napplications in media analysis, education, and intelligence gathering."}
{"id": "2509.04104", "pdf": "https://arxiv.org/pdf/2509.04104.pdf", "abs": "https://arxiv.org/abs/2509.04104", "title": "Towards Stable and Personalised Profiles for Lexical Alignment in Spoken Human-Agent Dialogue", "authors": ["Keara Schaaij", "Roel Boumans", "Tibor Bosse", "Iris Hendrickx"], "categories": ["cs.CL", "cs.HC"], "comment": "Accepted for TSD 2025", "summary": "Lexical alignment, where speakers start to use similar words across\nconversation, is known to contribute to successful communication. However, its\nimplementation in conversational agents remains underexplored, particularly\nconsidering the recent advancements in large language models (LLMs). As a first\nstep towards enabling lexical alignment in human-agent dialogue, this study\ndraws on strategies for personalising conversational agents and investigates\nthe construction of stable, personalised lexical profiles as a basis for\nlexical alignment. Specifically, we varied the amounts of transcribed spoken\ndata used for construction as well as the number of items included in the\nprofiles per part-of-speech (POS) category and evaluated profile performance\nacross time using recall, coverage, and cosine similarity metrics. It was shown\nthat smaller and more compact profiles, created after 10 min of transcribed\nspeech containing 5 items for adjectives, 5 items for conjunctions, and 10\nitems for adverbs, nouns, pronouns, and verbs each, offered the best balance in\nboth performance and data efficiency. In conclusion, this study offers\npractical insights into constructing stable, personalised lexical profiles,\ntaking into account minimal data requirements, serving as a foundational step\ntoward lexical alignment strategies in conversational agents."}
{"id": "2509.04111", "pdf": "https://arxiv.org/pdf/2509.04111.pdf", "abs": "https://arxiv.org/abs/2509.04111", "title": "MultiWikiQA: A Reading Comprehension Benchmark in 300+ Languages", "authors": ["Dan Saattrup Smart"], "categories": ["cs.CL"], "comment": null, "summary": "We introduce a new reading comprehension dataset, dubbed MultiWikiQA, which\ncovers 306 languages. The context data comes from Wikipedia articles, with\nquestions generated by an LLM and the answers appearing verbatim in the\nWikipedia articles. We conduct a crowdsourced human evaluation of the fluency\nof the generated questions across 30 of the languages, providing evidence that\nthe questions are of good quality. We evaluate 6 different language models,\nboth decoder and encoder models of varying sizes, showing that the benchmark is\nsufficiently difficult and that there is a large performance discrepancy\namongst the languages. The dataset and survey evaluations are freely available."}
{"id": "2509.04182", "pdf": "https://arxiv.org/pdf/2509.04182.pdf", "abs": "https://arxiv.org/abs/2509.04182", "title": "Joint Modeling of Entities and Discourse Relations for Coherence Assessment", "authors": ["Wei Liu", "Michael Strube"], "categories": ["cs.CL"], "comment": "EMNLP 2025", "summary": "In linguistics, coherence can be achieved by different means, such as by\nmaintaining reference to the same set of entities across sentences and by\nestablishing discourse relations between them. However, most existing work on\ncoherence modeling focuses exclusively on either entity features or discourse\nrelation features, with little attention given to combining the two. In this\nstudy, we explore two methods for jointly modeling entities and discourse\nrelations for coherence assessment. Experiments on three benchmark datasets\nshow that integrating both types of features significantly enhances the\nperformance of coherence models, highlighting the benefits of modeling both\nsimultaneously for coherence evaluation."}
{"id": "2509.04183", "pdf": "https://arxiv.org/pdf/2509.04183.pdf", "abs": "https://arxiv.org/abs/2509.04183", "title": "MAGneT: Coordinated Multi-Agent Generation of Synthetic Multi-Turn Mental Health Counseling Sessions", "authors": ["Aishik Mandal", "Tanmoy Chakraborty", "Iryna Gurevych"], "categories": ["cs.CL", "cs.AI"], "comment": "25 pages, 29 figures", "summary": "The growing demand for scalable psychological counseling highlights the need\nfor fine-tuning open-source Large Language Models (LLMs) with high-quality,\nprivacy-compliant data, yet such data remains scarce. Here we introduce MAGneT,\na novel multi-agent framework for synthetic psychological counseling session\ngeneration that decomposes counselor response generation into coordinated\nsub-tasks handled by specialized LLM agents, each modeling a key psychological\ntechnique. Unlike prior single-agent approaches, MAGneT better captures the\nstructure and nuance of real counseling. In addition, we address\ninconsistencies in prior evaluation protocols by proposing a unified evaluation\nframework integrating diverse automatic and expert metrics. Furthermore, we\nexpand the expert evaluations from four aspects of counseling in previous works\nto nine aspects, enabling a more thorough and robust assessment of data\nquality. Empirical results show that MAGneT significantly outperforms existing\nmethods in quality, diversity, and therapeutic alignment of the generated\ncounseling sessions, improving general counseling skills by 3.2% and\nCBT-specific skills by 4.3% on average on cognitive therapy rating scale\n(CTRS). Crucially, experts prefer MAGneT-generated sessions in 77.2% of cases\non average across all aspects. Moreover, fine-tuning an open-source model on\nMAGneT-generated sessions shows better performance, with improvements of 6.3%\non general counseling skills and 7.3% on CBT-specific skills on average on CTRS\nover those fine-tuned with sessions generated by baseline methods. We also make\nour code and data public."}
{"id": "2509.04202", "pdf": "https://arxiv.org/pdf/2509.04202.pdf", "abs": "https://arxiv.org/abs/2509.04202", "title": "Explicit and Implicit Data Augmentation for Social Event Detection", "authors": ["Congbo Ma", "Yuxia Wang", "Jia Wu", "Jian Yang", "Jing Du", "Zitai Qiu", "Qing Li", "Hu Wang", "Preslav Nakov"], "categories": ["cs.CL", "cs.SI"], "comment": null, "summary": "Social event detection involves identifying and categorizing important events\nfrom social media, which relies on labeled data, but annotation is costly and\nlabor-intensive. To address this problem, we propose Augmentation framework for\nSocial Event Detection (SED-Aug), a plug-and-play dual augmentation framework,\nwhich combines explicit text-based and implicit feature-space augmentation to\nenhance data diversity and model robustness. The explicit augmentation utilizes\nlarge language models to enhance textual information through five diverse\ngeneration strategies. For implicit augmentation, we design five novel\nperturbation techniques that operate in the feature space on structural fused\nembeddings. These perturbations are crafted to keep the semantic and relational\nproperties of the embeddings and make them more diverse. Specifically, SED-Aug\noutperforms the best baseline model by approximately 17.67% on the Twitter2012\ndataset and by about 15.57% on the Twitter2018 dataset in terms of the average\nF1 score. The code is available at GitHub: https://github.com/congboma/SED-Aug."}
{"id": "2509.04292", "pdf": "https://arxiv.org/pdf/2509.04292.pdf", "abs": "https://arxiv.org/abs/2509.04292", "title": "Inverse IFEval: Can LLMs Unlearn Stubborn Training Conventions to Follow Real Instructions?", "authors": ["Qinyan Zhang", "Xinping Lei", "Ruijie Miao", "Yu Fu", "Haojie Fan", "Le Chang", "Jiafan Hou", "Dingling Zhang", "Zhongfei Hou", "Ziqiang Yang", "Changxin Pu", "Fei Hu", "Jingkai Liu", "Mengyun Liu", "Yang Liu", "Xiang Gao", "Jiaheng Liu", "Tong Yang", "Zaiyuan Wang", "Ge Zhang", "Wenhao Huang"], "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) achieve strong performance on diverse tasks but\noften exhibit cognitive inertia, struggling to follow instructions that\nconflict with the standardized patterns learned during supervised fine-tuning\n(SFT). To evaluate this limitation, we propose Inverse IFEval, a benchmark that\nmeasures models Counter-intuitive Abilitytheir capacity to override\ntraining-induced biases and comply with adversarial instructions. Inverse\nIFEval introduces eight types of such challenges, including Question\nCorrection, Intentional Textual Flaws, Code without Comments, and\nCounterfactual Answering. Using a human-in-the-loop pipeline, we construct a\ndataset of 1012 high-quality Chinese and English questions across 23 domains,\nevaluated under an optimized LLM-as-a-Judge framework. Experiments on existing\nleading LLMs demonstrate the necessity of our proposed Inverse IFEval\nbenchmark. Our findings emphasize that future alignment efforts should not only\npursue fluency and factual correctness but also account for adaptability under\nunconventional contexts. We hope that Inverse IFEval serves as both a\ndiagnostic tool and a foundation for developing methods that mitigate cognitive\ninertia, reduce overfitting to narrow patterns, and ultimately enhance the\ninstruction-following reliability of LLMs in diverse and unpredictable\nreal-world scenarios."}
{"id": "2509.04304", "pdf": "https://arxiv.org/pdf/2509.04304.pdf", "abs": "https://arxiv.org/abs/2509.04304", "title": "Facts Fade Fast: Evaluating Memorization of Outdated Medical Knowledge in Large Language Models", "authors": ["Juraj Vladika", "Mahdi Dhaini", "Florian Matthes"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted to Findings of EMNLP 2025", "summary": "The growing capabilities of Large Language Models (LLMs) show significant\npotential to enhance healthcare by assisting medical researchers and\nphysicians. However, their reliance on static training data is a major risk\nwhen medical recommendations evolve with new research and developments. When\nLLMs memorize outdated medical knowledge, they can provide harmful advice or\nfail at clinical reasoning tasks. To investigate this problem, we introduce two\nnovel question-answering (QA) datasets derived from systematic reviews:\nMedRevQA (16,501 QA pairs covering general biomedical knowledge) and\nMedChangeQA (a subset of 512 QA pairs where medical consensus has changed over\ntime). Our evaluation of eight prominent LLMs on the datasets reveals\nconsistent reliance on outdated knowledge across all models. We additionally\nanalyze the influence of obsolete pre-training data and training strategies to\nexplain this phenomenon and propose future directions for mitigation, laying\nthe groundwork for developing more current and reliable medical AI systems."}
{"id": "2509.04357", "pdf": "https://arxiv.org/pdf/2509.04357.pdf", "abs": "https://arxiv.org/abs/2509.04357", "title": "PARCO: Phoneme-Augmented Robust Contextual ASR via Contrastive Entity Disambiguation", "authors": ["Jiajun He", "Naoki Sawada", "Koichi Miyazaki", "Tomoki Toda"], "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.SD"], "comment": "Accepted by ASRU 2025", "summary": "Automatic speech recognition (ASR) systems struggle with domain-specific\nnamed entities, especially homophones. Contextual ASR improves recognition but\noften fails to capture fine-grained phoneme variations due to limited entity\ndiversity. Moreover, prior methods treat entities as independent tokens,\nleading to incomplete multi-token biasing. To address these issues, we propose\nPhoneme-Augmented Robust Contextual ASR via COntrastive entity disambiguation\n(PARCO), which integrates phoneme-aware encoding, contrastive entity\ndisambiguation, entity-level supervision, and hierarchical entity filtering.\nThese components enhance phonetic discrimination, ensure complete entity\nretrieval, and reduce false positives under uncertainty. Experiments show that\nPARCO achieves CER of 4.22% on Chinese AISHELL-1 and WER of 11.14% on English\nDATA2 under 1,000 distractors, significantly outperforming baselines. PARCO\nalso demonstrates robust gains on out-of-domain datasets like THCHS-30 and\nLibriSpeech."}
{"id": "2509.04373", "pdf": "https://arxiv.org/pdf/2509.04373.pdf", "abs": "https://arxiv.org/abs/2509.04373", "title": "Measuring Bias or Measuring the Task: Understanding the Brittle Nature of LLM Gender Biases", "authors": ["Bufan Gao", "Elisa Kreiss"], "categories": ["cs.CL"], "comment": null, "summary": "As LLMs are increasingly applied in socially impactful settings, concerns\nabout gender bias have prompted growing efforts both to measure and mitigate\nsuch bias. These efforts often rely on evaluation tasks that differ from\nnatural language distributions, as they typically involve carefully constructed\ntask prompts that overtly or covertly signal the presence of gender\nbias-related content. In this paper, we examine how signaling the evaluative\npurpose of a task impacts measured gender bias in LLMs. Concretely, we test\nmodels under prompt conditions that (1) make the testing context salient, and\n(2) make gender-focused content salient. We then assess prompt sensitivity\nacross four task formats with both token-probability and discrete-choice\nmetrics. We find that even minor prompt changes can substantially alter bias\noutcomes, sometimes reversing their direction entirely. Discrete-choice metrics\nfurther tend to amplify bias relative to probabilistic measures. These findings\ndo not only highlight the brittleness of LLM gender bias evaluations but open a\nnew puzzle for the NLP benchmarking and development community: To what extent\ncan well-controlled testing designs trigger LLM ``testing mode'' performance,\nand what does this mean for the ecological validity of future benchmarks."}
{"id": "2509.04432", "pdf": "https://arxiv.org/pdf/2509.04432.pdf", "abs": "https://arxiv.org/abs/2509.04432", "title": "Can Language Models Handle a Non-Gregorian Calendar?", "authors": ["Mutsumi Sasaki", "Go Kamoda", "Ryosuke Takahashi", "Kosuke Sato", "Kentaro Inui", "Keisuke Sakaguchi", "Benjamin Heinzerling"], "categories": ["cs.CL"], "comment": null, "summary": "Temporal reasoning and knowledge are essential capabilities for language\nmodels (LMs). While much prior work has analyzed and improved temporal\nreasoning in LMs, most studies have focused solely on the Gregorian calendar.\nHowever, many non-Gregorian systems, such as the Japanese, Hijri, and Hebrew\ncalendars, are in active use and reflect culturally grounded conceptions of\ntime. If and how well current LMs can accurately handle such non-Gregorian\ncalendars has not been evaluated so far. Here, we present a systematic\nevaluation of how well open-source LMs handle one such non-Gregorian system:\nthe Japanese calendar. For our evaluation, we create datasets for four tasks\nthat require both temporal knowledge and temporal reasoning. Evaluating a range\nof English-centric and Japanese-centric LMs, we find that some models can\nperform calendar conversions, but even Japanese-centric models struggle with\nJapanese-calendar arithmetic and with maintaining consistency across calendars.\nOur results highlight the importance of developing LMs that are better equipped\nfor culture-specific calendar understanding."}
{"id": "2509.03636", "pdf": "https://arxiv.org/pdf/2509.03636.pdf", "abs": "https://arxiv.org/abs/2509.03636", "title": "CausalARC: Abstract Reasoning with Causal World Models", "authors": ["Jacqueline Maasch", "John Kalantari", "Kia Khezeli"], "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "Reasoning requires adaptation to novel problem settings under limited data\nand distribution shift. This work introduces CausalARC: an experimental testbed\nfor AI reasoning in low-data and out-of-distribution regimes, modeled after the\nAbstraction and Reasoning Corpus (ARC). Each CausalARC reasoning task is\nsampled from a fully specified causal world model, formally expressed as a\nstructural causal model. Principled data augmentations provide observational,\ninterventional, and counterfactual feedback about the world model in the form\nof few-shot, in-context learning demonstrations. As a proof-of-concept, we\nillustrate the use of CausalARC for four language model evaluation settings:\n(1) abstract reasoning with test-time training, (2) counterfactual reasoning\nwith in-context learning, (3) program synthesis, and (4) causal discovery with\nlogical reasoning."}
{"id": "2509.03644", "pdf": "https://arxiv.org/pdf/2509.03644.pdf", "abs": "https://arxiv.org/abs/2509.03644", "title": "Towards a Neurosymbolic Reasoning System Grounded in Schematic Representations", "authors": ["François Olivier", "Zied Bouraoui"], "categories": ["cs.AI", "cs.CL"], "comment": "To appear in Proceedings of Machine Learning Research, 19th\n  Conference on Neurosymbolic Learning and Reasoning, 2025", "summary": "Despite significant progress in natural language understanding, Large\nLanguage Models (LLMs) remain error-prone when performing logical reasoning,\noften lacking the robust mental representations that enable human-like\ncomprehension. We introduce a prototype neurosymbolic system, Embodied-LM, that\ngrounds understanding and logical reasoning in schematic representations based\non image schemas-recurring patterns derived from sensorimotor experience that\nstructure human cognition. Our system operationalizes the spatial foundations\nof these cognitive structures using declarative spatial reasoning within Answer\nSet Programming. Through evaluation on logical deduction problems, we\ndemonstrate that LLMs can be guided to interpret scenarios through embodied\ncognitive structures, that these structures can be formalized as executable\nprograms, and that the resulting representations support effective logical\nreasoning with enhanced interpretability. While our current implementation\nfocuses on spatial primitives, it establishes the computational foundation for\nincorporating more complex and dynamic representations."}
{"id": "2509.03646", "pdf": "https://arxiv.org/pdf/2509.03646.pdf", "abs": "https://arxiv.org/abs/2509.03646", "title": "Emergent Hierarchical Reasoning in LLMs through Reinforcement Learning", "authors": ["Haozhe Wang", "Qixin Xu", "Che Liu", "Junhong Wu", "Fangzhen Lin", "Wenhu Chen"], "categories": ["cs.AI", "cs.CL"], "comment": "Preprint", "summary": "Reinforcement Learning (RL) has proven highly effective at enhancing the\ncomplex reasoning abilities of Large Language Models (LLMs), yet underlying\nmechanisms driving this success remain largely opaque. Our analysis reveals\nthat puzzling phenomena like ``aha moments\", ``length-scaling'' and entropy\ndynamics are not disparate occurrences but hallmarks of an emergent reasoning\nhierarchy, akin to the separation of high-level strategic planning from\nlow-level procedural execution in human cognition. We uncover a compelling\ntwo-phase dynamic: initially, a model is constrained by procedural correctness\nand must improve its low-level skills. The learning bottleneck then decisively\nshifts, with performance gains being driven by the exploration and mastery of\nhigh-level strategic planning. This insight exposes a core inefficiency in\nprevailing RL algorithms like GRPO, which apply optimization pressure\nagnostically and dilute the learning signal across all tokens. To address this,\nwe propose HIerarchy-Aware Credit Assignment (HICRA), an algorithm that\nconcentrates optimization efforts on high-impact planning tokens. HICRA\nsignificantly outperforms strong baselines, demonstrating that focusing on this\nstrategic bottleneck is key to unlocking advanced reasoning. Furthermore, we\nvalidate semantic entropy as a superior compass for measuring strategic\nexploration over misleading metrics such as token-level entropy."}
{"id": "2509.03730", "pdf": "https://arxiv.org/pdf/2509.03730.pdf", "abs": "https://arxiv.org/abs/2509.03730", "title": "The Personality Illusion: Revealing Dissociation Between Self-Reports & Behavior in LLMs", "authors": ["Pengrui Han", "Rafal Kocielnik", "Peiyang Song", "Ramit Debnath", "Dean Mobbs", "Anima Anandkumar", "R. Michael Alvarez"], "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.LG", "stat.ML"], "comment": "We make public all code and source data at\n  https://github.com/psychology-of-AI/Personality-Illusion", "summary": "Personality traits have long been studied as predictors of human\nbehavior.Recent advances in Large Language Models (LLMs) suggest similar\npatterns may emerge in artificial systems, with advanced LLMs displaying\nconsistent behavioral tendencies resembling human traits like agreeableness and\nself-regulation. Understanding these patterns is crucial, yet prior work\nprimarily relied on simplified self-reports and heuristic prompting, with\nlittle behavioral validation. In this study, we systematically characterize LLM\npersonality across three dimensions: (1) the dynamic emergence and evolution of\ntrait profiles throughout training stages; (2) the predictive validity of\nself-reported traits in behavioral tasks; and (3) the impact of targeted\ninterventions, such as persona injection, on both self-reports and behavior.\nOur findings reveal that instructional alignment (e.g., RLHF, instruction\ntuning) significantly stabilizes trait expression and strengthens trait\ncorrelations in ways that mirror human data. However, these self-reported\ntraits do not reliably predict behavior, and observed associations often\ndiverge from human patterns. While persona injection successfully steers\nself-reports in the intended direction, it exerts little or inconsistent effect\non actual behavior. By distinguishing surface-level trait expression from\nbehavioral consistency, our findings challenge assumptions about LLM\npersonality and underscore the need for deeper evaluation in alignment and\ninterpretability."}
{"id": "2509.03740", "pdf": "https://arxiv.org/pdf/2509.03740.pdf", "abs": "https://arxiv.org/abs/2509.03740", "title": "Singular Value Few-shot Adaptation of Vision-Language Models", "authors": ["Taha Koleilat", "Hassan Rivaz", "Yiming Xiao"], "categories": ["cs.CV", "cs.CL"], "comment": "10 pages, 2 figures, 8 tables", "summary": "Vision-language models (VLMs) like CLIP have shown impressive zero-shot and\nfew-shot learning capabilities across diverse applications. However, adapting\nthese models to new fine-grained domains remains difficult due to reliance on\nprompt engineering and the high cost of full model fine-tuning. Existing\nadaptation approaches rely on augmented components, such as prompt tokens and\nadapter modules, which could limit adaptation quality, destabilize the model,\nand compromise the rich knowledge learned during pretraining. In this work, we\npresent \\textbf{CLIP-SVD}, a novel \\textit{multi-modal} and\n\\textit{parameter-efficient} adaptation technique that leverages Singular Value\nDecomposition (SVD) to modify the internal parameter space of CLIP without\ninjecting additional modules. Specifically, we fine-tune only the singular\nvalues of the CLIP parameter matrices to rescale the basis vectors for domain\nadaptation while retaining the pretrained model. This design enables enhanced\nadaptation performance using only \\textbf{0.04\\%} of the model's total\nparameters and better preservation of its generalization ability. CLIP-SVD\nachieves state-of-the-art classification results on 11 natural and 10\nbiomedical datasets, outperforming previous methods in both accuracy and\ngeneralization under few-shot settings. Additionally, we leverage a natural\nlanguage-based approach to analyze the effectiveness and dynamics of the CLIP\nadaptation to allow interpretability of CLIP-SVD. The code is publicly\navailable at https://github.com/HealthX-Lab/CLIP-SVD."}
{"id": "2509.03787", "pdf": "https://arxiv.org/pdf/2509.03787.pdf", "abs": "https://arxiv.org/abs/2509.03787", "title": "Evaluating the Robustness of Retrieval-Augmented Generation to Adversarial Evidence in the Health Domain", "authors": ["Shakiba Amirshahi", "Amin Bigdeli", "Charles L. A. Clarke", "Amira Ghenai"], "categories": ["cs.IR", "cs.CL"], "comment": null, "summary": "Retrieval augmented generation (RAG) systems provide a method for factually\ngrounding the responses of a Large Language Model (LLM) by providing retrieved\nevidence, or context, as support. Guided by this context, RAG systems can\nreduce hallucinations and expand the ability of LLMs to accurately answer\nquestions outside the scope of their training data. Unfortunately, this design\nintroduces a critical vulnerability: LLMs may absorb and reproduce\nmisinformation present in retrieved evidence. This problem is magnified if\nretrieved evidence contains adversarial material explicitly intended to\npromulgate misinformation. This paper presents a systematic evaluation of RAG\nrobustness in the health domain and examines alignment between model outputs\nand ground-truth answers. We focus on the health domain due to the potential\nfor harm caused by incorrect responses, as well as the availability of\nevidence-based ground truth for many common health-related questions. We\nconduct controlled experiments using common health questions, varying both the\ntype and composition of the retrieved documents (helpful, harmful, and\nadversarial) as well as the framing of the question by the user (consistent,\nneutral, and inconsistent). Our findings reveal that adversarial documents\nsubstantially degrade alignment, but robustness can be preserved when helpful\nevidence is also present in the retrieval pool. These findings offer actionable\ninsights for designing safer RAG systems in high-stakes domains by highlighting\nthe need for retrieval safeguards. To enable reproducibility and facilitate\nfuture research, all experimental results are publicly available in our github\nrepository.\n  https://github.com/shakibaam/RAG_ROBUSTNESS_EVAL"}
{"id": "2509.03897", "pdf": "https://arxiv.org/pdf/2509.03897.pdf", "abs": "https://arxiv.org/abs/2509.03897", "title": "SPECS: Specificity-Enhanced CLIP-Score for Long Image Caption Evaluation", "authors": ["Xiaofu Chen", "Israfel Salazar", "Yova Kementchedjhieva"], "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "As interest grows in generating long, detailed image captions, standard\nevaluation metrics become increasingly unreliable. N-gram-based metrics though\nefficient, fail to capture semantic correctness. Representational Similarity\n(RS) metrics, designed to address this, initially saw limited use due to high\ncomputational costs, while today, despite advances in hardware, they remain\nunpopular due to low correlation to human judgments. Meanwhile, metrics based\non large language models (LLMs) show strong correlation with human judgments,\nbut remain too expensive for iterative use during model development.\n  We introduce SPECS (Specificity-Enhanced CLIPScore), a reference-free RS\nmetric tailored to long image captioning. SPECS modifies CLIP with a new\nobjective that emphasizes specificity: rewarding correct details and penalizing\nincorrect ones. We show that SPECS matches the performance of open-source\nLLM-based metrics in correlation to human judgments, while being far more\nefficient. This makes it a practical alternative for iterative checkpoint\nevaluation during image captioning model development.Our code can be found at\nhttps://github.com/mbzuai-nlp/SPECS."}
{"id": "2509.03986", "pdf": "https://arxiv.org/pdf/2509.03986.pdf", "abs": "https://arxiv.org/abs/2509.03986", "title": "Promptception: How Sensitive Are Large Multimodal Models to Prompts?", "authors": ["Mohamed Insaf Ismithdeen", "Muhammad Uzair Khattak", "Salman Khan"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "comment": "Accepted to EMNLP 2025", "summary": "Despite the success of Large Multimodal Models (LMMs) in recent years, prompt\ndesign for LMMs in Multiple-Choice Question Answering (MCQA) remains poorly\nunderstood. We show that even minor variations in prompt phrasing and structure\ncan lead to accuracy deviations of up to 15% for certain prompts and models.\nThis variability poses a challenge for transparent and fair LMM evaluation, as\nmodels often report their best-case performance using carefully selected\nprompts. To address this, we introduce Promptception, a systematic framework\nfor evaluating prompt sensitivity in LMMs. It consists of 61 prompt types,\nspanning 15 categories and 6 supercategories, each targeting specific aspects\nof prompt formulation, and is used to evaluate 10 LMMs ranging from lightweight\nopen-source models to GPT-4o and Gemini 1.5 Pro, across 3 MCQA benchmarks:\nMMStar, MMMU-Pro, MVBench. Our findings reveal that proprietary models exhibit\ngreater sensitivity to prompt phrasing, reflecting tighter alignment with\ninstruction semantics, while open-source models are steadier but struggle with\nnuanced and complex phrasing. Based on this analysis, we propose Prompting\nPrinciples tailored to proprietary and open-source LMMs, enabling more robust\nand fair model evaluation."}
{"id": "2509.04011", "pdf": "https://arxiv.org/pdf/2509.04011.pdf", "abs": "https://arxiv.org/abs/2509.04011", "title": "NER Retriever: Zero-Shot Named Entity Retrieval with Type-Aware Embeddings", "authors": ["Or Shachar", "Uri Katz", "Yoav Goldberg", "Oren Glickman"], "categories": ["cs.IR", "cs.AI", "cs.CL"], "comment": "Findings of EMNLP 2025", "summary": "We present NER Retriever, a zero-shot retrieval framework for ad-hoc Named\nEntity Retrieval, a variant of Named Entity Recognition (NER), where the types\nof interest are not provided in advance, and a user-defined type description is\nused to retrieve documents mentioning entities of that type. Instead of relying\non fixed schemas or fine-tuned models, our method builds on internal\nrepresentations of large language models (LLMs) to embed both entity mentions\nand user-provided open-ended type descriptions into a shared semantic space. We\nshow that internal representations, specifically the value vectors from\nmid-layer transformer blocks, encode fine-grained type information more\neffectively than commonly used top-layer embeddings. To refine these\nrepresentations, we train a lightweight contrastive projection network that\naligns type-compatible entities while separating unrelated types. The resulting\nentity embeddings are compact, type-aware, and well-suited for nearest-neighbor\nsearch. Evaluated on three benchmarks, NER Retriever significantly outperforms\nboth lexical and dense sentence-level retrieval baselines. Our findings provide\nempirical support for representation selection within LLMs and demonstrate a\npractical solution for scalable, schema-free entity retrieval. The NER\nRetriever Codebase is publicly available at\nhttps://github.com/ShacharOr100/ner_retriever"}
{"id": "2509.04027", "pdf": "https://arxiv.org/pdf/2509.04027.pdf", "abs": "https://arxiv.org/abs/2509.04027", "title": "CoT-Space: A Theoretical Framework for Internal Slow-Thinking via Reinforcement Learning", "authors": ["Zeyu Gan", "Hao Yi", "Yong Liu"], "categories": ["cs.AI", "cs.CL"], "comment": "Preprint Edition", "summary": "Reinforcement Learning (RL) has become a pivotal approach for enhancing the\nreasoning capabilities of Large Language Models (LLMs). However, a significant\ntheoretical gap persists, as traditional token-level RL frameworks fail to\nalign with the reasoning-level nature of complex, multi-step thought processes\nlike Chain-of-Thought (CoT). To address this challenge, we introduce CoT-Space,\na novel theoretical framework that recasts LLM reasoning from a discrete\ntoken-prediction task to an optimization process within a continuous,\nreasoning-level semantic space. By analyzing this process from both a noise\nperspective and a risk perspective, we demonstrate that the convergence to an\noptimal CoT length is a natural consequence of the fundamental trade-off\nbetween underfitting and overfitting. Furthermore, extensive experiments\nprovide strong empirical validation for our theoretical findings. Our framework\nnot only provides a coherent explanation for empirical phenomena such as\noverthinking but also offers a solid theoretical foundation to guide the future\ndevelopment of more effective and generalizable reasoning agents."}
{"id": "2509.04072", "pdf": "https://arxiv.org/pdf/2509.04072.pdf", "abs": "https://arxiv.org/abs/2509.04072", "title": "LibriQuote: A Speech Dataset of Fictional Character Utterances for Expressive Zero-Shot Speech Synthesis", "authors": ["Gaspard Michel", "Elena V. Epure", "Christophe Cerisara"], "categories": ["eess.AS", "cs.CL", "cs.SD"], "comment": null, "summary": "Text-to-speech (TTS) systems have recently achieved more expressive and\nnatural speech synthesis by scaling to large speech datasets. However, the\nproportion of expressive speech in such large-scale corpora is often unclear.\nBesides, existing expressive speech corpora are typically smaller in scale and\nprimarily used for benchmarking TTS systems. In this paper, we introduce the\nLibriQuote dataset, an English corpus derived from read audiobooks, designed\nfor both fine-tuning and benchmarking expressive zero-shot TTS system. The\ntraining dataset includes 12.7K hours of read, non-expressive speech and 5.3K\nhours of mostly expressive speech drawn from character quotations. Each\nutterance in the expressive subset is supplemented with the context in which it\nwas written, along with pseudo-labels of speech verbs and adverbs used to\ndescribe the quotation (\\textit{e.g. ``he whispered softly''}). Additionally,\nwe provide a challenging 7.5 hour test set intended for benchmarking TTS\nsystems: given a neutral reference speech as input, we evaluate system's\nability to synthesize an expressive utterance while preserving reference\ntimbre. We validate qualitatively the test set by showing that it covers a wide\nrange of emotions compared to non-expressive speech, along with various\naccents. Extensive subjective and objective evaluations show that fine-tuning a\nbaseline TTS system on LibriQuote significantly improves its synthesized speech\nintelligibility, and that recent systems fail to synthesize speech as\nexpressive and natural as the ground-truth utterances. The dataset and\nevaluation code are freely available. Audio samples can be found at\nhttps://libriquote.github.io/."}
{"id": "2509.04159", "pdf": "https://arxiv.org/pdf/2509.04159.pdf", "abs": "https://arxiv.org/abs/2509.04159", "title": "Towards an Action-Centric Ontology for Cooking Procedures Using Temporal Graphs", "authors": ["Aarush Kumbhakern", "Saransh Kumar Gupta", "Lipika Dey", "Partha Pratim Das"], "categories": ["cs.AI", "cs.CL"], "comment": "6 pages, 3 figures, 1 table, 11 references, ACM International\n  Conference on Multimedia 2025 - Multi-modal Food Computing Workshop", "summary": "Formalizing cooking procedures remains a challenging task due to their\ninherent complexity and ambiguity. We introduce an extensible domain-specific\nlanguage for representing recipes as directed action graphs, capturing\nprocesses, transfers, environments, concurrency, and compositional structure.\nOur approach enables precise, modular modeling of complex culinary workflows.\nInitial manual evaluation on a full English breakfast recipe demonstrates the\nDSL's expressiveness and suitability for future automated recipe analysis and\nexecution. This work represents initial steps towards an action-centric\nontology for cooking, using temporal graphs to enable structured machine\nunderstanding, precise interpretation, and scalable automation of culinary\nprocesses - both in home kitchens and professional culinary settings."}
{"id": "2509.04166", "pdf": "https://arxiv.org/pdf/2509.04166.pdf", "abs": "https://arxiv.org/abs/2509.04166", "title": "Crossing the Species Divide: Transfer Learning from Speech to Animal Sounds", "authors": ["Jules Cauzinille", "Marius Miron", "Olivier Pietquin", "Masato Hagiwara", "Ricard Marxer", "Arnaud Rey", "Benoit Favre"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.SD", "68T07", "I.5.4; I.2.6; H.5.5"], "comment": "5 pages, 3 figures, uses dcase2025.sty, submitted to DCASE 2025", "summary": "Self-supervised speech models have demonstrated impressive performance in\nspeech processing, but their effectiveness on non-speech data remains\nunderexplored. We study the transfer learning capabilities of such models on\nbioacoustic detection and classification tasks. We show that models such as\nHuBERT, WavLM, and XEUS can generate rich latent representations of animal\nsounds across taxa. We analyze the models properties with linear probing on\ntime-averaged representations. We then extend the approach to account for the\neffect of time-wise information with other downstream architectures. Finally,\nwe study the implication of frequency range and noise on performance. Notably,\nour results are competitive with fine-tuned bioacoustic pre-trained models and\nshow the impact of noise-robust pre-training setups. These findings highlight\nthe potential of speech-based self-supervised learning as an efficient\nframework for advancing bioacoustic research."}
{"id": "2509.04343", "pdf": "https://arxiv.org/pdf/2509.04343.pdf", "abs": "https://arxiv.org/abs/2509.04343", "title": "Psychologically Enhanced AI Agents", "authors": ["Maciej Besta", "Shriram Chandran", "Robert Gerstenberger", "Mathis Lindner", "Marcin Chrapek", "Sebastian Hermann Martschat", "Taraneh Ghandi", "Patrick Iff", "Hubert Niewiadomski", "Piotr Nyczyk", "Jürgen Müller", "Torsten Hoefler"], "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.HC", "cs.MA"], "comment": null, "summary": "We introduce MBTI-in-Thoughts, a framework for enhancing the effectiveness of\nLarge Language Model (LLM) agents through psychologically grounded personality\nconditioning. Drawing on the Myers-Briggs Type Indicator (MBTI), our method\nprimes agents with distinct personality archetypes via prompt engineering,\nenabling control over behavior along two foundational axes of human psychology,\ncognition and affect. We show that such personality priming yields consistent,\ninterpretable behavioral biases across diverse tasks: emotionally expressive\nagents excel in narrative generation, while analytically primed agents adopt\nmore stable strategies in game-theoretic settings. Our framework supports\nexperimenting with structured multi-agent communication protocols and reveals\nthat self-reflection prior to interaction improves cooperation and reasoning\nquality. To ensure trait persistence, we integrate the official 16Personalities\ntest for automated verification. While our focus is on MBTI, we show that our\napproach generalizes seamlessly to other psychological frameworks such as Big\nFive, HEXACO, or Enneagram. By bridging psychological theory and LLM behavior\ndesign, we establish a foundation for psychologically enhanced AI agents\nwithout any fine-tuning."}
{"id": "2509.04393", "pdf": "https://arxiv.org/pdf/2509.04393.pdf", "abs": "https://arxiv.org/abs/2509.04393", "title": "Contextualized Token Discrimination for Speech Search Query Correction", "authors": ["Junyu Lu", "Di Jiang", "Mengze Hong", "Victor Junqiu Wei", "Qintian Guo", "Zhiyang Su"], "categories": ["cs.SD", "cs.CL"], "comment": null, "summary": "Query spelling correction is an important function of modern search engines\nsince it effectively helps users express their intentions clearly. With the\ngrowing popularity of speech search driven by Automated Speech Recognition\n(ASR) systems, this paper introduces a novel method named Contextualized Token\nDiscrimination (CTD) to conduct effective speech query correction. In CTD, we\nfirst employ BERT to generate token-level contextualized representations and\nthen construct a composition layer to enhance semantic information. Finally, we\nproduce the correct query according to the aggregated token representation,\ncorrecting the incorrect tokens by comparing the original token representations\nand the contextualized representations. Extensive experiments demonstrate the\nsuperior performance of our proposed method across all metrics, and we further\npresent a new benchmark dataset with erroneous ASR transcriptions to offer\ncomprehensive evaluations for audio query correction."}
{"id": "2509.04403", "pdf": "https://arxiv.org/pdf/2509.04403.pdf", "abs": "https://arxiv.org/abs/2509.04403", "title": "Self-adaptive Dataset Construction for Real-World Multimodal Safety Scenarios", "authors": ["Jingen Qu", "Lijun Li", "Bo Zhang", "Yichen Yan", "Jing Shao"], "categories": ["cs.CV", "cs.CL", "cs.CR"], "comment": "Accepted at EMNLP 2025 Findings", "summary": "Multimodal large language models (MLLMs) are rapidly evolving, presenting\nincreasingly complex safety challenges. However, current dataset construction\nmethods, which are risk-oriented, fail to cover the growing complexity of\nreal-world multimodal safety scenarios (RMS). And due to the lack of a unified\nevaluation metric, their overall effectiveness remains unproven. This paper\nintroduces a novel image-oriented self-adaptive dataset construction method for\nRMS, which starts with images and end constructing paired text and guidance\nresponses. Using the image-oriented method, we automatically generate an RMS\ndataset comprising 35k image-text pairs with guidance responses. Additionally,\nwe introduce a standardized safety dataset evaluation metric: fine-tuning a\nsafety judge model and evaluating its capabilities on other safety\ndatasets.Extensive experiments on various tasks demonstrate the effectiveness\nof the proposed image-oriented pipeline. The results confirm the scalability\nand effectiveness of the image-oriented approach, offering a new perspective\nfor the construction of real-world multimodal safety datasets."}
{"id": "2509.04404", "pdf": "https://arxiv.org/pdf/2509.04404.pdf", "abs": "https://arxiv.org/abs/2509.04404", "title": "No Thoughts Just AI: Biased LLM Recommendations Limit Human Agency in Resume Screening", "authors": ["Kyra Wilson", "Mattea Sim", "Anna-Maria Gueorguieva", "Aylin Caliskan"], "categories": ["cs.CY", "cs.AI", "cs.CL", "cs.HC", "K.4.2"], "comment": "Published in Proceedings of the 2025 AAAI/ACM Conference on AI,\n  Ethics, and Society; code available at\n  https://github.com/kyrawilson/No-Thoughts-Just-AI", "summary": "In this study, we conduct a resume-screening experiment (N=528) where people\ncollaborate with simulated AI models exhibiting race-based preferences (bias)\nto evaluate candidates for 16 high and low status occupations. Simulated AI\nbias approximates factual and counterfactual estimates of racial bias in\nreal-world AI systems. We investigate people's preferences for White, Black,\nHispanic, and Asian candidates (represented through names and affinity groups\non quality-controlled resumes) across 1,526 scenarios and measure their\nunconscious associations between race and status using implicit association\ntests (IATs), which predict discriminatory hiring decisions but have not been\ninvestigated in human-AI collaboration. When making decisions without AI or\nwith AI that exhibits no race-based preferences, people select all candidates\nat equal rates. However, when interacting with AI favoring a particular group,\npeople also favor those candidates up to 90% of the time, indicating a\nsignificant behavioral shift. The likelihood of selecting candidates whose\nidentities do not align with common race-status stereotypes can increase by 13%\nif people complete an IAT before conducting resume screening. Finally, even if\npeople think AI recommendations are low quality or not important, their\ndecisions are still vulnerable to AI bias under certain circumstances. This\nwork has implications for people's autonomy in AI-HITL scenarios, AI and work,\ndesign and evaluation of AI hiring systems, and strategies for mitigating bias\nin collaborative decision-making tasks. In particular, organizational and\nregulatory policy should acknowledge the complex nature of AI-HITL decision\nmaking when implementing these systems, educating people who use them, and\ndetermining which are subject to oversight."}
{"id": "2509.04419", "pdf": "https://arxiv.org/pdf/2509.04419.pdf", "abs": "https://arxiv.org/abs/2509.04419", "title": "Towards a Unified View of Large Language Model Post-Training", "authors": ["Xingtai Lv", "Yuxin Zuo", "Youbang Sun", "Hongyi Liu", "Yuntian Wei", "Zhekai Chen", "Lixuan He", "Xuekai Zhu", "Kaiyan Zhang", "Bingning Wang", "Ning Ding", "Bowen Zhou"], "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "Two major sources of training data exist for post-training modern language\nmodels: online (model-generated rollouts) data, and offline (human or\nother-model demonstrations) data. These two types of data are typically used by\napproaches like Reinforcement Learning (RL) and Supervised Fine-Tuning (SFT),\nrespectively. In this paper, we show that these approaches are not in\ncontradiction, but are instances of a single optimization process. We derive a\nUnified Policy Gradient Estimator, and present the calculations of a wide\nspectrum of post-training approaches as the gradient of a common objective\nunder different data distribution assumptions and various bias-variance\ntradeoffs. The gradient estimator is constructed with four interchangeable\nparts: stabilization mask, reference policy denominator, advantage estimate,\nand likelihood gradient. Motivated by our theoretical findings, we propose\nHybrid Post-Training (HPT), an algorithm that dynamically selects different\ntraining signals. HPT is designed to yield both effective exploitation of\ndemonstration and stable exploration without sacrificing learned reasoning\npatterns. We provide extensive experiments and ablation studies to verify the\neffectiveness of our unified theoretical framework and HPT. Across six\nmathematical reasoning benchmarks and two out-of-distribution suites, HPT\nconsistently surpasses strong baselines across models of varying scales and\nfamilies."}
{"id": "2509.04438", "pdf": "https://arxiv.org/pdf/2509.04438.pdf", "abs": "https://arxiv.org/abs/2509.04438", "title": "The Telephone Game: Evaluating Semantic Drift in Unified Models", "authors": ["Sabbir Mollah", "Rohit Gupta", "Sirnam Swetha", "Qingyang Liu", "Ahnaf Munir", "Mubarak Shah"], "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Employing a single, unified model (UM) for both visual understanding\n(image-to-text: I2T) and and visual generation (text-to-image: T2I) has opened\na new direction in Visual Language Model (VLM) research. While UMs can also\nsupport broader unimodal tasks (e.g., text-to-text, image-to-image), we focus\non the core cross-modal pair T2I and I2T, as consistency between understanding\nand generation is critical for downstream use. Existing evaluations consider\nthese capabilities in isolation: FID and GenEval for T2I, and benchmarks such\nas MME, MMBench for I2T. These single-pass metrics do not reveal whether a\nmodel that understands a concept can also render it, nor whether meaning is\npreserved when cycling between image and text modalities. To address this, we\nintroduce the Unified Consistency Framework for Unified Models (UCF-UM), a\ncyclic evaluation protocol that alternates I2T and T2I over multiple\ngenerations to quantify semantic drift. UCF formulates 3 metrics: (i) Mean\nCumulative Drift (MCD), an embedding-based measure of overall semantic loss;\n(ii) Semantic Drift Rate (SDR), that summarizes semantic decay rate; and (iii)\nMulti-Generation GenEval (MGG), an object-level compliance score extending\nGenEval. To assess generalization beyond COCO, which is widely used in\ntraining; we create a new benchmark ND400, sampled from NoCaps and DOCCI and\nevaluate on seven recent models. UCF-UM reveals substantial variation in\ncross-modal stability: some models like BAGEL maintain semantics over many\nalternations, whereas others like Vila-u drift quickly despite strong\nsingle-pass scores. Our results highlight cyclic consistency as a necessary\ncomplement to standard I2T and T2I evaluations, and provide practical metrics\nto consistently assess unified model's cross-modal stability and strength of\ntheir shared representations. Code:\nhttps://github.com/mollahsabbir/Semantic-Drift-in-Unified-Models"}
{"id": "2509.04439", "pdf": "https://arxiv.org/pdf/2509.04439.pdf", "abs": "https://arxiv.org/abs/2509.04439", "title": "ArcMemo: Abstract Reasoning Composition with Lifelong LLM Memory", "authors": ["Matthew Ho", "Chen Si", "Zhaoxiang Feng", "Fangxu Yu", "Zhijian Liu", "Zhiting Hu", "Lianhui Qin"], "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "While inference-time scaling enables LLMs to carry out increasingly long and\ncapable reasoning traces, the patterns and insights uncovered during these\ntraces are immediately discarded once the context window is reset for a new\nquery. External memory is a natural way to persist these discoveries, and\nrecent work has shown clear benefits for reasoning-intensive tasks. We see an\nopportunity to make such memories more broadly reusable and scalable by moving\nbeyond instance-based memory entries (e.g. exact query/response pairs, or\nsummaries tightly coupled with the original problem context) toward\nconcept-level memory: reusable, modular abstractions distilled from solution\ntraces and stored in natural language. For future queries, relevant concepts\nare selectively retrieved and integrated into the prompt, enabling test-time\ncontinual learning without weight updates. Our design introduces new strategies\nfor abstracting takeaways from rollouts and retrieving entries for new queries,\npromoting reuse and allowing memory to expand with additional experiences. On\nthe challenging ARC-AGI benchmark, our method yields a 7.5% relative gain over\na strong no-memory baseline with performance continuing to scale with inference\ncompute. We find abstract concepts to be the most consistent memory design,\noutscoring the baseline at all tested inference compute scales. Moreover, we\nconfirm that dynamically updating memory during test-time outperforms an\notherwise identical fixed memory setting with additional attempts, supporting\nthe hypothesis that solving more problems and abstracting more patterns to\nmemory enables further solutions in a form of self-improvement. Code available\nat https://github.com/matt-seb-ho/arc_memo."}
{"id": "2509.04442", "pdf": "https://arxiv.org/pdf/2509.04442.pdf", "abs": "https://arxiv.org/abs/2509.04442", "title": "Delta Activations: A Representation for Finetuned Large Language Models", "authors": ["Zhiqiu Xu", "Amish Sethi", "Mayur Naik", "Ser-Nam Lim"], "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.IR"], "comment": null, "summary": "The success of powerful open source Large Language Models (LLMs) has enabled\nthe community to create a vast collection of post-trained models adapted to\nspecific tasks and domains. However, navigating and understanding these models\nremains challenging due to inconsistent metadata and unstructured repositories.\nWe introduce Delta Activations, a method to represent finetuned models as\nvector embeddings by measuring shifts in their internal activations relative to\na base model. This representation allows for effective clustering by domain and\ntask, revealing structure in the model landscape. Delta Activations also\ndemonstrate desirable properties: it is robust across finetuning settings and\nexhibits an additive property when finetuning datasets are mixed. In addition,\nwe show that Delta Activations can embed tasks via few-shot finetuning, and\nfurther explore its use for model selection and merging. We hope Delta\nActivations can facilitate the practice of reusing publicly available models.\nCode is available at https://github.com/OscarXZQ/delta_activations."}
{"id": "2109.02325", "pdf": "https://arxiv.org/pdf/2109.02325.pdf", "abs": "https://arxiv.org/abs/2109.02325", "title": "MyProfessors: Mining Turkish Student Reviews", "authors": ["Ibrahim Faruk Ceylan", "Necmettin Bera Calik"], "categories": ["cs.CL"], "comment": "The paper is withdrawn due to the scraping errors in the dataset\n  collection process and affected results", "summary": "We introduce Hocalarim (MyProfessors), the largest student review dataset\navailable for the Turkish language. It consists of over 5000 professor reviews\nleft online by students, with different aspects of education rated on a scale\nof 1 to 5 stars. We investigate the properties of the dataset and present its\nstatistics. We examine the impact of students' institution type on their\nratings and the correlation of students' bias to give positive or negative\nfeedback."}
{"id": "2305.06166", "pdf": "https://arxiv.org/pdf/2305.06166.pdf", "abs": "https://arxiv.org/abs/2305.06166", "title": "Mitigating Bias in Text Classification via Prompt-Based Text Transformation", "authors": ["Charmaine Barker", "Dimitar Kazakov"], "categories": ["cs.CL"], "comment": "This version corrects an error in the model specification", "summary": "The presence of specific linguistic signals particular to a certain sub-group\ncan become highly salient to language models during training. In automated\ndecision-making settings, this may lead to biased outcomes when models rely on\ncues that correlate with protected characteristics. We investigate whether\nprompting ChatGPT to rewrite text using simplification, neutralisation,\nlocalisation, and formalisation can reduce demographic signals while preserving\nmeaning. Experimental results show a statistically significant drop in location\nclassification accuracy across multiple models after transformation, suggesting\nreduced reliance on group-specific language. At the same time, sentiment\nanalysis and rating prediction tasks confirm that the core meaning of the\nreviews remains greatly intact. These results suggest that prompt-based\nrewriting offers a practical and generalisable approach for mitigating bias in\ntext classification."}
{"id": "2306.03774", "pdf": "https://arxiv.org/pdf/2306.03774.pdf", "abs": "https://arxiv.org/abs/2306.03774", "title": "Exploring Linguistic Features for Turkish Text Readability", "authors": ["Ahmet Yavuz Uluslu", "Gerold Schneider"], "categories": ["cs.CL"], "comment": null, "summary": "This paper presents the first comprehensive study on automatic readability\nassessment of Turkish texts. We combine state-of-the-art neural network models\nwith linguistic features at lexical, morphological, syntactic and discourse\nlevels to develop an advanced readability tool. We evaluate the effectiveness\nof traditional readability formulas compared to modern automated methods and\nidentify key linguistic features that determine the readability of Turkish\ntexts."}
{"id": "2406.01359", "pdf": "https://arxiv.org/pdf/2406.01359.pdf", "abs": "https://arxiv.org/abs/2406.01359", "title": "R2C2-Coder: Enhancing and Benchmarking Real-world Repository-level Code Completion Abilities of Code Large Language Models", "authors": ["Ken Deng", "Jiaheng Liu", "He Zhu", "Congnan Liu", "Jingxin Li", "Jiakai Wang", "Peng Zhao", "Chenchen Zhang", "Yanan Wu", "Xueqiao Yin", "Yuanxing Zhang", "Zizheng Zhan", "Wenbo Su", "Bangyu Xiang", "Tiezheng Ge", "Bo Zheng"], "categories": ["cs.CL", "cs.SE"], "comment": null, "summary": "Code completion models have made significant progress in recent years.\nRecently, repository-level code completion has drawn more attention in modern\nsoftware development, and several baseline methods and benchmarks have been\nproposed. However, existing repository-level code completion methods often fall\nshort of fully using the extensive context of a project repository, such as the\nintricacies of relevant files and class hierarchies. Besides, the existing\nbenchmarks usually focus on limited code completion scenarios, which cannot\nreflect the repository-level code completion abilities well of existing\nmethods. To address these limitations, we propose the R2C2-Coder to enhance and\nbenchmark the real-world repository-level code completion abilities of code\nLarge Language Models, where the R2C2-Coder includes a code prompt construction\nmethod R2C2-Enhance and a well-designed benchmark R2C2-Bench. Specifically,\nfirst, in R2C2-Enhance, we first construct the candidate retrieval pool and\nthen assemble the completion prompt by retrieving from the retrieval pool for\neach completion cursor position. Second, based on R2C2 -Enhance, we can\nconstruct a more challenging and diverse R2C2-Bench with training, validation\nand test splits, where a context perturbation strategy is proposed to simulate\nthe real-world repository-level code completion well. Extensive results on\nmultiple benchmarks demonstrate the effectiveness of our R2C2-Coder."}
{"id": "2411.01747", "pdf": "https://arxiv.org/pdf/2411.01747.pdf", "abs": "https://arxiv.org/abs/2411.01747", "title": "DynaSaur: Large Language Agents Beyond Predefined Actions", "authors": ["Dang Nguyen", "Viet Dac Lai", "Seunghyun Yoon", "Ryan A. Rossi", "Handong Zhao", "Ruiyi Zhang", "Puneet Mathur", "Nedim Lipka", "Yu Wang", "Trung Bui", "Franck Dernoncourt", "Tianyi Zhou"], "categories": ["cs.CL"], "comment": "Published as a conference paper at COLM 2025", "summary": "Existing LLM agent systems typically select actions from a fixed and\npredefined set at every step. While this approach is effective in closed,\nnarrowly scoped environments, it presents two major challenges for real-world,\nopen-ended scenarios: (1) it significantly restricts the planning and acting\ncapabilities of LLM agents, and (2) it requires substantial human effort to\nenumerate and implement all possible actions, which is impractical in complex\nenvironments with a vast number of potential actions. To address these\nlimitations, we propose an LLM agent framework that can dynamically create and\ncompose actions as needed. In this framework, the agent interacts with its\nenvironment by generating and executing programs written in a general-purpose\nprogramming language. Moreover, generated actions are accumulated over time for\nfuture reuse. Our extensive experiments across multiple benchmarks show that\nthis framework significantly improves flexibility and outperforms prior methods\nthat rely on a fixed action set. Notably, it enables LLM agents to adapt and\nrecover in scenarios where predefined actions are insufficient or fail due to\nunforeseen edge cases. Our code can be found in\nhttps://github.com/adobe-research/dynasaur."}
{"id": "2411.12736", "pdf": "https://arxiv.org/pdf/2411.12736.pdf", "abs": "https://arxiv.org/abs/2411.12736", "title": "ACING: Actor-Critic for Instruction Learning in Black-Box LLMs", "authors": ["Salma Kharrat", "Fares Fourati", "Marco Canini"], "categories": ["cs.CL", "cs.AI", "cs.LG", "cs.SY", "eess.SY", "math.OC"], "comment": "Accepted at EMNLP 2025", "summary": "The effectiveness of Large Language Models (LLMs) in solving tasks depends\nsignificantly on the quality of their instructions, which often require\nsubstantial human effort to craft. This underscores the need for automated\ninstruction optimization. However, optimizing instructions is particularly\nchallenging when working with black-box LLMs, where model parameters and\ngradients are inaccessible. We introduce ACING, an actor-critic reinforcement\nlearning framework that formulates instruction optimization as a stateless,\ncontinuous-action problem, enabling exploration of infinite instruction spaces\nusing only black-box feedback. ACING automatically discovers prompts that\noutperform human-written prompts in 76% of instruction-induction tasks, with\ngains of up to 33 points and a 10-point median improvement over the best\nautomatic baseline in 33 tasks spanning instruction-induction, summarization,\nand chain-of-thought reasoning. Extensive ablations highlight its robustness\nand efficiency. An implementation of ACING is available at\nhttps://github.com/salmakh1/ACING."}
{"id": "2501.04316", "pdf": "https://arxiv.org/pdf/2501.04316.pdf", "abs": "https://arxiv.org/abs/2501.04316", "title": "Small Changes, Large Consequences: Analyzing the Allocational Fairness of LLMs in Hiring Contexts", "authors": ["Preethi Seshadri", "Hongyu Chen", "Sameer Singh", "Seraphina Goldfarb-Tarrant"], "categories": ["cs.CL"], "comment": null, "summary": "Large language models (LLMs) are increasingly being deployed in high-stakes\napplications like hiring, yet their potential for unfair decision-making\nremains understudied in generative and retrieval settings. In this work, we\nexamine the allocational fairness of LLM-based hiring systems through two tasks\nthat reflect actual HR usage: resume summarization and applicant ranking. By\nconstructing a synthetic resume dataset with controlled perturbations and\ncurating job postings, we investigate whether model behavior differs across\ndemographic groups. Our findings reveal that generated summaries exhibit\nmeaningful differences more frequently for race than for gender perturbations.\nModels also display non-uniform retrieval selection patterns across demographic\ngroups and exhibit high ranking sensitivity to both gender and race\nperturbations. Surprisingly, retrieval models can show comparable sensitivity\nto both demographic and non-demographic changes, suggesting that fairness\nissues may stem from broader model brittleness. Overall, our results indicate\nthat LLM-based hiring systems, especially in the retrieval stage, can exhibit\nnotable biases that lead to discriminatory outcomes in real-world contexts."}
{"id": "2501.11110", "pdf": "https://arxiv.org/pdf/2501.11110.pdf", "abs": "https://arxiv.org/abs/2501.11110", "title": "Chain-of-Reasoning: Towards Unified Mathematical Reasoning in Large Language Models via a Multi-Paradigm Perspective", "authors": ["Yiyao Yu", "Yuxiang Zhang", "Dongdong Zhang", "Xiao Liang", "Hengyuan Zhang", "Xingxing Zhang", "Ziyi Yang", "Mahmoud Khademi", "Hany Awadalla", "Junjie Wang", "Yujiu Yang", "Furu Wei"], "categories": ["cs.CL"], "comment": "Accepted to ACL 2025 (Main)", "summary": "Large Language Models (LLMs) have made notable progress in mathematical\nreasoning, yet often rely on single-paradigm reasoning, limiting their\neffectiveness across diverse tasks. We introduce Chain-of-Reasoning (CoR), a\nnovel unified framework integrating multiple reasoning paradigms--Natural\nLanguage Reasoning (NLR), Algorithmic Reasoning (AR), and Symbolic Reasoning\n(SR)--to enable synergistic collaboration. CoR generates multiple potential\nanswers via different reasoning paradigms and synthesizes them into a coherent\nfinal solution. We propose a Progressive Paradigm Training (PPT) strategy for\nmodels to progressively master these paradigms, leading to CoR-Math-7B.\nExperimental results demonstrate that CoR-Math-7B significantly outperforms\ncurrent SOTA models, achieving up to a 41.0% absolute improvement over GPT-4o\nin theorem proving and a 15.0% improvement over RL-based methods on the MATH\nbenchmark in arithmetic tasks. These results show the enhanced mathematical\ncomprehension ability of our model, enabling zero-shot generalization across\ntasks."}
{"id": "2501.13958", "pdf": "https://arxiv.org/pdf/2501.13958.pdf", "abs": "https://arxiv.org/abs/2501.13958", "title": "A Survey of Graph Retrieval-Augmented Generation for Customized Large Language Models", "authors": ["Qinggang Zhang", "Shengyuan Chen", "Yuanchen Bei", "Zheng Yuan", "Huachi Zhou", "Zijin Hong", "Hao Chen", "Yilin Xiao", "Chuang Zhou", "Yi Chang", "Xiao Huang"], "categories": ["cs.CL", "cs.AI", "cs.IR"], "comment": null, "summary": "Large language models (LLMs) have demonstrated remarkable capabilities in a\nwide range of tasks, yet their application to specialized domains remains\nchallenging due to the need for deep expertise. Retrieval-Augmented generation\n(RAG) has emerged as a promising solution to customize LLMs for professional\nfields by seamlessly integrating external knowledge bases, enabling real-time\naccess to domain-specific expertise during inference. Despite its potential,\ntraditional RAG systems, based on flat text retrieval, face three critical\nchallenges: (i) complex query understanding in professional contexts, (ii)\ndifficulties in knowledge integration across distributed sources, and (iii)\nsystem efficiency bottlenecks at scale. This survey presents a systematic\nanalysis of Graph-based Retrieval-Augmented Generation (GraphRAG), a new\nparadigm that revolutionizes domain-specific LLM applications. GraphRAG\naddresses traditional RAG limitations through three key innovations: (i)\ngraph-structured knowledge representation that explicitly captures entity\nrelationships and domain hierarchies, (ii) efficient graph-based retrieval\ntechniques that enable context-preserving knowledge retrieval with multihop\nreasoning ability, and (iii) structure-aware knowledge integration algorithms\nthat leverage retrieved knowledge for accurate and logical coherent generation\nof LLMs. In this survey, we systematically analyze the technical foundations of\nGraphRAG and examine current implementations across various professional\ndomains, identifying key technical challenges and promising research\ndirections. All the related resources of GraphRAG, including research papers,\nopen-source data, and projects, are collected for the community in\nhttps://github.com/DEEP-PolyU/Awesome-GraphRAG."}
{"id": "2501.14701", "pdf": "https://arxiv.org/pdf/2501.14701.pdf", "abs": "https://arxiv.org/abs/2501.14701", "title": "An Unsupervised Natural Language Processing Pipeline for Assessing Referral Appropriateness", "authors": ["Vittorio Torri", "Annamaria Bottelli", "Michele Ercolanoni", "Olivia Leoni", "Francesca Ieva"], "categories": ["cs.CL", "cs.LG", "68T50", "I.2.7; J.1; J.3"], "comment": "49 pages, 10 figures", "summary": "Objective: Assessing the appropriateness of diagnostic referrals is critical\nfor improving healthcare efficiency and reducing unnecessary procedures.\nHowever, this task becomes challenging when referral reasons are recorded only\nas free text rather than structured codes, like in the Italian NHS. To address\nthis gap, we propose a fully unsupervised Natural Language Processing (NLP)\npipeline capable of extracting and evaluating referral reasons without relying\non labelled datasets.\n  Methods: Our pipeline leverages Transformer-based embeddings pre-trained on\nItalian medical texts to cluster referral reasons and assess their alignment\nwith appropriateness guidelines. It operates in an unsupervised setting and is\ndesigned to generalize across different examination types. We analyzed two\ncomplete regional datasets from the Lombardy Region (Italy), covering all\nreferrals between 2019 and 2021 for venous echocolordoppler of the lower limbs\n(ECD;n=496,971; development) and flexible endoscope colonoscopy (FEC;\nn=407,949; testing only). For both, a random sample of 1,000 referrals was\nmanually annotated to measure performance.\n  Results: The pipeline achieved high performance in identifying referral\nreasons (Prec=92.43% (ECD), 93.59% (FEC); Rec=83.28% (ECD), 92.70% (FEC)) and\nappropriateness (Prec=93.58% (ECD), 94.66% (FEC); Rec=91.52% (ECD), 93.96%\n(FEC)). At the regional level, the analysis identified relevant inappropriate\nreferral groups and variation across contexts, findings that informed a new\nLombardy Region resolution to reinforce guideline adherence.\n  Conclusions: This study presents a robust, scalable, unsupervised NLP\npipeline for assessing referral appropriateness in large, real-world datasets.\nIt demonstrates how such data can be effectively leveraged, providing public\nhealth authorities with a deployable AI tool to monitor practices and support\nevidence-based policy."}
{"id": "2502.05982", "pdf": "https://arxiv.org/pdf/2502.05982.pdf", "abs": "https://arxiv.org/abs/2502.05982", "title": "HamRaz: A Culture-Based Persian Conversation Dataset for Person-Centered Therapy Using LLM Agents", "authors": ["Mohammad Amin Abbasi", "Farnaz Sadat Mirnezami", "Ali Neshati", "Hassan Naderi"], "categories": ["cs.CL"], "comment": null, "summary": "We present HamRaz, a culturally adapted Persian-language dataset for\nAI-assisted mental health support, grounded in Person-Centered Therapy (PCT).\nTo reflect real-world therapeutic challenges, we combine script-based dialogue\nwith adaptive large language models (LLM) role-playing, capturing the ambiguity\nand emotional nuance of Persian-speaking clients. We introduce HamRazEval, a\ndual-framework for assessing conversational and therapeutic quality using\nGeneral Metrics and specialized psychological relationship measures. Human\nevaluations show HamRaz outperforms existing baselines in empathy, coherence,\nand realism. This resource contributes to the Digital Humanities by bridging\nlanguage, culture, and mental health in underrepresented communities."}
{"id": "2502.11948", "pdf": "https://arxiv.org/pdf/2502.11948.pdf", "abs": "https://arxiv.org/abs/2502.11948", "title": "HalluEntity: Benchmarking and Understanding Entity-Level Hallucination Detection", "authors": ["Min-Hsuan Yeh", "Max Kamachee", "Seongheon Park", "Yixuan Li"], "categories": ["cs.CL"], "comment": "TMLR 2025", "summary": "To mitigate the impact of hallucination nature of LLMs, many studies propose\ndetecting hallucinated generation through uncertainty estimation. However,\nthese approaches predominantly operate at the sentence or paragraph level,\nfailing to pinpoint specific spans or entities responsible for hallucinated\ncontent. This lack of granularity is especially problematic for long-form\noutputs that mix accurate and fabricated information. To address this\nlimitation, we explore entity-level hallucination detection. We propose a new\ndata set, HalluEntity, which annotates hallucination at the entity level. Based\non the dataset, we comprehensively evaluate uncertainty-based hallucination\ndetection approaches across 17 modern LLMs. Our experimental results show that\nuncertainty estimation approaches focusing on individual token probabilities\ntend to over-predict hallucinations, while context-aware methods show better\nbut still suboptimal performance. Through an in-depth qualitative study, we\nidentify relationships between hallucination tendencies and linguistic\nproperties and highlight important directions for future research.\n  HalluEntity: https://huggingface.co/datasets/samuelyeh/HalluEntity"}
{"id": "2502.12065", "pdf": "https://arxiv.org/pdf/2502.12065.pdf", "abs": "https://arxiv.org/abs/2502.12065", "title": "Autoformalization in the Wild: Assessing LLMs on Real-World Mathematical Definitions", "authors": ["Lan Zhang", "Marco Valentino", "Andre Freitas"], "categories": ["cs.CL", "cs.FL"], "comment": "EMNLP 2025 Camera-Ready Version", "summary": "Thanks to their linguistic capabilities, LLMs offer an opportunity to bridge\nthe gap between informal mathematics and formal languages through\nautoformalization. However, it is still unclear how well LLMs generalize to\nsophisticated and naturally occurring mathematical statements. To address this\ngap, we investigate the task of autoformalizing real-world mathematical\ndefinitions: a critical component of mathematical discourse. Specifically, we\nintroduce two novel resources for autoformalization, collecting definitions\nfrom Wikipedia (Def_Wiki) and arXiv papers (Def_ArXiv). We then systematically\nevaluate a range of LLMs, analyzing their ability to formalize definitions into\nIsabelle/HOL. Furthermore, we investigate strategies to enhance LLMs'\nperformance including refinement through external feedback from Proof\nAssistants, and formal definition grounding, where we augment LLMs'\nformalizations through relevant contextual elements from formal mathematical\nlibraries. Our findings reveal that definitions present a greater challenge\ncompared to existing benchmarks, such as miniF2F. In particular, we found that\nLLMs still struggle with self-correction, and aligning with relevant\nmathematical libraries. At the same time, structured refinement methods and\ndefinition grounding strategies yield notable improvements of up to 16% on\nself-correction capabilities and 43% on the reduction of undefined errors,\nhighlighting promising directions for enhancing LLM-based autoformalization in\nreal-world scenarios."}
{"id": "2502.12616", "pdf": "https://arxiv.org/pdf/2502.12616.pdf", "abs": "https://arxiv.org/abs/2502.12616", "title": "Improving Chain-of-Thought Reasoning via Quasi-Symbolic Abstractions", "authors": ["Leonardo Ranaldi", "Marco Valentino", "Andrè Freitas"], "categories": ["cs.CL"], "comment": null, "summary": "Chain-of-Though (CoT) represents a common strategy for reasoning in Large\nLanguage Models (LLMs) by decomposing complex tasks into intermediate inference\nsteps. However, explanations generated via CoT are susceptible to content\nbiases that negatively affect their robustness and faithfulness. To mitigate\nexisting limitations, recent work has proposed using logical formalisms coupled\nwith external symbolic solvers. However, fully symbolic approaches possess the\nbottleneck of requiring a complete translation from natural language to formal\nlanguages, a process that affects efficiency and flexibility. To achieve a\ntrade-off, this paper investigates methods to disentangle content from logical\nreasoning without a complete formalisation. In particular, we present QuaSAR\n(for Quasi-Symbolic Abstract Reasoning), a variation of CoT that guides LLMs to\noperate at a higher level of abstraction via quasi-symbolic explanations. Our\nframework leverages the capability of LLMs to formalise only relevant variables\nand predicates, enabling the coexistence of symbolic elements with natural\nlanguage. We show the impact of QuaSAR for in-context learning and for\nconstructing demonstrations to improve the reasoning capabilities of smaller\nmodels. Our experiments show that quasi-symbolic abstractions can improve\nCoT-based methods by up to 8% accuracy, enhancing robustness and consistency on\nchallenging adversarial variations on both natural language (i.e. MMLU-Redux)\nand symbolic reasoning tasks (i.e., GSM-Symbolic)."}
{"id": "2502.14791", "pdf": "https://arxiv.org/pdf/2502.14791.pdf", "abs": "https://arxiv.org/abs/2502.14791", "title": "Rapid Word Learning Through Meta In-Context Learning", "authors": ["Wentao Wang", "Guangyuan Jiang", "Tal Linzen", "Brenden M. Lake"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "EMNLP 2025", "summary": "Humans can quickly learn a new word from a few illustrative examples, and\nthen systematically and flexibly use it in novel contexts. Yet the abilities of\ncurrent language models for few-shot word learning, and methods for improving\nthese abilities, are underexplored. In this study, we introduce a novel method,\nMeta-training for IN-context learNing Of Words (Minnow). This method trains\nlanguage models to generate new examples of a word's usage given a few\nin-context examples, using a special placeholder token to represent the new\nword. This training is repeated on many new words to develop a general\nword-learning ability. We find that training models from scratch with Minnow on\nhuman-scale child-directed language enables strong few-shot word learning,\ncomparable to a large language model (LLM) pre-trained on orders of magnitude\nmore data. Furthermore, through discriminative and generative evaluations, we\ndemonstrate that finetuning pre-trained LLMs with Minnow improves their ability\nto discriminate between new words, identify syntactic categories of new words,\nand generate reasonable new usages and definitions for new words, based on one\nor a few in-context examples. These findings highlight the data efficiency of\nMinnow and its potential to improve language model performance in word learning\ntasks."}
{"id": "2502.18452", "pdf": "https://arxiv.org/pdf/2502.18452.pdf", "abs": "https://arxiv.org/abs/2502.18452", "title": "FRIDA to the Rescue! Analyzing Synthetic Data Effectiveness in Object-Based Common Sense Reasoning for Disaster Response", "authors": ["Mollie Shichman", "Claire Bonial", "Austin Blodgett", "Taylor Hudson", "Francis Ferraro", "Rachel Rudinger"], "categories": ["cs.CL", "cs.AI"], "comment": "8 pages, 3 figures, 5 tables", "summary": "During Human Robot Interactions in disaster relief scenarios, Large Language\nModels (LLMs) have the potential for substantial physical reasoning to assist\nin mission objectives. However, these reasoning capabilities are often found\nonly in larger models, which are not currently reasonable to deploy on robotic\nsystems due to size constraints. To meet our problem space requirements, we\nintroduce a dataset and pipeline to create Field Reasoning and Instruction\nDecoding Agent (FRIDA) models. In our pipeline, domain experts and linguists\ncombine their knowledge to make high-quality, few-shot prompts used to generate\nsynthetic data for fine-tuning. We hand-curate datasets for this few-shot\nprompting and for evaluation to improve LLM reasoning on both general and\ndisaster-specific objects. We concurrently run an ablation study to understand\nwhich kinds of synthetic data most affect performance. We fine-tune several\nsmall instruction-tuned models and find that ablated FRIDA models only trained\non objects' physical state and function data outperformed both the FRIDA models\ntrained on all synthetic data and the base models in our evaluation. We\ndemonstrate that the FRIDA pipeline is capable of instilling physical common\nsense with minimal data."}
{"id": "2503.09454", "pdf": "https://arxiv.org/pdf/2503.09454.pdf", "abs": "https://arxiv.org/abs/2503.09454", "title": "Explicit Learning and the LLM in Machine Translation", "authors": ["Malik Marmonier", "Rachel Bawden", "Benoît Sagot"], "categories": ["cs.CL"], "comment": null, "summary": "This study explores an LLM's ability to learn new languages using\nexplanations found in a grammar book, a process we term \"explicit learning.\" To\nrigorously assess this ability, we design controlled translation experiments\nbetween English and constructed languages generated, through specific\ncryptographic means, from Latin or French. Contrary to previous studies, our\nresults demonstrate that LLMs do possess a measurable capacity for explicit\nlearning. This ability, however, diminishes as the complexity of the linguistic\nphenomena to be learned increases. Supervised fine-tuning on ad hoc chains of\nthought significantly enhances LLM performance but struggles to generalize to\ntypologically novel or more complex linguistic features. These findings point\nto the need for more diverse training sets and alternative fine-tuning\nstrategies to further improve explicit learning by LLMs, benefiting\nlow-resource languages typically described in grammar books but lacking\nextensive corpora."}
{"id": "2503.16561", "pdf": "https://arxiv.org/pdf/2503.16561.pdf", "abs": "https://arxiv.org/abs/2503.16561", "title": "FutureGen: A RAG-based Approach to Generate the Future Work of Scientific Article", "authors": ["Ibrahim Al Azher", "Miftahul Jannat Mokarrama", "Zhishuai Guo", "Sagnik Ray Choudhury", "Hamed Alhoori"], "categories": ["cs.CL", "cs.LG"], "comment": "12 pages, 6 figures, Accepted for publication at the Workshop on AI\n  Principles in Science Communication (Ai4SC'25), held in conjunction with the\n  IEEE eScience Conference 2025", "summary": "The Future Work section of a scientific article outlines potential research\ndirections by identifying gaps and limitations of a current study. This section\nserves as a valuable resource for early-career researchers seeking unexplored\nareas and experienced researchers looking for new projects or collaborations.\nIn this study, we generate future work suggestions from a scientific article.\nTo enrich the generation process with broader insights and reduce the chance of\nmissing important research directions, we use context from related papers using\nRAG. We experimented with various Large Language Models (LLMs) integrated into\nRetrieval-Augmented Generation (RAG). We incorporate an LLM feedback mechanism\nto enhance the quality of the generated content and introduce an LLM-as-a-judge\nframework for robust evaluation, assessing key aspects such as novelty,\nhallucination, and feasibility. Our results demonstrate that the RAG-based\napproach using GPT-4o mini, combined with an LLM feedback mechanism,\noutperforms other methods based on both qualitative and quantitative\nevaluations. Moreover, we conduct a human evaluation to assess the LLM as an\nextractor, generator, and feedback provider."}
{"id": "2503.21080", "pdf": "https://arxiv.org/pdf/2503.21080.pdf", "abs": "https://arxiv.org/abs/2503.21080", "title": "EQ-Knight: A Memory-Augmented LLM Agent for Strategic Affective Gaming in Debt Recovery", "authors": ["Yunbo Long", "Yuhan Liu", "Liming Xu", "Alexandra Brintrup"], "categories": ["cs.CL"], "comment": null, "summary": "Large language model-based chatbots have enhanced engagement in financial\nnegotiations, but their overreliance on passive empathy introduces critical\nrisks in credit collection. While empathy-driven approaches preserve client\nsatisfaction in benign cases, they fail catastrophically against dishonest\ndebtors--individuals who exploit conciliatory tactics to manipulate terms or\nevade repayment. Blindly prioritizing \"customer experience\" in such scenarios\nleads to creditor vulnerabilities: revenue leakage, moral hazard, and systemic\nexploitation. To address this, we propose EQ-Knight, an LLM agent that\ndynamically optimizes emotional strategy to defend creditor interests. Unlike\nnaive empathy-centric bots, EQ-Knight integrates emotion memory and\ngame-theoretic reasoning, powered by a Hidden Markov Model (HMM) to track and\npredict debtor emotional states. By analyzing both real-time and historical\nemotional cues, EQ-Knight strategically counters negative emotions (e.g.,\naggression, feigned distress) while preserving productive debtor relationships.\nExperiments demonstrate EQ-Knight's superiority over conventional LLM\nnegotiators: it achieves a 32\\% reduction in concession losses without\ncompromising recovery rates, particularly in adversarial cases where debtors\nweaponize negative emotions (e.g., intimidation, guilt-tripping) to coerce\nconcessions. For credit agencies, EQ-Knight transforms LLMs from high-risk\n\"people-pleasers\" into strategic emotion-defenders--balancing emotional\nintelligence with tactical rigor to enforce accountability and deter\nexploitation."}
{"id": "2504.12311", "pdf": "https://arxiv.org/pdf/2504.12311.pdf", "abs": "https://arxiv.org/abs/2504.12311", "title": "Learning Optimal Prompt Ensemble for Multi-source Visual Prompt Transfer", "authors": ["Jianhua Liu", "Liwen Cao", "Yanru Wu", "Zijie Zhao", "Yang Li"], "categories": ["cs.CL"], "comment": null, "summary": "Prompt tuning has emerged as a lightweight strategy for adapting foundation\nmodels to downstream tasks, particularly for resource-constrained systems. As\npre-trained prompts become valuable assets, combining multiple source prompts\noffers a promising approach to enhance generalization for new tasks by\nleveraging complementary knowledge. However, naive aggregation often overlooks\ndifferent source prompts have different contribution potential to the target\ntask. To address this, we propose HGPrompt, a dynamic framework that learns\noptimal ensemble weights. These weights are optimized by jointly maximizing an\ninformation-theoretic metric for transferability and minimizing gradient\nconflicts via a novel regularization strategy. Specifically, we propose a\ndifferentiable prompt transferability metric to captures the discriminability\nof prompt-induced features on the target task. Meanwhile, HGPrompt match the\ngradient variances with respect to different source prompts based on Hessian\nand Fisher Information, ensuring stable and coherent knowledge transfer while\nsuppressing gradient conflicts among them. Extensive experiments on the\nlarge-scale VTAB benchmark demonstrate the state-of-the-art performance of\nHGPrompt, validating its effectiveness in learning an optimal ensemble for\neffective multi-source prompt transfer."}
{"id": "2505.14585", "pdf": "https://arxiv.org/pdf/2505.14585.pdf", "abs": "https://arxiv.org/abs/2505.14585", "title": "Context Reasoner: Incentivizing Reasoning Capability for Contextualized Privacy and Safety Compliance via Reinforcement Learning", "authors": ["Wenbin Hu", "Haoran Li", "Huihao Jing", "Qi Hu", "Ziqian Zeng", "Sirui Han", "Heli Xu", "Tianshu Chu", "Peizhao Hu", "Yangqiu Song"], "categories": ["cs.CL"], "comment": "Accepted to EMNLP 2025 Main", "summary": "While Large Language Models (LLMs) exhibit remarkable capabilities, they also\nintroduce significant safety and privacy risks. Current mitigation strategies\noften fail to preserve contextual reasoning capabilities in risky scenarios.\nInstead, they rely heavily on sensitive pattern matching to protect LLMs, which\nlimits the scope. Furthermore, they overlook established safety and privacy\nstandards, leading to systemic risks for legal compliance. To address these\ngaps, we formulate safety and privacy issues into contextualized compliance\nproblems following the Contextual Integrity (CI) theory. Under the CI\nframework, we align our model with three critical regulatory standards: GDPR,\nEU AI Act, and HIPAA. Specifically, we employ reinforcement learning (RL) with\na rule-based reward to incentivize contextual reasoning capabilities while\nenhancing compliance with safety and privacy norms. Through extensive\nexperiments, we demonstrate that our method not only significantly enhances\nlegal compliance (achieving a +8.58% accuracy improvement in safety/privacy\nbenchmarks) but also further improves general reasoning capability. For\nOpenThinker-7B, a strong reasoning model that significantly outperforms its\nbase model Qwen2.5-7B-Instruct across diverse subjects, our method enhances its\ngeneral reasoning capabilities, with +2.05% and +8.98% accuracy improvement on\nthe MMLU and LegalBench benchmark, respectively."}
{"id": "2506.07900", "pdf": "https://arxiv.org/pdf/2506.07900.pdf", "abs": "https://arxiv.org/abs/2506.07900", "title": "MiniCPM4: Ultra-Efficient LLMs on End Devices", "authors": ["MiniCPM Team", "Chaojun Xiao", "Yuxuan Li", "Xu Han", "Yuzhuo Bai", "Jie Cai", "Haotian Chen", "Wentong Chen", "Xin Cong", "Ganqu Cui", "Ning Ding", "Shengda Fan", "Yewei Fang", "Zixuan Fu", "Wenyu Guan", "Yitong Guan", "Junshao Guo", "Yufeng Han", "Bingxiang He", "Yuxiang Huang", "Baoxi Ji", "Cunliang Kong", "Qiuzuo Li", "Siyuan Li", "Wenhao Li", "Xin Li", "Yanghao Li", "Yishan Li", "Zhen Li", "Dan Liu", "Biyuan Lin", "Yankai Lin", "Xiang Long", "Quanyu Lu", "Yaxi Lu", "Peiyan Luo", "Hongya Lyu", "Litu Ou", "Yinxu Pan", "Lushi Pu", "Zekai Qu", "Qundong Shi", "Zijun Song", "Jiayuan Su", "Zhou Su", "Ao Sun", "Xianghui Sun", "Peijun Tang", "Fangzheng Wang", "Feng Wang", "Shuo Wang", "Yudong Wang", "Zheng Wang", "Yesai Wu", "Zhenyu Xiao", "Jie Xie", "Zihao Xie", "Xiaoyue Xu", "Yukun Yan", "Jiarui Yuan", "Jinqian Zhang", "Kaihuo Zhang", "Lei Zhang", "Linyue Zhang", "Xueren Zhang", "Yudi Zhang", "Hengyu Zhao", "Weilin Zhao", "Weilun Zhao", "Yuanqian Zhao", "Zhi Zheng", "Chuyue Zhou", "Ge Zhou", "Jie Zhou", "Wei Zhou", "Yanghao Zhou", "Zihan Zhou", "Zixuan Zhou", "Zhiyuan Liu", "Guoyang Zeng", "Chao Jia", "Dahai Li", "Maosong Sun"], "categories": ["cs.CL", "cs.AI"], "comment": "MiniCPM4 Technical Report", "summary": "This paper introduces MiniCPM4, a highly efficient large language model (LLM)\ndesigned explicitly for end-side devices. We achieve this efficiency through\nsystematic innovation in four key dimensions: model architecture, training\ndata, training algorithms, and inference systems. Specifically, in terms of\nmodel architecture, we propose InfLLM v2, a trainable sparse attention\nmechanism that accelerates both prefilling and decoding phases for long-context\nprocessing. Regarding training data, we propose UltraClean, an efficient and\naccurate pre-training data filtering and generation strategy, and UltraChat v2,\na comprehensive supervised fine-tuning dataset. These datasets enable\nsatisfactory model performance to be achieved using just 8 trillion training\ntokens. Regarding training algorithms, we propose ModelTunnel v2 for efficient\npre-training strategy search, and improve existing post-training methods by\nintroducing chunk-wise rollout for load-balanced reinforcement learning and\ndata-efficient tenary LLM, BitCPM. Regarding inference systems, we propose\nCPM.cu that integrates sparse attention, model quantization, and speculative\nsampling to achieve efficient prefilling and decoding. To meet diverse\non-device requirements, MiniCPM4 is available in two versions, with 0.5B and 8B\nparameters, respectively. Furthermore, we construct a hybrid reasoning model,\nMiniCPM4.1, which can be used in both deep reasoning mode and non-reasoning\nmode. Evaluation results demonstrate that MiniCPM4 and MiniCPM4.1 outperform\nsimilar-sized open-source models across benchmarks, with the 8B variants\nshowing significant speed improvements on long sequence understanding and\ngeneration."}
{"id": "2506.09556", "pdf": "https://arxiv.org/pdf/2506.09556.pdf", "abs": "https://arxiv.org/abs/2506.09556", "title": "MEDUSA: A Multimodal Deep Fusion Multi-Stage Training Framework for Speech Emotion Recognition in Naturalistic Conditions", "authors": ["Georgios Chatzichristodoulou", "Despoina Kosmopoulou", "Antonios Kritikos", "Anastasia Poulopoulou", "Efthymios Georgiou", "Athanasios Katsamanis", "Vassilis Katsouros", "Alexandros Potamianos"], "categories": ["cs.CL"], "comment": "Interspeech 2025", "summary": "SER is a challenging task due to the subjective nature of human emotions and\ntheir uneven representation under naturalistic conditions. We propose MEDUSA, a\nmultimodal framework with a four-stage training pipeline, which effectively\nhandles class imbalance and emotion ambiguity. The first two stages train an\nensemble of classifiers that utilize DeepSER, a novel extension of a deep\ncross-modal transformer fusion mechanism from pretrained self-supervised\nacoustic and linguistic representations. Manifold MixUp is employed for further\nregularization. The last two stages optimize a trainable meta-classifier that\ncombines the ensemble predictions. Our training approach incorporates human\nannotation scores as soft targets, coupled with balanced data sampling and\nmultitask learning. MEDUSA ranked 1st in Task 1: Categorical Emotion\nRecognition in the Interspeech 2025: Speech Emotion Recognition in Naturalistic\nConditions Challenge."}
{"id": "2506.22141", "pdf": "https://arxiv.org/pdf/2506.22141.pdf", "abs": "https://arxiv.org/abs/2506.22141", "title": "DAPFAM: A Domain-Aware Family-level Dataset to benchmark cross domain patent retrieval", "authors": ["Iliass Ayaou", "Denis Cavallucci", "Hicham Chibane"], "categories": ["cs.CL", "cs.IR"], "comment": null, "summary": "Patent prior-art retrieval becomes especially challenging when relevant\ndisclosures cross technological boundaries. Existing benchmarks lack explicit\ndomain partitions, making it difficult to assess how retrieval systems cope\nwith such shifts. We introduce DAPFAM, a family-level benchmark with explicit\nIN-domain and OUT-domain partitions defined by a new IPC3 overlap scheme. The\ndataset contains 1,247 query families and 45,336 target families aggregated at\nthe family level to reduce international redundancy, with citation based\nrelevance judgments. We conduct 249 controlled experiments spanning lexical\n(BM25) and dense (transformer) backends, document and passage level retrieval,\nmultiple query and document representations, aggregation strategies, and hybrid\nfusion via Reciprocal Rank Fusion (RRF). Results reveal a pronounced domain\ngap: OUT-domain performance remains roughly five times lower than IN-domain\nacross all configurations. Passage-level retrieval consistently outperforms\ndocument-level, and dense methods provide modest gains over BM25, but none\nclose the OUT-domain gap. Document-level RRF yields strong effectiveness\nefficiency trade-offs with minimal overhead. By exposing the persistent\nchallenge of cross-domain retrieval, DAPFAM provides a reproducible,\ncompute-aware testbed for developing more robust patent IR systems. The dataset\nis publicly available on huggingface at\nhttps://huggingface.co/datasets/datalyes/DAPFAM_patent."}
{"id": "2508.00454", "pdf": "https://arxiv.org/pdf/2508.00454.pdf", "abs": "https://arxiv.org/abs/2508.00454", "title": "Learning an Efficient Multi-Turn Dialogue Evaluator from Multiple Judges", "authors": ["Yuqi Tang", "Kehua Feng", "Yunfeng Wang", "Zhiwen Chen", "Chengfei Lv", "Gang Yu", "Qiang Zhang", "Keyan Ding"], "categories": ["cs.CL"], "comment": "15 pages, 2 pages, under review", "summary": "Evaluating the conversational abilities of large language models (LLMs)\nremains a challenging task. Current mainstream approaches primarily rely on the\n\"LLM-as-a-judge\" paradigm, where an LLM is prompted to serve as an evaluator to\nassess dialogue quality. However, such methods often suffer from various\nbiases, which undermine the reliability and consistency of the evaluation\nresults. To mitigate these biases, recent methods employ multiple LLMs as\njudges and aggregate their judgments to select the optimal assessment. Although\neffective, this multi-judge approach incurs significant computational overhead\nduring inference. In this paper, we propose an efficient multi-turn dialogue\nevaluator that captures the collective wisdom of multiple LLM judges by\naggregating their preference knowledge into a single model. Our approach\npreserves the advantages of diverse multi-judge feedback while drastically\nreducing the evaluation cost, enabling fast and flexible dialogue quality\nassessment. Extensive experiments on seven single rating and pairwise\ncomparison dialogue evaluation benchmarks demonstrate that our method\noutperforms existing baselines across diverse scenarios, showcasing its\nefficiency and robustness."}
{"id": "2508.06971", "pdf": "https://arxiv.org/pdf/2508.06971.pdf", "abs": "https://arxiv.org/abs/2508.06971", "title": "Two-Stage Quranic QA via Ensemble Retrieval and Instruction-Tuned Answer Extraction", "authors": ["Mohamed Basem", "Islam Oshallah", "Ali Hamdi", "Khaled Shaban", "Hozaifa Kassab"], "categories": ["cs.CL", "cs.IR"], "comment": "8 pages , 4 figures , Accepted in Aiccsa 2025 ,\n  https://conferences.sigappfr.org/aiccsa2025/", "summary": "Quranic Question Answering presents unique challenges due to the linguistic\ncomplexity of Classical Arabic and the semantic richness of religious texts. In\nthis paper, we propose a novel two-stage framework that addresses both passage\nretrieval and answer extraction. For passage retrieval, we ensemble fine-tuned\nArabic language models to achieve superior ranking performance. For answer\nextraction, we employ instruction-tuned large language models with few-shot\nprompting to overcome the limitations of fine-tuning on small datasets. Our\napproach achieves state-of-the-art results on the Quran QA 2023 Shared Task,\nwith a MAP@10 of 0.3128 and MRR@10 of 0.5763 for retrieval, and a pAP@10 of\n0.669 for extraction, substantially outperforming previous methods. These\nresults demonstrate that combining model ensembling and instruction-tuned\nlanguage models effectively addresses the challenges of low-resource question\nanswering in specialized domains."}
{"id": "2508.14723", "pdf": "https://arxiv.org/pdf/2508.14723.pdf", "abs": "https://arxiv.org/abs/2508.14723", "title": "Transplant Then Regenerate: A New Paradigm for Text Data Augmentation", "authors": ["Guangzhan Wang", "Hongyu Zhang", "Beijun Shen", "Xiaodong Gu"], "categories": ["cs.CL", "cs.AI"], "comment": "Accepted by EMNLP 2025", "summary": "Data augmentation is a critical technique in deep learning. Traditional\nmethods like Back-translation typically focus on lexical-level rephrasing,\nwhich primarily produces variations with the same semantics. While large\nlanguage models (LLMs) have enhanced text augmentation by their \"knowledge\nemergence\" capability, controlling the style and structure of these outputs\nremains challenging and requires meticulous prompt engineering. In this paper,\nwe propose LMTransplant, a novel text augmentation paradigm leveraging LLMs.\nThe core idea of LMTransplant is transplant-then-regenerate: incorporating seed\ntext into a context expanded by LLM, and asking the LLM to regenerate a variant\nbased on the expanded context. This strategy allows the model to create more\ndiverse and creative content-level variants by fully leveraging the knowledge\nembedded in LLMs, while preserving the core attributes of the original text. We\nevaluate LMTransplant across various text-related tasks, demonstrating its\nsuperior performance over existing text augmentation methods. Moreover,\nLMTransplant demonstrates exceptional scalability as the size of augmented data\ngrows."}
{"id": "2508.15478", "pdf": "https://arxiv.org/pdf/2508.15478.pdf", "abs": "https://arxiv.org/abs/2508.15478", "title": "SLM-Bench: A Comprehensive Benchmark of Small Language Models on Environmental Impacts--Extended Version", "authors": ["Nghiem Thanh Pham", "Tung Kieu", "Duc-Manh Nguyen", "Son Ha Xuan", "Nghia Duong-Trung", "Danh Le-Phuoc"], "categories": ["cs.CL", "cs.CY", "cs.PF"], "comment": "24 pages. An extended version of \"SLM-Bench: A Comprehensive\n  Benchmark of Small Language Models on Environmental Impacts\" accepted at\n  EMNLP 2025", "summary": "Small Language Models (SLMs) offer computational efficiency and\naccessibility, yet a systematic evaluation of their performance and\nenvironmental impact remains lacking. We introduce SLM-Bench, the first\nbenchmark specifically designed to assess SLMs across multiple dimensions,\nincluding accuracy, computational efficiency, and sustainability metrics.\nSLM-Bench evaluates 15 SLMs on 9 NLP tasks using 23 datasets spanning 14\ndomains. The evaluation is conducted on 4 hardware configurations, providing a\nrigorous comparison of their effectiveness. Unlike prior benchmarks, SLM-Bench\nquantifies 11 metrics across correctness, computation, and consumption,\nenabling a holistic assessment of efficiency trade-offs. Our evaluation\nconsiders controlled hardware conditions, ensuring fair comparisons across\nmodels. We develop an open-source benchmarking pipeline with standardized\nevaluation protocols to facilitate reproducibility and further research. Our\nfindings highlight the diverse trade-offs among SLMs, where some models excel\nin accuracy while others achieve superior energy efficiency. SLM-Bench sets a\nnew standard for SLM evaluation, bridging the gap between resource efficiency\nand real-world applicability."}
{"id": "2508.19740", "pdf": "https://arxiv.org/pdf/2508.19740.pdf", "abs": "https://arxiv.org/abs/2508.19740", "title": "Spotlight Attention: Towards Efficient LLM Generation via Non-linear Hashing-based KV Cache Retrieval", "authors": ["Wenhao Li", "Yuxin Zhang", "Gen Luo", "Haiyuan Wan", "Ziyang Gong", "Fei Chao", "Rongrong Ji"], "categories": ["cs.CL"], "comment": null, "summary": "Reducing the key-value (KV) cache burden in Large Language Models (LLMs)\nsignificantly accelerates inference. Dynamically selecting critical KV caches\nduring decoding helps maintain performance. Existing methods use random linear\nhashing to identify important tokens, but this approach is inefficient due to\nthe orthogonal distribution of queries and keys within two narrow cones in\nLLMs. We introduce Spotlight Attention, a novel method that employs non-linear\nhashing functions to optimize the embedding distribution of queries and keys,\nenhancing coding efficiency and robustness. We also developed a lightweight,\nstable training framework using a Bradley-Terry ranking-based loss, enabling\noptimization of the non-linear hashing module on GPUs with 16GB memory in 8\nhours. Experimental results show that Spotlight Attention drastically improves\nretrieval precision while shortening the length of the hash code at least\n5$\\times$ compared to traditional linear hashing. Finally, we exploit the\ncomputational advantages of bitwise operations by implementing specialized CUDA\nkernels, achieving hashing retrieval for 512K tokens in under 100$\\mu$s on a\nsingle A100 GPU, with end-to-end throughput up to 3$\\times$ higher than vanilla\ndecoding."}
{"id": "2508.20038", "pdf": "https://arxiv.org/pdf/2508.20038.pdf", "abs": "https://arxiv.org/abs/2508.20038", "title": "Forewarned is Forearmed: Pre-Synthesizing Jailbreak-like Instructions to Enhance LLM Safety Guardrail to Potential Attacks", "authors": ["Sheng Liu", "Qiang Sheng", "Danding Wang", "Yang Li", "Guang Yang", "Juan Cao"], "categories": ["cs.CL"], "comment": "EMNLP 2025 findings", "summary": "Despite advances in improving large language model (LLM) to refuse to answer\nmalicious instructions, widely used LLMs remain vulnerable to jailbreak attacks\nwhere attackers generate instructions with distributions differing from safety\nalignment corpora. New attacks expose LLMs' inability to recognize unseen\nmalicious instructions, highlighting a critical distributional mismatch between\ntraining data and real-world attacks that forces developers into reactive\npatching cycles. To tackle this challenge, we propose IMAGINE, a synthesis\nframework that leverages embedding space distribution analysis to generate\njailbreak-like instructions. This approach effectively fills the distributional\ngap between authentic jailbreak patterns and safety alignment corpora. IMAGINE\nfollows an iterative optimization process that dynamically evolves text\ngeneration distributions across iterations, thereby augmenting the coverage of\nsafety alignment data distributions through synthesized data examples. Based on\nthe safety-aligned corpus enhanced through IMAGINE, our framework demonstrates\nsignificant decreases in attack success rate on Qwen2.5, Llama3.1, and Llama3.2\nwithout compromising their utility."}
{"id": "2508.20324", "pdf": "https://arxiv.org/pdf/2508.20324.pdf", "abs": "https://arxiv.org/abs/2508.20324", "title": "Can Compact Language Models Search Like Agents? Distillation-Guided Policy Optimization for Preserving Agentic RAG Capabilities", "authors": ["Rikuto Kotoge", "Mai Nishimura", "Jiaxin Ma"], "categories": ["cs.CL"], "comment": null, "summary": "Reinforcement Learning has emerged as a post-training approach to elicit\nagentic RAG behaviors such as search and planning from language models.\nHowever, compact language models (e.g., 0.5B parameters) struggle due to poor\nreasoning ability, resulting in sparse rewards and unstable training. To\novercome these difficulties, we propose Distillation-Guided Policy Optimization\n(DGPO), which addresses the challenges through cold-start initialization from\nteacher demonstrations and continuous teacher guidance during policy\noptimization. To systematically evaluate our approach, we introduce Agentic RAG\nCapabilities (ARC), a fine-grained metric analyzing reasoning, search\ncoordination, and response synthesis. Comprehensive experiments demonstrate\nthat DGPO enables compact models to achieve sophisticated agentic search\nbehaviors, even outperforming the larger teacher model in some cases. DGPO\nmakes agentic RAG feasible in computing resource-constrained environments."}
{"id": "2508.20410", "pdf": "https://arxiv.org/pdf/2508.20410.pdf", "abs": "https://arxiv.org/abs/2508.20410", "title": "UI-Bench: A Benchmark for Evaluating Design Capabilities of AI Text-to-App Tools", "authors": ["Sam Jung", "Agustin Garcinuno", "Spencer Mateega"], "categories": ["cs.CL"], "comment": null, "summary": "AI text-to-app tools promise high quality applications and websites in\nminutes, yet no public benchmark rigorously verifies those claims. We introduce\nUI-Bench, the first large-scale benchmark that evaluates visual excellence\nacross competing AI text-to-app tools through expert pairwise comparison.\nSpanning 10 tools, 30 prompts, 300 generated sites, and 4,000+ expert\njudgments, UI-Bench ranks systems with a TrueSkill-derived model that yields\ncalibrated confidence intervals. UI-Bench establishes a reproducible standard\nfor advancing AI-driven web design. We release (i) the complete prompt set,\n(ii) an open-source evaluation framework, and (iii) a public leaderboard. The\ngenerated sites rated by participants will be released soon. View the UI-Bench\nleaderboard at https://uibench.ai/leaderboard."}
{"id": "2509.01185", "pdf": "https://arxiv.org/pdf/2509.01185.pdf", "abs": "https://arxiv.org/abs/2509.01185", "title": "Modular Techniques for Synthetic Long-Context Data Generation in Language Model Training and Evaluation", "authors": ["Seganrasan Subramanian", "Abhigya Verma"], "categories": ["cs.CL", "cs.AI"], "comment": "26 pages, 4 figures", "summary": "The ability of large language models (LLMs) to process and reason over long\ntextual inputs is critical for a wide range of real-world applications.\nHowever, progress in this area is significantly constrained by the absence of\nhigh-quality, diverse, and verifiable long-context datasets suitable for both\ntraining and evaluation. This work introduces a modular, extensible framework\nfor synthetic long-context data generation via prompt-based interaction with\nLLMs. The framework supports multiple training and alignment objectives,\nincluding Supervised Fine-Tuning (SFT), Direct Preference Optimization (DPO),\nand Group Relative Policy Optimization (GRPO). It encompasses four core\ngeneration paradigms: multi-turn conversational dialogues, document-grounded\ninput-output pairs, verifiable instruction-response tasks, and long-context\nreasoning examples. Through templated prompting, a model-agnostic architecture,\nand metadata-enriched outputs, the proposed approach facilitates scalable,\ncontrollable, and purpose-aligned dataset creation for advancing long-context\ncapabilities in LLMs."}
{"id": "2509.01221", "pdf": "https://arxiv.org/pdf/2509.01221.pdf", "abs": "https://arxiv.org/abs/2509.01221", "title": "DaMoC: Efficiently Selecting the Optimal Large Language Model for Fine-tuning Domain Tasks Based on Data and Model Compression", "authors": ["Wei Huang", "Huang Wei", "Yinggui Wang"], "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Accepted by EMNLP 2025", "summary": "Large language models (LLMs) excel in general tasks but struggle with\ndomain-specific ones, requiring fine-tuning with specific data. With many\nopen-source LLMs available, selecting the best model for fine-tuning downstream\ntasks is challenging, primarily focusing on how to quickly identify the optimal\nLLM. We introduce a Data and Model Compression Framework (DaMoC) that addresses\nthis challenge by: 1) Data Level: A systematic categorization of data filtering\nmethodologies for LLMs is first established, classifying them into three\ndistinct paradigms: (1) distribution-aware methods, (2) quality-aware methods,\nand (3) hybrid approaches considering both dimensions. Further, we enhance the\ndensity of key tokens in the text achieving token compression. Subsequently, we\nuse an LLM to iterative rewrite the text to optimize its expression. 2) Model\nLevel: We use layer similarity scores to assess each layer's importance and\nremove those with lower importance. Then, we introduce a sparse merging\nparadigm to preserve as much of the original model's capability as possible.\nExtensive experiments on four datasets, medical Q&A, financial Q&A, general\nQ&A, and reading comprehension, show that we can select the optimal LLM while\nsaving approximately 20-fold in training time."}
{"id": "2509.02038", "pdf": "https://arxiv.org/pdf/2509.02038.pdf", "abs": "https://arxiv.org/abs/2509.02038", "title": "NADI 2025: The First Multidialectal Arabic Speech Processing Shared Task", "authors": ["Bashar Talafha", "Hawau Olamide Toyin", "Peter Sullivan", "AbdelRahim Elmadany", "Abdurrahman Juma", "Amirbek Djanibekov", "Chiyu Zhang", "Hamad Alshehhi", "Hanan Aldarmaki", "Mustafa Jarrar", "Nizar Habash", "Muhammad Abdul-Mageed"], "categories": ["cs.CL", "cs.SD"], "comment": null, "summary": "We present the findings of the sixth Nuanced Arabic Dialect Identification\n(NADI 2025) Shared Task, which focused on Arabic speech dialect processing\nacross three subtasks: spoken dialect identification (Subtask 1), speech\nrecognition (Subtask 2), and diacritic restoration for spoken dialects (Subtask\n3). A total of 44 teams registered, and during the testing phase, 100 valid\nsubmissions were received from eight unique teams. The distribution was as\nfollows: 34 submissions for Subtask 1 \"five teams{\\ae}, 47 submissions for\nSubtask 2 \"six teams\", and 19 submissions for Subtask 3 \"two teams\". The\nbest-performing systems achieved 79.8% accuracy on Subtask 1, 35.68/12.20\nWER/CER (overall average) on Subtask 2, and 55/13 WER/CER on Subtask 3. These\nresults highlight the ongoing challenges of Arabic dialect speech processing,\nparticularly in dialect identification, recognition, and diacritic restoration.\nWe also summarize the methods adopted by participating teams and briefly\noutline directions for future editions of NADI."}
{"id": "2509.03020", "pdf": "https://arxiv.org/pdf/2509.03020.pdf", "abs": "https://arxiv.org/abs/2509.03020", "title": "Training LLMs to be Better Text Embedders through Bidirectional Reconstruction", "authors": ["Chang Su", "Dengliang Shi", "Siyuan Huang", "Jintao Du", "Changhua Meng", "Yu Cheng", "Weiqiang Wang", "Zhouhan Lin"], "categories": ["cs.CL", "cs.IR"], "comment": "accepted by EMNLP 2025 Main Conference", "summary": "Large language models (LLMs) have increasingly been explored as powerful text\nembedders. Existing LLM-based text embedding approaches often leverage the\nembedding of the final token, typically a reserved special token such as [EOS].\nHowever, these tokens have not been intentionally trained to capture the\nsemantics of the whole context, limiting their capacity as text embeddings,\nespecially for retrieval and re-ranking tasks. We propose to add a new training\nstage before contrastive learning to enrich the semantics of the final token\nembedding. This stage employs bidirectional generative reconstruction tasks,\nnamely EBQ2D (Embedding-Based Query-to-Document) and EBD2Q (Embedding-Based\nDocument-to-Query), which interleave to anchor the [EOS] embedding and\nreconstruct either side of Query-Document pairs. Experimental results\ndemonstrate that our additional training stage significantly improves LLM\nperformance on the Massive Text Embedding Benchmark (MTEB), achieving new\nstate-of-the-art results across different LLM base models and scales."}
{"id": "2509.03312", "pdf": "https://arxiv.org/pdf/2509.03312.pdf", "abs": "https://arxiv.org/abs/2509.03312", "title": "AgenTracer: Who Is Inducing Failure in the LLM Agentic Systems?", "authors": ["Guibin Zhang", "Junhao Wang", "Junjie Chen", "Wangchunshu Zhou", "Kun Wang", "Shuicheng Yan"], "categories": ["cs.CL", "cs.MA"], "comment": null, "summary": "Large Language Model (LLM)-based agentic systems, often comprising multiple\nmodels, complex tool invocations, and orchestration protocols, substantially\noutperform monolithic agents. Yet this very sophistication amplifies their\nfragility, making them more prone to system failure. Pinpointing the specific\nagent or step responsible for an error within long execution traces defines the\ntask of agentic system failure attribution. Current state-of-the-art reasoning\nLLMs, however, remain strikingly inadequate for this challenge, with accuracy\ngenerally below 10%. To address this gap, we propose AgenTracer, the first\nautomated framework for annotating failed multi-agent trajectories via\ncounterfactual replay and programmed fault injection, producing the curated\ndataset TracerTraj. Leveraging this resource, we develop AgenTracer-8B, a\nlightweight failure tracer trained with multi-granular reinforcement learning,\ncapable of efficiently diagnosing errors in verbose multi-agent interactions.\nOn the Who&When benchmark, AgenTracer-8B outperforms giant proprietary LLMs\nlike Gemini-2.5-Pro and Claude-4-Sonnet by up to 18.18%, setting a new standard\nin LLM agentic failure attribution. More importantly, AgenTracer-8B delivers\nactionable feedback to off-the-shelf multi-agent systems like MetaGPT and MaAS\nwith 4.8-14.2% performance gains, empowering self-correcting and self-evolving\nagentic AI."}
{"id": "2406.13923", "pdf": "https://arxiv.org/pdf/2406.13923.pdf", "abs": "https://arxiv.org/abs/2406.13923", "title": "PIN: A Knowledge-Intensive Dataset for Paired and Interleaved Multimodal Documents", "authors": ["Junjie Wang", "Yuxiang Zhang", "Minghao Liu", "Yin Zhang", "Yatai Ji", "Weihao Xuan", "Nie Lin", "Kang Zhu", "Zhiqiang Lin", "Yiming Ren", "Chunyang Jiang", "Yiyao Yu", "Zekun Wang", "Tiezhen Wang", "Wenhao Huang", "Jie Fu", "Qunshu Liu", "Yujiu Yang", "Ge Zhang", "Ruibin Yuan", "Bei Chen", "Wenhu Chen"], "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.MM"], "comment": "Technical report v1.0", "summary": "Recent advancements in large multimodal models (LMMs) have leveraged\nextensive multimodal datasets to enhance capabilities in complex\nknowledge-driven tasks. However, persistent challenges in perceptual and\nreasoning errors limit their efficacy, particularly in interpreting intricate\nvisual data and deducing multimodal relationships. To address these issues, we\nintroduce PIN (Paired and INterleaved multimodal documents), a novel data\nformat designed to foster a deeper integration of visual and textual knowledge.\nThe PIN format uniquely combines semantically rich Markdown files, which\npreserve fine-grained textual structures, with holistic overall images that\ncapture the complete document layout. Following this format, we construct and\nrelease two large-scale, open-source datasets: PIN-200M (~200 million\ndocuments) and PIN-14M (~14 million), compiled from diverse web and scientific\nsources in both English and Chinese. To maximize usability, we provide detailed\nstatistical analyses and equip the datasets with quality signals, enabling\nresearchers to easily filter and select data for specific tasks. Our work\nprovides the community with a versatile data format and substantial resources,\noffering a foundation for new research in pre-training strategies and the\ndevelopment of more powerful knowledge-intensive LMMs."}
{"id": "2407.01085", "pdf": "https://arxiv.org/pdf/2407.01085.pdf", "abs": "https://arxiv.org/abs/2407.01085", "title": "Explaining Length Bias in LLM-Based Preference Evaluations", "authors": ["Zhengyu Hu", "Linxin Song", "Jieyu Zhang", "Zheyuan Xiao", "Tianfu Wang", "Zhengyu Chen", "Nicholas Jing Yuan", "Jianxun Lian", "Kaize Ding", "Hui Xiong"], "categories": ["cs.LG", "cs.CL"], "comment": null, "summary": "The use of large language models (LLMs) as judges, particularly in preference\ncomparisons, has become widespread, but this reveals a notable bias towards\nlonger responses, undermining the reliability of such evaluations. To better\nunderstand such bias, we propose to decompose the preference evaluation metric,\nspecifically the win rate, into two key components: desirability and\ninformation mass, where the former is length-independent and related to\ntrustworthiness such as correctness, toxicity, and consistency, and the latter\nis length-dependent and represents the amount of information in the response.\nWe empirically demonstrated the decomposition through controlled experiments\nand found that response length impacts evaluations by influencing information\nmass. To derive a reliable evaluation metric that assesses content quality\nwithout being confounded by response length, we propose AdapAlpaca, a simple\nyet effective adjustment to win rate measurement. Specifically, AdapAlpaca\nensures a fair comparison of response quality by aligning the lengths of\nreference and test model responses under equivalent length intervals."}
{"id": "2412.05248", "pdf": "https://arxiv.org/pdf/2412.05248.pdf", "abs": "https://arxiv.org/abs/2412.05248", "title": "Enhancing FKG.in: automating Indian food composition analysis", "authors": ["Saransh Kumar Gupta", "Lipika Dey", "Partha Pratim Das", "Geeta Trilok-Kumar", "Ramesh Jain"], "categories": ["cs.AI", "cs.CL", "cs.IR"], "comment": "15 pages, 5 figures, 30 references, International Conference on\n  Pattern Recognition 2024 - Multimedia Assisted Dietary Management Workshop", "summary": "This paper presents a novel approach to compute food composition data for\nIndian recipes using a knowledge graph for Indian food (FKG[.]in) and LLMs. The\nprimary focus is to provide a broad overview of an automated food composition\nanalysis workflow and describe its core functionalities: nutrition data\naggregation, food composition analysis, and LLM-augmented information\nresolution. This workflow aims to complement FKG[.]in and iteratively\nsupplement food composition data from verified knowledge bases. Additionally,\nthis paper highlights the challenges of representing Indian food and accessing\nfood composition data digitally. It also reviews three key sources of food\ncomposition data: the Indian Food Composition Tables, the Indian Nutrient\nDatabank, and the Nutritionix API. Furthermore, it briefly outlines how users\ncan interact with the workflow to obtain diet-based health recommendations and\ndetailed food composition information for numerous recipes. We then explore the\ncomplex challenges of analyzing Indian recipe information across dimensions\nsuch as structure, multilingualism, and uncertainty as well as present our\nongoing work on LLM-based solutions to address these issues. The methods\nproposed in this workshop paper for AI-driven knowledge curation and\ninformation resolution are application-agnostic, generalizable, and replicable\nfor any domain."}
{"id": "2502.17882", "pdf": "https://arxiv.org/pdf/2502.17882.pdf", "abs": "https://arxiv.org/abs/2502.17882", "title": "Science Across Languages: Assessing LLM Multilingual Translation of Scientific Papers", "authors": ["Hannah Calzi Kleidermacher", "James Zou"], "categories": ["cs.AI", "cs.CL"], "comment": null, "summary": "Scientific research is inherently global. However, the vast majority of\nacademic journals are published exclusively in English, creating barriers for\nnon-native-English-speaking researchers. In this study, we leverage large\nlanguage models (LLMs) to translate published scientific articles while\npreserving their native JATS XML formatting, thereby developing a practical,\nautomated approach for implementation by academic journals. Using our approach,\nwe translate articles across multiple scientific disciplines into 28 languages.\nTo evaluate translation accuracy, we introduce a novel question-and-answer (QA)\nbenchmarking method, in which an LLM generates comprehension-based questions\nfrom the original text and then answers them based on the translated text. Our\nbenchmark results show an average performance of 95.9%, showing that the key\nscientific details are accurately conveyed. In a user study, we translate the\nscientific papers of 15 researchers into their native languages, finding that\nthe authors consistently found the translations to accurately capture the\noriginal information in their articles. Interestingly, a third of the authors\nfound many technical terms \"overtranslated,\" expressing a preference to keep\nterminology more familiar in English untranslated. Finally, we demonstrate how\nin-context learning techniques can be used to align translations with\ndomain-specific preferences such as mitigating overtranslation, highlighting\nthe adaptability and utility of LLM-driven scientific translation. The code and\ntranslated articles are available at https://hankleid.github.io/ProjectMundo."}
{"id": "2503.05720", "pdf": "https://arxiv.org/pdf/2503.05720.pdf", "abs": "https://arxiv.org/abs/2503.05720", "title": "That is Unacceptable: the Moral Foundations of Canceling", "authors": ["Soda Marem Lo", "Oscar Araque", "Rajesh Sharma", "Marco Antonio Stranisci"], "categories": ["cs.CY", "cs.CL"], "comment": null, "summary": "Canceling is a morally-driven phenomenon that hinders the development of safe\nsocial media platforms and contributes to ideological polarization. To address\nthis issue we present the Canceling Attitudes Detection (CADE) dataset, an\nannotated corpus of canceling incidents aimed at exploring the factors of\ndisagreements in evaluating people canceling attitudes on social media.\nSpecifically, we study the impact of annotators' morality in their perception\nof canceling, showing that morality is an independent axis for the explanation\nof disagreement on this phenomenon. Annotator's judgments heavily depend on the\ntype of controversial events and involved celebrities. This shows the need to\ndevelop more event-centric datasets to better understand how harms are\nperpetrated in social media and to develop more aware technologies for their\ndetection."}
{"id": "2503.23746", "pdf": "https://arxiv.org/pdf/2503.23746.pdf", "abs": "https://arxiv.org/abs/2503.23746", "title": "Short-video Propagation Influence Rating: A New Real-world Dataset and A New Large Graph Model", "authors": ["Dizhan Xue", "Shengsheng Qian", "Chuanrui Hu", "Changsheng Xu"], "categories": ["cs.CV", "cs.CL", "cs.LG", "cs.MM", "cs.SI"], "comment": null, "summary": "Short-video platforms have gained immense popularity, captivating the\ninterest of millions, if not billions, of users globally. Recently, researchers\nhave highlighted the significance of analyzing the propagation of short-videos,\nwhich typically involves discovering commercial values, public opinions, user\nbehaviors, etc. This paper proposes a new Short-video Propagation Influence\nRating (SPIR) task and aims to promote SPIR from both the dataset and method\nperspectives. First, we propose a new Cross-platform Short-Video (XS-Video)\ndataset, which aims to provide a large-scale and real-world short-video\npropagation network across various platforms to facilitate the research on\nshort-video propagation. Our XS-Video dataset includes 117,720 videos, 381,926\nsamples, and 535 topics across 5 biggest Chinese platforms, annotated with the\npropagation influence from level 0 to 9. To the best of our knowledge, this is\nthe first large-scale short-video dataset that contains cross-platform data or\nprovides all of the views, likes, shares, collects, fans, comments, and comment\ncontent. Second, we propose a Large Graph Model (LGM) named NetGPT, based on a\nnovel three-stage training mechanism, to bridge heterogeneous graph-structured\ndata with the powerful reasoning ability and knowledge of Large Language Models\n(LLMs). Our NetGPT can comprehend and analyze the short-video propagation\ngraph, enabling it to predict the long-term propagation influence of\nshort-videos. Comprehensive experimental results evaluated by both\nclassification and regression metrics on our XS-Video dataset indicate the\nsuperiority of our method for SPIR."}
{"id": "2505.18102", "pdf": "https://arxiv.org/pdf/2505.18102.pdf", "abs": "https://arxiv.org/abs/2505.18102", "title": "How Can I Publish My LLM Benchmark Without Giving the True Answers Away?", "authors": ["Takashi Ishida", "Thanawat Lodkaew", "Ikko Yamane"], "categories": ["cs.LG", "cs.AI", "cs.CL", "stat.ME"], "comment": "Extended version of the paper presented as an Oral at the ICML 2025\n  Workshop on the Impact of Memorization on Trustworthy Foundation Models", "summary": "Publishing a large language model (LLM) benchmark on the Internet risks\ncontaminating future LLMs: the benchmark may be unintentionally (or\nintentionally) used to train or select a model. A common mitigation is to keep\nthe benchmark private and let participants submit their models or predictions\nto the organizers. However, this strategy will require trust in a single\norganization and still permits test-set overfitting through repeated queries.\nTo overcome this issue, we propose a way to publish benchmarks without\ncompletely disclosing the ground-truth answers to the questions, while still\nmaintaining the ability to openly evaluate LLMs. Our main idea is to inject\nrandomness to the answers by preparing several logically correct answers, and\nonly include one of them as the solution in the benchmark. This reduces the\nbest possible accuracy, i.e., Bayes accuracy, of the benchmark. Not only is\nthis helpful to keep us from disclosing the ground truth, but this approach\nalso offers a test for detecting data contamination. In principle, even fully\ncapable models should not surpass the Bayes accuracy. If a model surpasses this\nceiling despite this expectation, this is a strong signal of data\ncontamination. We present experimental evidence that our method can detect data\ncontamination accurately on a wide range of benchmarks, models, and training\nmethodologies."}
{"id": "2506.01115", "pdf": "https://arxiv.org/pdf/2506.01115.pdf", "abs": "https://arxiv.org/abs/2506.01115", "title": "Is Random Attention Sufficient for Sequence Modeling? Disentangling Trainable Components in the Transformer", "authors": ["Yihe Dong", "Lorenzo Noci", "Mikhail Khodak", "Mufan Li"], "categories": ["cs.LG", "cs.CL"], "comment": null, "summary": "The transformer architecture is central to the success of modern Large\nLanguage Models (LLMs), in part due to its surprising ability to perform a wide\nrange of tasks - including mathematical reasoning, memorization, and retrieval\n- using only gradient-based learning on next-token prediction. While the core\ncomponent of a transformer is the self-attention mechanism, we question how\nmuch, and which aspects, of the performance gains can be attributed to it. To\nthis end, we compare standard transformers to variants in which either the MLP\nlayers or the attention weights are frozen at initialization. Surprisingly, we\nfind that attention with frozen key and query weights is not only able to form\ninduction heads, but can also perform competitively on language modeling. We\nformalize this by proving a new expressivity result for transformer models with\nfrozen key and query weights. To further isolate the contribution of attention,\nwe design MixiT, an architecture with entirely random attention scores, with\nprovably stable signal propagation that overcomes prior depth-wise scaling\nchallenges in random transformers. We use the successes and failures of MixiT\nto understand the role each transformer component plays, such as attention\nbeing largely responsible for in-context reasoning, and MLPs being responsible\nfor, but collaborates with attention, on knowledge storage. Our results suggest\nthat the transformer architecture has a built-in inductive bias towards forming\nspecialized circuits, as it does even without learnable attention weights."}
{"id": "2508.08715", "pdf": "https://arxiv.org/pdf/2508.08715.pdf", "abs": "https://arxiv.org/abs/2508.08715", "title": "MultiGen: Child-Friendly Multilingual Speech Generator with LLMs", "authors": ["Xiaoxue Gao", "Huayun Zhang", "Nancy F. Chen"], "categories": ["eess.AS", "cs.AI", "cs.CL", "eess.SP"], "comment": "5 pages", "summary": "Generative speech models have demonstrated significant potential in improving\nhuman-machine interactions, offering valuable real-world applications such as\nlanguage learning for children. However, achieving high-quality, child-friendly\nspeech generation remains challenging, particularly for low-resource languages\nacross diverse languages and cultural contexts. In this paper, we propose\nMultiGen, a multilingual speech generation model with child-friendly\ninteraction, leveraging LLM architecture for speech generation tailored for\nlow-resource languages. We propose to integrate age-appropriate multilingual\nspeech generation using LLM architectures, which can be used to facilitate\nyoung children's communication with AI systems through culturally relevant\ncontext in three low-resource languages: Singaporean accent Mandarin, Malay,\nand Tamil. Experimental results from both objective metrics and subjective\nevaluations demonstrate the superior performance of the proposed MultiGen\ncompared to baseline methods."}
{"id": "2508.16117", "pdf": "https://arxiv.org/pdf/2508.16117.pdf", "abs": "https://arxiv.org/abs/2508.16117", "title": "Extending FKG.in: Towards a Food Claim Traceability Network", "authors": ["Saransh Kumar Gupta", "Rizwan Gulzar Mir", "Lipika Dey", "Partha Pratim Das", "Anirban Sen", "Ramesh Jain"], "categories": ["cs.AI", "cs.CL", "cs.IR"], "comment": "10 pages, 3 figures, 1 table, 45 references, ACM International\n  Conference on Multimedia 2025 - Multi-modal Food Computing Workshop", "summary": "The global food landscape is rife with scientific, cultural, and commercial\nclaims about what foods are, what they do, what they should not do, or should\nnot do. These range from rigorously studied health benefits (probiotics improve\ngut health) and misrepresentations (soaked almonds make one smarter) to vague\npromises (superfoods boost immunity) and culturally rooted beliefs (cold foods\ncause coughs). Despite their widespread influence, the infrastructure for\ntracing, verifying, and contextualizing these claims remains fragmented and\nunderdeveloped. In this paper, we propose a Food Claim-Traceability Network\n(FCN) as an extension of FKG[.]in, a knowledge graph of Indian food that we\nhave been incrementally building. We also present the ontology design and the\nsemi-automated knowledge curation workflow that we used to develop a proof of\nconcept of FKG[.]in-FCN using Reddit data and Large Language Models. FCN\nintegrates curated data inputs, structured schemas, and provenance-aware\npipelines for food-related claim extraction and validation. While directly\nlinked to the Indian food knowledge graph as an application, our methodology\nremains application-agnostic and adaptable to other geographic, culinary, or\nregulatory settings. By modeling food claims and their traceability in a\nstructured, verifiable, and explainable way, we aim to contribute to more\ntransparent and accountable food knowledge ecosystems, supporting researchers,\npolicymakers, and most importantly, everyday consumers in navigating a world\nsaturated with dietary assertions."}
{"id": "2509.01909", "pdf": "https://arxiv.org/pdf/2509.01909.pdf", "abs": "https://arxiv.org/abs/2509.01909", "title": "Oyster-I: Beyond Refusal -- Constructive Safety Alignment for Responsible Language Models", "authors": ["Ranjie Duan", "Jiexi Liu", "Xiaojun Jia", "Shiji Zhao", "Ruoxi Cheng", "Fengxiang Wang", "Cheng Wei", "Yong Xie", "Chang Liu", "Defeng Li", "Yinpeng Dong", "Yichi Zhang", "Yuefeng Chen", "Chongwen Wang", "Xingjun Ma", "Xingxing Wei", "Yang Liu", "Hang Su", "Jun Zhu", "Xinfeng Li", "Yitong Sun", "Jie Zhang", "Jinzhao Hu", "Sha Xu", "Yitong Yang", "Jialing Tao", "Hui Xue"], "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.HC", "cs.SC"], "comment": "Technical Report Code & Model weights available:\n  https://github.com/Alibaba-AAIG/Oyster", "summary": "Large language models (LLMs) typically deploy safety mechanisms to prevent\nharmful content generation. Most current approaches focus narrowly on risks\nposed by malicious actors, often framing risks as adversarial events and\nrelying on defensive refusals. However, in real-world settings, risks also come\nfrom non-malicious users seeking help while under psychological distress (e.g.,\nself-harm intentions). In such cases, the model's response can strongly\ninfluence the user's next actions. Simple refusals may lead them to repeat,\nescalate, or move to unsafe platforms, creating worse outcomes. We introduce\nConstructive Safety Alignment (CSA), a human-centric paradigm that protects\nagainst malicious misuse while actively guiding vulnerable users toward safe\nand helpful results. Implemented in Oyster-I (Oy1), CSA combines game-theoretic\nanticipation of user reactions, fine-grained risk boundary discovery, and\ninterpretable reasoning control, turning safety into a trust-building process.\nOy1 achieves state-of-the-art safety among open models while retaining high\ngeneral capabilities. On our Constructive Benchmark, it shows strong\nconstructive engagement, close to GPT-5, and unmatched robustness on the\nStrata-Sword jailbreak dataset, nearing GPT-o1 levels. By shifting from\nrefusal-first to guidance-first safety, CSA redefines the model-user\nrelationship, aiming for systems that are not just safe, but meaningfully\nhelpful. We release Oy1, code, and the benchmark to support responsible,\nuser-centered AI."}
{"id": "2509.01938", "pdf": "https://arxiv.org/pdf/2509.01938.pdf", "abs": "https://arxiv.org/abs/2509.01938", "title": "EigenBench: A Comparative Behavioral Measure of Value Alignment", "authors": ["Jonathn Chang", "Leonhard Piff", "Suvadip Sana", "Jasmine X. Li", "Lionel Levine"], "categories": ["cs.AI", "cs.CL", "cs.CY", "cs.LG"], "comment": null, "summary": "Aligning AI with human values is a pressing unsolved problem. To address the\nlack of quantitative metrics for value alignment, we propose EigenBench: a\nblack-box method for comparatively benchmarking language models' values. Given\nan ensemble of models, a constitution describing a value system, and a dataset\nof scenarios, our method returns a vector of scores quantifying each model's\nalignment to the given constitution. To produce these scores, each model judges\nthe outputs of other models across many scenarios, and these judgments are\naggregated with EigenTrust (Kamvar et al, 2003), yielding scores that reflect a\nweighted-average judgment of the whole ensemble. EigenBench uses no ground\ntruth labels, as it is designed to quantify traits for which reasonable judges\nmay disagree on the correct label. Using prompted personas, we test whether\nEigenBench scores are more sensitive to the model or the prompt: we find that\nmost of the variance is explained by the prompt, but a small residual\nquantifies the disposition of the model itself."}
{"id": "2509.02077", "pdf": "https://arxiv.org/pdf/2509.02077.pdf", "abs": "https://arxiv.org/abs/2509.02077", "title": "From Attack Descriptions to Vulnerabilities: A Sentence Transformer-Based Approach", "authors": ["Refat Othman", "Diaeddin Rimawi", "Bruno Rossi", "Barbara Russo"], "categories": ["cs.CR", "cs.CL", "cs.LG", "68T50 Natural language processing", "D.4.6; I.2.7"], "comment": "Accepted in The Journal of Systems and Software (2025)", "summary": "In the domain of security, vulnerabilities frequently remain undetected even\nafter their exploitation. In this work, vulnerabilities refer to publicly\ndisclosed flaws documented in Common Vulnerabilities and Exposures (CVE)\nreports. Establishing a connection between attacks and vulnerabilities is\nessential for enabling timely incident response, as it provides defenders with\nimmediate, actionable insights. However, manually mapping attacks to CVEs is\ninfeasible, thereby motivating the need for automation. This paper evaluates 14\nstate-of-the-art (SOTA) sentence transformers for automatically identifying\nvulnerabilities from textual descriptions of attacks. Our results demonstrate\nthat the multi-qa-mpnet-base-dot-v1 (MMPNet) model achieves superior\nclassification performance when using attack Technique descriptions, with an\nF1-score of 89.0, precision of 84.0, and recall of 94.7. Furthermore, it was\nobserved that, on average, 56% of the vulnerabilities identified by the MMPNet\nmodel are also represented within the CVE repository in conjunction with an\nattack, while 61% of the vulnerabilities detected by the model correspond to\nthose cataloged in the CVE repository. A manual inspection of the results\nrevealed the existence of 275 predicted links that were not documented in the\nMITRE repositories. Consequently, the automation of linking attack techniques\nto vulnerabilities not only enhances the detection and response capabilities\nrelated to software security incidents but also diminishes the duration during\nwhich vulnerabilities remain exploitable, thereby contributing to the\ndevelopment of more secure systems."}
{"id": "2509.02175", "pdf": "https://arxiv.org/pdf/2509.02175.pdf", "abs": "https://arxiv.org/abs/2509.02175", "title": "Understanding Space Is Rocket Science -- Only Top Reasoning Models Can Solve Spatial Understanding Tasks", "authors": ["Nils Hoehing", "Mayug Maniparambil", "Ellen Rushe", "Noel E. O'Connor", "Anthony Ventresque"], "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "We propose RocketScience, an open-source contrastive VLM benchmark that tests\nfor spatial relation understanding. It is comprised of entirely new real-world\nimage-text pairs covering mostly relative spatial understanding and the order\nof objects. The benchmark is designed to be very easy for humans and hard for\nthe current generation of VLMs, and this is empirically verified. Our results\nshow a striking lack of spatial relation understanding in open source and\nfrontier commercial VLMs and a surprisingly high performance of reasoning\nmodels. Additionally, we perform a disentanglement analysis to separate the\ncontributions of object localization and spatial reasoning in\nchain-of-thought-based models and find that the performance on the benchmark is\nbottlenecked by spatial reasoning and not object localization capabilities. We\nrelease the dataset with a CC-BY-4.0 license and make the evaluation code\navailable at: https://github.com/nilshoehing/rocketscience"}
